Repository: Dark-Basic-Software-Limited/AGKClassic
Catalog: AGK/IDE/Geany-1.24.1/po/*.po
Languages: ja, ru, zh_cn

source: You must choose an output folder to save your APKs
ja: APKを保存するには出力フォルダを選択する必要があります
ru: Вы должны выбрать папку вывода для сохранения APK.
zh_cn: 您必须选择一个输出文件夹来保存您的APK

source: You must have at least one project open to export all
ja: 少なくとも1つのプロジェクトを開いてすべてをエクスポートする必要があります
ru: У вас должен быть хотя бы один проект, открытый для экспорта всех
zh_cn: 您必须至少打开一个项目才能导出所有项目

source: You must choose an output location to save your keystore file
ja: キーストアファイルを保存する出力場所を選択する必要があります
ru: Вы должны выбрать местоположение вывода, чтобы сохранить файл хранилища ключей
zh_cn: 您必须选择一个输出位置来保存密钥库文件

source: "%s" already exists. Do you want to overwrite it?
ja: "％s"は既に存在します。上書きしますか？
ru: «% s» уже существует. Вы хотите переписать его?
zh_cn: “％s”已经存在。你想覆盖它吗？

source: Full name must be less than 30 characters
ja: 完全な名前は30文字未満でなければなりません
ru: Полное имя должно быть менее 30 символов.
zh_cn: 全名不得超过30个字符

source: Full name contains invalid characters, must be A-Z and spaces only
ja: フルネームには無効な文字が含まれており、A-Zとスペースのみでなければなりません
ru: Полное имя содержит недопустимые символы, должно быть только A-Z и только пробелы
zh_cn: 全名包含无效字符，只能是A-Z和空格

source: Company name must be less than 30 characters
ja: 会社名は30文字未満でなければなりません
ru: Название компании должно быть не менее 30 символов
zh_cn: 公司名称必须少于30个字符

source: Company name contains invalid characters, must be A-Z and spaces only
ja: 会社名に無効な文字が含まれており、A〜Zとスペースのみである必要があります
ru: Название компании содержит недопустимые символы, должно быть только A-Z и только пробелы
zh_cn: 公司名称包含无效字符，只能是A-Z和空格

source: City must be less than 30 characters
ja: 市区町村は30文字未満でなければなりません
ru: Город должен быть менее 30 символов
zh_cn: 城市不得超过30个字符

source: City contains invalid characters, must be A-Z and spaces only
ja: 市は無効な文字を含んでいますが、A-Zとスペースのみでなければなりません
ru: Город содержит недопустимые символы, должен быть только A-Z и только пробелы
zh_cn: 城市包含无效字符，必须是A-Z和空格

source: Country code must be 2 characters
ja: 国コードは2文字でなければなりません
ru: Код страны должен быть 2 символа
zh_cn: 国家代码必须是2个字符

source: Country code contains invalid characters, must be A-Z only
ja: 国コードに無効な文字が含まれています.A〜Zのみでなければなりません
ru: Код страны содержит недопустимые символы, должен быть только A-Z
zh_cn: 国家代码包含无效字符，只能是A-Z

source: Password cannot be blank
ja: パスワードは空白にできません
ru: Пароль не может быть пустым
zh_cn: 密码不能为空

source: Password must be at least 6 characters long
ja: パスワードは6文字以上でなければなりません
ru: пароль должен содержать как минимум 6 символов
zh_cn: 密码必须至少有6个字符长

source: Password cannot contain double quotes
ja: パスワードには二重引用符を使用できません
ru: Пароль не может содержать двойные кавычки
zh_cn: 密码不能包含双引号

source: Passwords do not match
ja: パスワードが一致していません
ru: Пароли не совпадают
zh_cn: 密码不匹配

source: Could not find keytool program, the path "%s" is incorrect
ja: keytoolプログラムが見つかりませんでした。パス "％s"が間違っています
ru: Не удалось найти программу keytool, путь «% s» неверен
zh_cn: 找不到keytool程序，路径“％s”不正确

source: Failed to run keytool program: %s
ja: キーツールプログラムの実行に失敗しました：％s
ru: Не удалось запустить программу keytool:% s
zh_cn: 无法运行keytool程序：％s

source: keytool program returned error: %s
ja: keytoolプログラムがエラーを返しました：％s
ru: Ошибка программы keytool:% s
zh_cn: keytool程序返回错误：％s

source: Generate Keystore
ja: キーストアを生成する
ru: Создать Keystore
zh_cn: 生成密钥库

source: You must choose an output location to save your IPA
ja: IPAを保存するには出力場所を選択する必要があります
ru: Вы должны выбрать местоположение вывода для сохранения IPA
zh_cn: 您必须选择一个输出位置来保存您的IPA

source: App name contains invalid characters, it must not contain quotes or any of the following < > * . / \ : ; | = , &
ja: アプリ名に無効な文字が含まれています。引用符や次の<> *のいずれも含まないでください。 / \：; | =、
ru: Имя приложения содержит недопустимые символы, оно не должно содержать кавычек или любое из следующих <> *. / \:; | знак равно
zh_cn: 应用程序名称包含无效字符，不得包含引号或任何以下的<> *。 / \：; | =，＆

source: Firebase config file must be a .plist file
ja: Firebase設定ファイルは.plistファイルでなければなりません
ru: Файл конфигурации Firebase должен быть .plist-файлом
zh_cn: Firebase配置文件必须是.plist文件

source: Could not find Firebase config file
ja: Firebase設定ファイルが見つかりませんでした
ru: Не удалось найти файл конфигурации Firebase
zh_cn: 找不到Firebase配置文件

source: Splash screen (640x960) must be a PNG file
ja: スプラッシュ画面（640x960）はPNGファイルである必要があります
ru: Заставка (640x960) должна быть PNG-файлом
zh_cn: 启动画面（640x960）必须是PNG文件

source: Could not find splash screen (640x960) location
ja: スプラッシュスクリーン（640x960）の場所が見つかりませんでした
ru: Не удалось найти местоположение заставки (640x960)
zh_cn: 无法找到启动画面（640x960）的位置

source: Splash screen (640x1136) must be a PNG file
ja: スプラッシュ画面（640x1136）はPNGファイルである必要があります
ru: Заставка (640x1136) должна быть PNG-файлом
zh_cn: 启动画面（640x1136）必须是PNG文件

source: Could not find splash screen (640x1136) location
ja: スプラッシュスクリーン（640x1136）の場所が見つかりませんでした
ru: Не удалось найти экран заставки (640x1136)
zh_cn: 无法找到启动画面（640x1136）的位置

source: Splash screen (1536x2048) must be a PNG file
ja: スプラッシュ画面（1536x2048）はPNGファイルである必要があります
ru: Заставка (1536x2048) должна быть PNG-файлом
zh_cn: 启动画面（1536x2048）必须是PNG文件

source: Could not find splash screen (1536x2048) location
ja: スプラッシュ画面（1536x2048）の場所が見つかりませんでした
ru: Не удалось найти местоположение заставки (1536x2048)
zh_cn: 无法找到启动画面（1536x2048）的位置

source: Splash screen (1125x2436) must be a PNG file
ja: スプラッシュ画面（1125x2436）はPNGファイルである必要があります
ru: Заставка (1125x2436) должна быть PNG-файлом
zh_cn: 启动画面（1125x2436）必须是PNG文件

source: Could not find splash screen (1125x2436) location
ja: スプラッシュスクリーン（1125x2436）の場所を見つけることができませんでした
ru: Не удалось найти заставку (1125x2436).
zh_cn: 找不到启动画面（1125x2436）的位置

source: You must select a provisioning profile
ja: プロビジョニングプロファイルを選択する必要があります
ru: Вы должны выбрать профиль подготовки
zh_cn: 您必须选择一个配置文件

source: Provisioning profile must have .mobileprovision extension
ja: プロビジョニングプロファイルには、.mobileprovision拡張子が必要です
ru: Профиль предоставления должен иметь расширение .mobileprovision
zh_cn: 供应配置文件必须具有.mobileprovision扩展

source: Could not find provisioning profile location
ja: プロビジョニングプロファイルの場所を見つけることができませんでした
ru: Не удалось найти расположение профиля для профайла
zh_cn: 找不到配置文件位置

source: You must enter a version number, e.g. 1.0.0
ja: バージョン番号を入力する必要があります。 1.0.0
ru: Вы должны ввести номер версии, например. 1.0.0
zh_cn: 您必须输入版本号，例如1.0.0

source: Version number contains invalid characters, must be 0-9 and . only
ja: バージョン番号に無効な文字が含まれています。のみ
ru: Номер версии содержит недопустимые символы, должен быть 0-9 и. только
zh_cn: 版本号包含无效字符，必须是0-9和。只要

source: Facebook App ID must be numbers only
ja: Facebook App IDは数字のみでなければなりません
ru: Идентификатор приложения Facebook должен быть только номером
zh_cn: Facebook应用程序ID只能是数字

source: As of iOS 11 you must install XCode to export iOS apps from the AGK IDE. XCode can be downloaded from the Mac AppStore
ja: iOS 11以降、AGOS IDEからiOSアプリケーションをエクスポートするには、XCodeをインストールする必要があります。 XcodeはMac AppStoreからダウンロードできます
ru: Начиная с iOS 11 вы должны установить XCode для экспорта приложений iOS из среды AGK. XCode можно загрузить из Mac AppStore
zh_cn: 从iOS 11开始，您必须安装XCode才能从AGK IDE导出iOS应用程序。 XCode可以从Mac AppStore下载

source: Failed to read provisioning profile
ja: プロビジョニングプロファイルの読み込みに失敗しました
ru: Не удалось прочитать профиль подготовки
zh_cn: 无法读取配置文件

source: Failed to read certificate from provisioning profile
ja: プロビジョニングプロファイルから証明書を読み取れませんでした
ru: Не удалось прочитать сертификат из профиля обеспечения
zh_cn: 无法从配置文件读取证书

source: Failed to read certificate data from provisioning profile
ja: プロビジョニングプロファイルから証明書データの読み取りに失敗しました
ru: Не удалось прочитать данные сертификата из профиля обеспечения
zh_cn: 无法从配置文件读取证书数据

source: Failed to read certificate end data from provisioning profile
ja: プロビジョニングプロファイルから証明書のエンドデータを読み取ることができませんでした
ru: Не удалось прочитать данные о завершении сертификации из профиля подготовки
zh_cn: 无法从配置文件读取证书最终数据

source: Failed to read bundle ID from provisioning profile
ja: プロビジョニングプロファイルからバンドルIDを読み取ることができませんでした
ru: Не удалось прочитать идентификатор пакета из профиля обеспечения
zh_cn: 无法从供应配置文件读取软件包ID

source: Failed to read bundle ID data from provisioning profile
ja: プロビジョニングプロファイルからバンドルIDデータを読み取ることができませんでした
ru: Не удалось прочитать данные идентификатора пакета из профиля обеспечения
zh_cn: 无法从供应配置文件读取软件包ID数据

source: Failed to read bundle ID end data from provisioning profile
ja: バンドルIDの終了データをプロビジョニングプロファイルから読み取ることができませんでした
ru: Не удалось прочитать конечные данные идентификатора пакета из профиля обеспечения
zh_cn: 无法从配置文件读取包ID结束数据

source: Failed to read App Group data from provisioning profile
ja: プロビジョニングプロファイルからApp Groupデータを読み取ることができませんでした
ru: Не удалось прочитать данные группы приложений из профиля обеспечения
zh_cn: 无法从配置文件中读取App Group数据

source: Failed to read App Group end data from provisioning profile
ja: App Groupのエンドデータをプロビジョニングプロファイルから読み取ることができませんでした
ru: Не удалось прочитать конечные данные группы приложений из профиля подготовки
zh_cn: 无法从配置文件中读取App Group最终数据

source: Failed to read team ID from provisioning profile
ja: プロビジョニングプロファイルからチームIDを読み込めませんでした
ru: Не удалось прочитать идентификатор команды из профиля обеспечения
zh_cn: 无法从配置文件中读取团队ID

source: Failed to read team ID data from provisioning profile
ja: プロビジョニングプロファイルからチームIDデータを読み取ることができませんでした
ru: Не удалось прочитать данные идентификатора команды из профиля обеспечения
zh_cn: 无法从配置文件中读取团队ID数据

source: Failed to read team ID end data from provisioning profile
ja: プロビジョニングプロファイルからチームIDの終了データを読み取ることができませんでした
ru: Не удалось прочитать конечные данные идентификатора команды из профиля обеспечения
zh_cn: 无法从配置文件中读取团队ID结束数据

source: Failed to run "security" program: %s
ja: 「セキュリティ」プログラムの実行に失敗しました：％s
ru: Не удалось запустить программу «security»:% s
zh_cn: 无法运行“安全”程序：％s

source: Failed to get code signing identities (error %d: %s)
ja: コード署名IDを取得できませんでした（エラー％d：％s）
ru: Не удалось получить идентификаторы подписи кода (ошибка% d:% s)
zh_cn: 无法获取代码签名标识（错误％d：％s）

source: Failed to get code signing identities (error: %d)
ja: コード署名IDを取得できませんでした（エラー：％d）
ru: Не удалось получить идентификаторы подписи кода (ошибка:% d)
zh_cn: 无法获取代码签名标识（错误：％d）

source: Failed to read code signing identity from certificate list
ja: 証明書リストからコード署名IDを読み取ることができませんでした
ru: Не удалось прочитать идентификатор подписи кода из списка сертификатов
zh_cn: 无法从证书列表中读取代码签名身份

source: Failed to read certificate data from certificate list
ja: 証明書リストから証明書データを読み取ることができませんでした
ru: Не удалось прочитать данные сертификата из списка сертификатов
zh_cn: 无法从证书列表中读取证书数据

source: Failed to read certificate end data from certificate list
ja: 証明書リストから証明書の終了データを読み取ることができませんでした
ru: Не удалось прочитать данные сертификата из списка сертификатов
zh_cn: 无法从证书列表中读取证书结束数据

source: Could not find the certificate used to create the provisioning profile, have you added the certificate to your keychain?
ja: プロビジョニングプロファイルの作成に使用した証明書が見つかりませんでした。証明書をキーチェーンに追加しましたか？
ru: Не удалось найти сертификат, используемый для создания профиля подготовки, добавили ли вы сертификат в цепочку ключей?
zh_cn: 找不到用于创建配置文件的证书，是否已将证书添加到您的钥匙串？

source: Signing certificate is not valid, either the private key is missing from your keychain, or the certificate has expired
ja: 署名証明書が無効です。秘密キーがキーチェーンにないか、証明書が期限切れです。
ru: Сертификат подписи недействителен, либо отсутствует секретный ключ в вашей цепочке ключей, либо срок действия сертификата истек.
zh_cn: 签名证书无效，您的钥匙串中缺少私钥，或者证书已过期

source: Failed to write entitlements file: %s
ja: エンタイトルメントファイルの書き込みに失敗しました：％s
ru: Не удалось написать файл прав:% s
zh_cn: 无法写入权利文件：％s

source: Failed to write expanded entitlements file: %s
ja: 拡張エンタイトルメントファイルの作成に失敗しました：％s
ru: Не удалось создать файл расширенных прав:% s
zh_cn: 无法写入扩展权利文件：％s

source: Failed to read Info.plist file
ja: Info.plistファイルの読み込みに失敗しました
ru: Не удалось прочитать файл Info.plist
zh_cn: 无法读取Info.plist文件

source: Failed to write Info.plist file
ja: Info.plistファイルの書き込みに失敗しました
ru: Не удалось записать файл Info.plist
zh_cn: 无法写入Info.plist文件

source: Failed to run userid program: %s
ja: ユーザーIDプログラムの実行に失敗しました：％s
ru: Не удалось запустить программу userid:% s
zh_cn: 无法运行userid程序：％s

source: Failed to create icon asset catalog
ja: アイコン資産カタログの作成に失敗しました
ru: Не удалось создать каталог активов значков
zh_cn: 无法创建图标资产目录

source: Failed to save 152x152 icon: %s
ja: 152x152アイコンを保存できませんでした：％s
ru: Не удалось сохранить значок 152x152:% s
zh_cn: 无法保存152x152图标：％s

source: Failed to save 180x180 icon: %s
ja: 180x180アイコンを保存できませんでした：％s
ru: Не удалось сохранить значок 180x180:% s
zh_cn: 无法保存180x180图标：％s

source: Failed to save 167x167 icon: %s
ja: 167x167アイコンを保存できませんでした：％s
ru: Не удалось сохранить значок 167x167:% s
zh_cn: 无法保存167x167图标：％s

source: Failed to save 120x120 icon: %s
ja: 120x120アイコンを保存できませんでした：％s
ru: Не удалось сохранить значок 120x120:% s
zh_cn: 无法保存120x120图标：％s

source: Failed to save 76x76 icon: %s
ja: 76x76アイコンを保存できませんでした：％s
ru: Не удалось сохранить значок 76x76:% s
zh_cn: 无法保存76x76图标：％s

source: Failed to save 60x60 icon: %s
ja: 60x60アイコンを保存できませんでした：％s
ru: Не удалось сохранить значок 60x60:% s
zh_cn: 无法保存60x60图标：％s

source: Failed to save 1024x1024 icon: %s
ja: 1024x1024アイコンを保存できませんでした：％s
ru: Не удалось сохранить значок 1024x1024:% s
zh_cn: 无法保存1024x1024图标：％s

source: Failed to run "actool" program: %s
ja: "actool"プログラムの実行に失敗しました：％s
ru: Не удалось запустить программу «actool»:% s
zh_cn: 未能运行“actool”程序：％s

source: Failed to compile asset catalog (error %d: %s)
ja: 資産カタログをコンパイルできませんでした（エラー％d：％s）
ru: Не удалось скомпилировать каталог активов (ошибка% d:% s)
zh_cn: 无法编译资产目录（错误％d：％s）

source: Failed to get compile asset catalog (error: %d)
ja: 資産カタログのコンパイルに失敗しました（エラー：％d）
ru: Не удалось получить каталог активов компиляции (ошибка:% d)
zh_cn: 无法获得编译资产目录（错误：％d）

source: Failed to load splash screen (640x960): %s
ja: スプラッシュ画面（640x960）を読み込めませんでした：％s
ru: Не удалось загрузить заставку (640x960):% s
zh_cn: 无法加载启动画面（640x960）：％s

source: Splash screen (640x960) should have an aspect ratio near 0.66 (e.g. 320x480 or 640x960) otherwise it will look stretched when scaled. Export will continue.
ja: スプラッシュ画面（640x960）のアスペクト比は0.66に近い値（320x480や640x960など）にする必要があります。それ以外の場合は、拡大縮小時に引き伸ばされます。輸出は続行されます。
ru: Заставка (640x960) должна иметь соотношение сторон около 0,66 (например, 320x480 или 640x960), иначе она будет выглядеть растянутой при масштабировании. Экспорт будет продолжен.
zh_cn: 启动画面（640x960）的宽高比应该接近0.66（例如320x480或640x960），否则在缩放时看起来会拉长。导出将继续。

source: Failed to save Default@2x.png splash screen: %s
ja: Default@2x.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить заставку default@2x.png:% s
zh_cn: 无法保存Default@2x.png启动画面：％s

source: Failed to load splash screen (640x1136): %s
ja: スプラッシュ画面（640x1136）を読み込めませんでした：％s
ru: Не удалось загрузить экран заставки (640x1136):% s
zh_cn: 无法加载启动画面（640x1136）：％s

source: Splash screen (640x1136) should have an aspect ratio near 0.56 (e.g. 640x1136 or 1080x1920) otherwise it will look stretched when scaled. Export will continue.
ja: スプラッシュ画面（640x1136）のアスペクト比は0.56（たとえば640x1136または1080x1920）にする必要があります。それ以外の場合は、拡大縮小したときに引き伸ばされます。輸出は続行されます。
ru: Заставка (640x1136) должна иметь соотношение сторон около 0,56 (например, 640x1136 или 1080x1920), иначе она будет выглядеть растянутой при масштабировании. Экспорт будет продолжен.
zh_cn: 启动画面（640x1136）的纵横比应该接近0.56（例如640x1136或1080x1920），否则在缩放时看起来会拉长。导出将继续。

source: Failed to save Default-568h@2x.png splash screen: %s
ja: Default-568h@2x.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить заставку по умолчанию: 568h@2x.png:% s
zh_cn: 无法保存Default-568h@2x.png启动画面：％s

source: Failed to save Default-375w-667h@2x.png splash screen: %s
ja: Default-375w-667h@2x.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить заставку по умолчанию: 375w-667h@2x.png:% s
zh_cn: 无法保存Default-375w-667h@2x.png启动画面：％s

source: Failed to save Default-414w-736h@3x.png splash screen: %s
ja: Default-414w-736h@3x.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить заставку по умолчанию: 414w-736h@3x.png:% s
zh_cn: 无法保存Default-414w-736h@3x.png启动画面：％s

source: Failed to load splash screen (1125x2436): %s
ja: スプラッシュ画面を読み込めませんでした（1125x2436）：％s
ru: Не удалось загрузить заставку (1125x2436):% s
zh_cn: 无法加载启动画面（1125x2436）：％s

source: Splash screen (1125x2436) should have an aspect ratio near 0.46 otherwise it will look stretched when scaled. Export will continue.
ja: スプラッシュスクリーン（1125x2436）のアスペクト比は0.46に近くなければなりません。それ以外の場合は、スケーリング時に引き伸ばされて見えます。輸出は続行されます。
ru: Заставка (1125x2436) должна иметь соотношение сторон около 0,46, иначе она будет выглядеть растянутой при масштабировании. Экспорт будет продолжен.
zh_cn: 启动画面（1125x2436）的宽高比应该在0.46附近，否则在缩放时看起来会拉长。导出将继续。

source: Failed to save Default-375w-812h@3x.png splash screen: %s
ja: Default-375w-812h@3x.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить заставку по умолчанию: 375w-812h@3x.png:% s
zh_cn: 无法保存Default-375w-812h@3x.png启动画面：％s

source: Failed to load splash screen (1536x2048): %s
ja: スプラッシュ画面を読み込めませんでした（1536x2048）：％s
ru: Не удалось загрузить заставку (1536x2048):% s
zh_cn: 无法加载启动画面（1536x2048）：％s

source: Splash screen (1536x2048) should have an aspect ratio near 0.75 (e.g. 768x1024 or 1536x2048) otherwise it will look stretched when scaled. Export will continue.
ja: スプラッシュ画面（1536x2048）のアスペクト比は0.75（たとえば768x1024または1536x2048）にする必要があります。それ以外の場合は、拡大縮小時に引き伸ばされます。輸出は続行されます。
ru: Экран заставки (1536x2048) должен иметь соотношение сторон около 0,75 (например, 768x1024 или 1536x2048), иначе оно будет выглядеть растянутым при масштабировании. Экспорт будет продолжен.
zh_cn: 初始屏幕（1536x2048）应该具有接近0.75的宽高比（例如768x1024或1536x2048），否则在缩放时它看起来会拉长。导出将继续。

source: Failed to save Default-Portrait~ipad.png splash screen: %s
ja: Default-Portrait〜ipad.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить всплывающий экран Default-Portrait ~ ipad.png:% s
zh_cn: 无法保存Default-Portrait〜ipad.png启动画面：％s

source: Failed to save Default-Portrait@2x~ipad.png splash screen: %s
ja: Default-Portrait@2x~ipad.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить всплывающий экран Default-Portrait@2x~ipad.png:% s
zh_cn: 无法保存Default-Portrait@2x~ipad.png启动画面：％s

source: Failed to save Default-Portrait-1366h@2x~ipad.png splash screen: %s
ja: Default-Portrait-1366h@2x~ipad.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить Default -Portrait-1366h@2x~ipad.png заставку:% s
zh_cn: 无法保存Default-Portrait-1366h@2x~ipad.png启动画面：％s

source: Failed to save Default-Landscape~ipad.png splash screen: %s
ja: Default-Landscape〜ipad.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить всплывающий экран Default-Landscape ~ ipad.png:% s
zh_cn: 无法保存Default-Landscape〜ipad.png启动画面：％s

source: Failed to save Default-Landscape@2x~ipad.png splash screen: %s
ja: Default-Landscape@2x~ipad.pngスプラッシュ画面を保存できませんでした：％s
ru: Не удалось сохранить всплывающий экран Default-Landscape@2x~ipad.png:% s
zh_cn: 无法保存Default-Landscape@2x~ipad.png启动画面：％s

source: Failed to save Default-Landscape-1366h@2x~ipad.png splash screen: %s
ja: デフォルトの保存に失敗しました - ランドスケープ-1366h@2x~ipad.pngスプラッシュ画面：％s
ru: Не удалось сохранить заставку Default-Landscape-1366h@2x~ipad.png:% s
zh_cn: 无法保存Default-Landscape-1366h@2x~ipad.png启动画面：％s

source: Failed to get user name (error: %d)
ja: ユーザー名を取得できませんでした（エラー：％d）
ru: Не удалось получить имя пользователя (ошибка:% d)
zh_cn: 无法获取用户名（错误：％d）

source: Failed to run groupid program: %s
ja: groupidプログラムの実行に失敗しました：％s
ru: Не удалось запустить программу groupid:% s
zh_cn: 无法运行groupid程序：％s

source: Failed to get group name (error: %d)
ja: グループ名の取得に失敗しました（エラー：％d）
ru: Не удалось получить имя группы (ошибка:% d)
zh_cn: 无法获取组名称（错误：％d）

source: Failed to run chown program: %s
ja: chownプログラムの実行に失敗しました：％s
ru: Не удалось запустить программу chown:% s
zh_cn: 无法运行chown程序：％s

source: Failed to run chmod program: %s
ja: chmodプログラムの実行に失敗しました：％s
ru: Не удалось запустить программу chmod:% s
zh_cn: 无法运行chmod程序：％s

source: Failed to run codesign program: %s
ja: codesignプログラムの実行に失敗しました：％s
ru: Не удалось запустить программу кодирования:% s
zh_cn: 无法运行代码签名程序：％s

source: Failed to initialise zip file for writing
ja: 書き込みのためにzipファイルを初期化できませんでした
ru: Не удалось инициализировать zip-файл для записи
zh_cn: 无法初始化用于写入的zip文件

source: Failed to add files to IPA
ja: IPAにファイルを追加できませんでした
ru: Не удалось добавить файлы в IPA
zh_cn: 无法将文件添加到IPA

source: Failed to finalize IPA file
ja: IPAファイルのファイナライズに失敗しました
ru: Не удалось завершить файл IPA
zh_cn: 无法完成IPA文件

source: Failed to end IPA file
ja: IPAファイルを終了できませんでした
ru: Не удалось завершить файл IPA
zh_cn: 无法结束IPA文件

source: Export IPA
ja: 輸出IPA
ru: Экспорт IPA
zh_cn: 导出IPA

source: Project file "%s" could not be written
ja: プロジェクトファイル "％s"を書き込めませんでした
ru: Файл проекта «% s» не может быть записан
zh_cn: 项目文件“％s”无法写入

source: Project "%s" closed.
ja: プロジェクト "％s"が閉じました。
ru: Проект «% s» закрыт.
zh_cn: 项目“％s”已关闭。

source: Failed to add file to project, no current project selected. Click Project in the menu bar to create a new project or open an existing one.
ja: 現在のプロジェクトが選択されていないため、プロジェクトにファイルを追加できませんでした。メニューバーの[プロジェクト]をクリックして、新しいプロジェクトを作成するか、既存のプロジェクトを開きます。
ru: Не удалось добавить файл в проект, не выбран текущий проект. Нажмите «Проект» в строке меню, чтобы создать новый проект или открыть существующий.
zh_cn: 无法将文件添加到项目，未选择当前项目。点击菜单栏中的项目来创建一个新项目或打开一个新项目。

source: Project file could not be saved
ja: プロジェクトファイルを保存できませんでした
ru: Файл проекта не может быть сохранен
zh_cn: 项目文件无法保存

source: Project "%s" saved.
ja: プロジェクト "％s"が保存されました。
ru: Проект «% s» сохранен.
zh_cn: 已保存项目“％s”。

source: Failed to remove file from project, no current project selected
ja: プロジェクトからファイルを削除できませんでした。現在選択されているプロジェクトはありません
ru: Не удалось удалить файл из проекта, не выбран текущий проект
zh_cn: 无法从项目中删除文件，未选择当前项目

source: Do you want to close it before proceeding?
ja: 続行する前に閉じたいですか？
ru: Вы хотите закрыть его перед продолжением?
zh_cn: 在继续之前你想关闭它吗？

source: The '%s' project is open.
ja: '％s'プロジェクトが開いています。
ru: Проект «% s» открыт.
zh_cn: '％s'项目已经开放。

source: Failed to import project source file, project file may be corrupt
ja: プロジェクトソースファイルのインポートに失敗しました。プロジェクトファイルが破損している可能性があります。
ru: Не удалось импортировать исходный файл проекта, файл проекта может быть поврежден
zh_cn: 无法导入项目源文件，项目文件可能已损坏

source: Project "%s" imported.
ja: プロジェクト "％s"をインポートしました。
ru: Проект «% s» импортирован.
zh_cn: 已导入项目“％s”。

source: The specified project name is too short.
ja: 指定されたプロジェクト名が短すぎます。
ru: Указанное название проекта слишком короткое.
zh_cn: 指定的项目名称太短。

source: The specified project name is too long (max. %d characters).
ja: 指定されたプロジェクト名が長すぎます（最大％d文字）。
ru: Указанное название проекта слишком велико (максимум% d символов).
zh_cn: 指定的项目名称太长（最多％d个字符）。

source: The project must have a base path
ja: プロジェクトには基本パスが必要です
ru: Проект должен иметь базовый путь
zh_cn: 该项目必须有一个基本路径

source: The project path must be an absolute path
ja: プロジェクトパスは絶対パスでなければなりません
ru: Путь к проекту должен быть абсолютным путем
zh_cn: 项目路径必须是绝对路径

source: Project base directory could not be created (%s).
ja: プロジェクトのベースディレクトリを作成できませんでした（％s）。
ru: Не удалось создать каталог проекта (% s).
zh_cn: 项目基地目录无法创建（％s）。

source: You have specified an invalid project filename.
ja: 無効なプロジェクトファイル名を指定しました。
ru: Вы указали недопустимое имя файла проекта.
zh_cn: 您指定了无效的项目文件名。

source: Project file could not be written (%s).
ja: プロジェクトファイルを書き込めませんでした（％s）。
ru: Файл проекта не может быть записан (% s).
zh_cn: 项目文件无法写入（％s）。

source: Choose Project Filename
ja: プロジェクトファイル名を選択
ru: Выберите «Имя файла проекта»
zh_cn: 选择项目文件名

source: Project "%s" opened.
ja: プロジェクト "％s"が開かれました。
ru: Проект «% s» открыт.
zh_cn: 项目“％s”已打开。

source: _Use regular expressions
ja: _正規表現を使用する
ru: _Используйте регулярные выражения
zh_cn: _使用正则表达式

source: Use POSIX-like regular expressions. For detailed information about using regular expressions, please read the documentation.
ja: POSIXのような正規表現を使用してください。正規表現の使用の詳細については、ドキュメントをお読みください。
ru: Используйте регулярные выражения типа POSIX. Подробную информацию об использовании регулярных выражений см. В документации.
zh_cn: 使用类似POSIX的正则表达式。有关使用正则表达式的详细信息，请阅读文档。

source: Search _backwards
ja: 検索_backwards
ru: Поиск _backwards
zh_cn: 搜索_backwards
