Repository: Dark-Basic-Software-Limited/AGKClassic
Catalog: AGK/IDE/Geany-1.24.1/po/*.po
Languages: ja, ru, zh_cn

source: Geany needs to move your old configuration directory before starting.
ja: Geanyは起動する前に古い設定ディレクトリを移動する必要があります。
ru: Перед запуском Geany необходимо переместить старый каталог конфигурации.
zh_cn: Geany需要在开始之前移动旧的配置目录。

source: Your configuration directory has been successfully moved from "%s" to "%s".
ja: 設定ディレクトリが "％s"から "％s"に正常に移動されました。
ru: Ваш каталог конфигурации успешно перемещен с «% s» на «% s».
zh_cn: 您的配置目录已成功从“％s”移动到“％s”。

source: Your old configuration directory "%s" could not be moved to "%s" (%s). Please move manually the directory to the new location.
ja: 古い設定ディレクトリ "％s"を "％s"（％s）に移動できませんでした。手動でディレクトリを新しい場所に移動してください。
ru: Ваш старый каталог конфигурации «% s» не может быть перенесен в «% s» (% s). Переместите вручную каталог в новое место.
zh_cn: 您的旧配置目录“％s”无法移动到“％s”（％s）。请将目录手动移动到新位置。

source: Configuration directory could not be created (%s). There could be some problems using Geany without a configuration directory. Start Geany anyway?
ja: 構成ディレクトリを作成できませんでした（％s）。 設定ディレクトリなしでGeanyを使用するといくつかの問題が生じる可能性があります。 とにかくGeanyを起動しますか？
ru: Не удалось создать каталог конфигурации (% s). Могут быть некоторые проблемы с использованием Geany без каталога конфигурации. Начните Geany в любом случае?
zh_cn: 配置目录无法创建（％s）。 在没有配置目录的情况下使用Geany可能会出现一些问题。 无论如何启动Geany？

source: Configuration directory could not be created (%s).
ja: 構成ディレクトリを作成できませんでした（％s）。
ru: Не удалось создать каталог конфигурации (% s).
zh_cn: 配置目录无法创建（％s）。

source: Configuration files reloaded.
ja: 構成ファイルが再ロードされました。
ru: Файлы конфигурации перезагружены.
zh_cn: 重新加载配置文件。

source: Status messages
ja: ステータスメッセージ
ru: Сообщения о состоянии
zh_cn: 状态消息

source: C_opy
zh_cn: 复制

source: Copy _All
ja: _Allをコピー
ru: Копировать _Все
zh_cn: 复制_All

source: _Hide Message Window
ja: _メッセージウィンドウを隠す
zh_cn: _隐藏消息窗口

source: Could not find file '%s' - trying the current document path.
ja: ファイル '％s'が見つかりません - 現在のドキュメントパスを試しています。
ru: Не удалось найти файл «% s» - пробовать текущий путь к документу.
zh_cn: 找不到文件'％s' - 尝试当前文档路径。

source: Switch to Document
ja: ドキュメントに切り替える
ru: Переключиться на документ
zh_cn: 切换到文档

source: C_lose All
ja: C_loseすべて
ru: Закрыть все
zh_cn: 关闭所有

source: The plugin "%s" is not binary compatible with this release of Geany - please recompile it.
ja: プラグイン "％s"はこのGeanyのリリースとバイナリ互換ではありません。再コンパイルしてください。
ru: Плагин «% s» не является бинарным, совместимым с этой версией Geany, пожалуйста, перекомпилируйте его.
zh_cn: 插件“％s”与本版本的Geany不是二进制兼容的，请重新编译它。

source: _Plugin Manager
ja: _プラグインマネージャ
zh_cn: _插件管理器

source: Active
ja: アクティブ
ru: активный
zh_cn: 活性

source: Plugin
ja: プラグイン
zh_cn: 插入

source: Description
ja: 説明
ru: Описание
zh_cn: 描述

source: No plugins available.
ja: プラグインはありません。
ru: Плагинов нет.
zh_cn: 没有插件可用。

source: Plugins
ja: プラグイン
ru: Плагины
zh_cn: 插件

source: Choose which plugins should be loaded at startup:
ja: 起動時に読み込むプラグインを選択する：
ru: Выберите, какие плагины должны быть загружены при запуске:
zh_cn: 选择在启动时加载哪些插件：

source: <b>Plugin details:</b>
ja: <b>プラグインの詳細：</ b>
ru: <b> Сведения о плагине: </ b>
zh_cn: <b>插件详细信息：</ b>

source: Plugin:
ja: プラグイン：
ru: Плагин:
zh_cn: 插入：

source: Author(s):
ja: 著者：
ru: Авторы):
zh_cn: 作者（S）：

source: Configure Plugins
ja: プラグインの設定
ru: Настройка плагинов
zh_cn: 配置插件

source: Grab Key
ja: グラブキー
ru: Клавиша захвата
zh_cn: 抓住钥匙

source: Press the combination of the keys you want to use for "%s".
ja: "％s"に使用するキーの組み合わせを押します。
ru: Нажмите комбинацию клавиш, которые вы хотите использовать для «% s».
zh_cn: 按下想要用于“％s”的按键组合。

source: _Expand All
ja: _すべて展開
ru: _Расширить все
zh_cn: _展开全部

source: _Collapse All
ja: _すべてを折りたたむ
ru: _Свернуть все
zh_cn: _全部收缩

source: Action
ja: アクション
ru: действие
zh_cn: 行动

source: Shortcut
ja: ショートカット
ru: кратчайший путь
zh_cn: 捷径

source: _Allow
ru: _Позволять
zh_cn: _允许

source: Override that keybinding?
ja: そのキーバインディングをオーバーライドしますか？
ru: Отменить эту привязку?
zh_cn: 重写该键绑定？

source: The combination '%s' is already used for "%s".
ja: 組み合わせ '％s'は既に "％s"に使用されています。
ru: Комбинация «% s» уже используется для «% s».
zh_cn: “％s”组合已被用于“％s”。

source: Enter tool paths below. Tools you do not need can be left blank.
ja: 以下のツールパスを入力してください。必要のないツールは空白のままにすることができます。
ru: Введите пути инструмента ниже. Инструменты, которые вам не нужны, могут быть пустыми.
zh_cn: 在下面输入刀具路径。您不需要的工具可以留空。

source: Set the information to be used in templates. See the documentation for details.
ja: テンプレートで使用する情報を設定します。詳細については、ドキュメントを参照してください。
ru: Задайте информацию, которая будет использоваться в шаблонах. Подробнее см. В документации.
zh_cn: 设置要在模板中使用的信息。详情请参阅文档。

source: Here you can change keyboard shortcuts for various actions. Select one and press the Change button to enter a new shortcut, or double click on an action to edit the string representation of the shortcut directly.
ja: ここで、さまざまな操作のキーボードショートカットを変更できます。 1つを選択し、変更ボタンを押して新しいショートカットを入力するか、アクションをダブルクリックしてショートカットの文字列表現を直接編集します。
ru: Здесь вы можете изменить сочетания клавиш для различных действий. Выберите один и нажмите кнопку «Изменить», чтобы ввести новый ярлык, или дважды щелкните действие, чтобы напрямую отредактировать строковое представление ярлыка.
zh_cn: 在这里您可以更改各种操作的键盘快捷键。选择一个，然后按“更改”按钮以输入新的快捷方式，或者双击某个操作直接编辑快捷方式的字符串表示形式。

source: <b>Page %d of %d</b>
ja: <b>ページ％d /％d </ b>
ru: <b> Страница% d из% d </ b>
zh_cn: <b>第％d页％d </ b>

source: Document Setup
ja: ドキュメント設定
ru: Настройка документа
zh_cn: 文档设置

source: Print only the basename(without the path) of the printed file
ja: 印刷ファイルの基本名（パスなし）のみを出力する
ru: Распечатайте только базовое имя (без пути) отпечатанного файла
zh_cn: 只打印打印文件的基本名称（不含路径）

source: Paginating
ja: 改ページ
ru: Разбиение
zh_cn: 分页

source: Page %d of %d
ja: ％d /％dのページ
ru: Страница% d из% d
zh_cn: ％d的页面％d

source: Did not send document %s to the printing subsystem.
ja: ％sドキュメントを印刷サブシステムに送信しませんでした。
ru: Не отправлял документ% s в подсистему печати.
zh_cn: 未将文档％s发送到打印子系统。

source: Document %s was sent to the printing subsystem.
ja: ドキュメント％sが印刷サブシステムに送信されました。
ru: Документ% s был отправлен в подсистему печати.
zh_cn: 文档％s已发送到打印子系统。

source: Printing of %s failed (%s).
ja: ％sの印刷に失敗しました（％s）。
ru: Печать% s не выполнена (% s).
zh_cn: ％s打印失败（％s）。

source: Please set a print command in the preferences dialog first.
ja: まず、設定ダイアログで印刷コマンドを設定してください。
ru: Сначала установите команду печати в диалоговом окне настроек.
zh_cn: 请首先在首选项对话框中设置打印命令。

source: The file "%s" will be printed with the following command: %s
ja: ファイル "％s"は次のコマンドで出力されます： ％s
ru: Файл «% s» будет напечатан следующей командой: % s
zh_cn: 文件“％s”将使用以下命令打印： ％S

source: Printing of "%s" failed (return code: %s).
ja: "％s"の印刷に失敗しました（リターンコード：％s）。
ru: Печать «% s» не выполнена (код возврата:% s).
zh_cn: 打印“％s”失败（返回码：％s）。

source: File %s printed.
ja: ファイル％sが印刷されました。
ru: Файл% s напечатан.
zh_cn: 打印文件％s。

source: projects
ja: プロジェクト
ru: проектов
zh_cn: 项目

source: New Project
ja: 新しいプロジェクト
ru: Новый проект
zh_cn: 新项目

source: C_reate
ru: Создайте
zh_cn: 创建

source: Choose Project Base Path
ja: プロジェクトベースパスを選択
ru: Выберите базовый путь проекта
zh_cn: 选择项目基础路径

source: Project file could not be written
ja: プロジェクトファイルを書き込めませんでした
ru: Файл проекта не может быть записан
zh_cn: 项目文件无法写入

source: Project "%s" created.
ja: プロジェクト "％s"が作成されました。
ru: Создан проект «% s».
zh_cn: 项目“％s”已创建。

source: Project file "%s" is already open
ja: プロジェクトファイル "％s"は既に開いています
ru: Файл проекта «% s» уже открыт
zh_cn: 项目文件“％s”已经打开

source: Open Project
ja: オープンプロジェクト
ru: Открытый проект
zh_cn: 打开项目

source: AGK Project files
ja: AGKプロジェクトファイル
ru: Файлы проекта AGK
zh_cn: AGK项目文件

source: Import Project
ja: プロジェクトのインポート
ru: Импорт проекта
zh_cn: 导入项目

source: Old AGK Projects
ja: 古いAGKプロジェクト
ru: Проекты старого AGK
zh_cn: 旧的AGK项目

source: You must choose an output location to save your HTML5 files
ja: HTML5ファイルを保存するには出力先を選択する必要があります
ru: Вы должны выбрать местоположение вывода для сохранения файлов HTML5
zh_cn: 您必须选择一个输出位置来保存您的HTML5文件

source: Unrecognised choice for 'commands used' drop down box
ja: 'コマンド使用'ドロップダウンボックスの認識できない選択
ru: Непризнанный выбор для раскрывающегося списка команд
zh_cn: '使用的命令'下拉框中无法识别的选择

source: Failed to copy source folder
ja: ソースフォルダのコピーに失敗しました
ru: Не удалось скопировать исходную папку
zh_cn: 无法复制源文件夹

source: Failed to open HTML5 data file for writing
ja: 書き込み用にHTML5データファイルを開くことができませんでした
ru: Не удалось открыть файл данных HTML5 для записи
zh_cn: 无法打开HTML5数据文件进行写入

source: Failed to write HTML5 data file
ja: HTML5データファイルの書き込みに失敗しました
ru: Не удалось записать файл данных HTML5
zh_cn: 无法编写HTML5数据文件

source: Failed to read AGKPlayer.js file: %s
ja: AGKPlayer.jsファイルの読み込みに失敗しました：％s
ru: Не удалось прочитать файл AGKPlayer.js:% s
zh_cn: 无法读取AGKPlayer.js文件：％s

source: AGKPlayer.js is corrupt, it is missing the %%ADDITIONALFOLDERS%% variable
ja: AGKPlayer.jsが壊れています。%% ADDITIONALFOLDERS %%変数がありません
ru: AGKPlayer.js поврежден, отсутствует переменная %% ADDITIONALFOLDERS %%
zh_cn: AGKPlayer.js已损坏，它缺少%% ADDITIONALFOLDERS %%变量

source: AGKPlayer.js is corrupt, it is missing the %%LOADPACKAGE%% variable
ja: AGKPlayer.jsが壊れています。%% LOADPACKAGE %%変数がありません
ru: AGKPlayer.js поврежден, отсутствует переменная %% LOADPACKAGE %%
zh_cn: AGKPlayer.js已损坏，它缺少%% LOADPACKAGE %%变量

source: Failed to write AGKPlayer.js file: %s
ja: AGKPlayer.jsファイルの書き込みに失敗しました：％s
ru: Не удалось записать файл AGKPlayer.js:% s
zh_cn: 无法写入AGKPlayer.js文件：％s

source: Export HTML5
ja: HTML5をエクスポートする
ru: Экспорт HTML5
zh_cn: 导出HTML5

source: You must choose an output location to save your APK
ja: 出力場所を選択してAPKを保存する必要があります
ru: Вы должны выбрать местоположение вывода, чтобы сохранить APK
zh_cn: 您必须选择一个输出位置来保存您的APK

source: The output location must be a file not a directory
ja: 出力先はディレクトリではなくファイルでなければなりません
ru: Место вывода должно быть файлом, а не каталогом
zh_cn: 输出位置必须是文件而不是目录

source: You must enter an app name
ja: アプリ名を入力する必要があります
ru: Введите имя приложения
zh_cn: 您必须输入应用程序名称

source: App name must be less than 30 characters
ja: アプリ名は30文字未満でなければなりません
ru: Имя приложения должно быть меньше 30 символов
zh_cn: 应用名称必须少于30个字符

source: App name contains invalid characters, it must not contain quotes or < > characters.
ja: アプリ名に無効な文字が含まれています。引用符や<>文字は使用できません。
ru: Имя приложения содержит недопустимые символы, оно не должно содержать кавычек или <> символов.
zh_cn: 应用程序名称包含无效字符，不得包含引号或<>字符。

source: You must enter a package name
ja: パッケージ名を入力する必要があります
ru: Необходимо ввести имя пакета
zh_cn: 您必须输入包名称

source: Package name must be less than 100 characters
ja: パッケージ名は100文字未満でなければなりません
ru: Имя пакета должно быть менее 100 символов.
zh_cn: 包名称必须少于100个字符

source: Package name must contain at least one dot character
ja: パッケージ名には少なくとも1つのドット文字を含める必要があります
ru: Имя пакета должно содержать хотя бы один символ точки
zh_cn: 包名称必须至少包含一个点字符

source: Package name must not begin or end with a dot
ja: パッケージ名はドットで始まらないでください。
ru: Имя пакета не должно начинаться или заканчиваться точкой
zh_cn: 包名称不得以点开始或结束

source: Package name invalid, a dot must be followed by a letter
ja: パッケージ名が無効です。ドットには文字が続く必要があります
ru: Недопустимое имя пакета, точка должна сопровождаться буквой
zh_cn: 包名无效，一个点后面必须跟一个字母

source: Package name contains invalid characters, must be A-Z 0-9 . and undersore only
ja: パッケージ名に無効な文字が含まれており、A-Z 0-9である必要があります。下位のみ
ru: Имя пакета содержит недопустимые символы, должно быть A-Z 0-9. и только снизу
zh_cn: 包名称包含无效字符，必须是A-Z 0-9。只有下层

source: App icon must be a PNG file
ja: アプリアイコンはPNGファイルである必要があります
ru: Значок приложения должен быть PNG-файлом
zh_cn: 应用图标必须是PNG文件

source: Could not find app icon location
ja: アプリアイコンの場所を見つけることができませんでした
ru: Не удалось найти местоположение значка приложения
zh_cn: 找不到应用图标位置

source: Notification icon must be a PNG file
ja: 通知アイコンはPNGファイルである必要があります
ru: Значок уведомлений должен быть PNG-файлом
zh_cn: 通知图标必须是PNG文件

source: Could not find notification icon location
ja: 通知アイコンの場所を見つけることができませんでした
ru: Не удалось найти местоположение значка уведомлений
zh_cn: 找不到通知图标的位置

source: You must select an Ouya large icon
ja: Ouya大きなアイコンを選択する必要があります
ru: Вы должны выбрать большой значок Ouya
zh_cn: 你必须选择一个欧亚大图标

source: Ouya large icon must be a PNG file
ja: Ouya大きなアイコンはPNGファイルでなければなりません
ru: Большой значок Ouya должен быть PNG-файлом
zh_cn: 欧亚大图标必须是PNG文件

source: Could not find ouya large icon location
ja: ouya大きなアイコンの場所を見つけることができませんでした
ru: Не удалось найти большое расположение значка ouya
zh_cn: 无法找到ouya大图标的位置

source: Google services config file must be a .json file
ja: Googleサービス設定ファイルは.jsonファイルでなければなりません
ru: Файл конфигурации служб Google должен быть .json-файлом
zh_cn: Google服务配置文件必须是.json文件

source: Could not find Google services config file
ja: Googleサービスの設定ファイルが見つかりませんでした
ru: Не удалось найти файл конфигурации служб Google
zh_cn: 找不到Google服务配置文件

source: Version name contains invalid characters, must be 0-9 and . only
ja: バージョン名に無効な文字が含まれています。のみ
ru: Имя версии содержит недопустимые символы, должно быть 0-9 и. только
zh_cn: 版本名称包含无效字符，必须为0-9和。只要

source: Could not find keystore file location
ja: キーストアファイルの場所を見つけることができませんでした
ru: Не удалось найти местоположение файла хранилища ключей
zh_cn: 找不到密钥库文件位置

source: Keystore password cannot contain double quotes
ja: キーストアのパスワードには二重引用符を使用できません
ru: Пароль ключа не может содержать двойные кавычки
zh_cn: 密钥库密码不能包含双引号

source: Alias password cannot contain double quotes
ja: 別名のパスワードには二重引用符を使用できません
ru: Пароль псевдонима не может содержать двойные кавычки
zh_cn: 别名密码不能包含双引号

source: You must enter your keystore password when using your own keystore
ja: 独自のキーストアを使用する場合は、キーストアのパスワードを入力する必要があります
ru: Вы должны ввести свой пароль хранилища ключей при использовании своего собственного хранилища ключей
zh_cn: 使用自己的密钥库时，您必须输入密钥库密码

source: You must enter your alias password when using a custom alias
ja: カスタムエイリアスを使用する場合は、エイリアスパスワードを入力する必要があります
ru: Вы должны ввести свой пароль псевдонима при использовании пользовательского псевдонима
zh_cn: 使用自定义别名时，您必须输入别名密码

source: Failed to read AndroidManifest.xml file
ja: AndroidManifest.xmlファイルの読み込みに失敗しました
ru: Не удалось прочитать файл AndroidManifest.xml
zh_cn: 无法读取AndroidManifest.xml文件

source: Failed to write AndroidManifest.xml file: %s
ja: AndroidManifest.xmlファイルの書き込みに失敗しました：％s
ru: Не удалось написать файл AndroidManifest.xml:% s
zh_cn: 无法编写AndroidManifest.xml文件：％s

source: Failed to read resource values.xml file: %s
ja: リソースのvalues.xmlファイルを読み取れませんでした：％s
ru: Не удалось прочитать файл ресурсов .xml:% s
zh_cn: 无法读取资源values.xml文件：％s

source: Could not find app name entry in values.xml file
ja: values.xmlファイルにアプリケーション名のエントリが見つかりませんでした
ru: Не удалось найти запись имени приложения в файле values.xml
zh_cn: 无法在values.xml文件中找到应用程序名称条目

source: Could not find end of app name entry in values.xml file
ja: values.xmlファイルにアプリケーション名のエントリが見つかりませんでした
ru: Не удалось найти конец записи имени приложения в файле values.xml
zh_cn: 无法在values.xml文件中找到应用程序名称条目的结尾

source: Could not find games_app_id entry in values.xml file
ja: values.xmlファイルでgames_app_idエントリを見つけることができませんでした
ru: Не удалось найти запись games_app_id в файле values.xml
zh_cn: 无法在values.xml文件中找到games_app_id条目

source: Could not find end of games_app_id entry in values.xml file
ja: values.xmlファイルにgames_app_idエントリの終わりが見つかりませんでした
ru: Не удалось найти конец записи games_app_id в файле values.xml
zh_cn: 无法在values.xml文件中找到games_app_id条目的结尾

source: Failed to read firebase config file: %s
ja: firebase設定ファイルの読み込みに失敗しました：％s
ru: Не удалось прочитать конфигурационный файл firebase:% s
zh_cn: 无法读取Firebase配置文件：％s

source: Could not find project_number entry in Firebase config file
ja: Firebase設定ファイルでproject_numberエントリを見つけることができませんでした
ru: Не удалось найти запись project_number в файле конфигурации Firebase
zh_cn: 无法在Firebase配置文件中找到project_number条目

source: Could not find end of project_number entry in Firebase config file
ja: Firebase設定ファイルのproject_numberエントリの終わりを見つけることができませんでした
ru: Не удалось найти конец записи project_number в файле конфигурации Firebase
zh_cn: 无法在Firebase配置文件中找到project_number条目的结尾

source: Could not find gcm_defaultSenderId entry in values.xml file
ja: values.xmlファイルでgcm_defaultSenderIdエントリを見つけることができませんでした
ru: Не удалось найти запись gcm_defaultSenderId в файле values.xml
zh_cn: 在values.xml文件中找不到gcm_defaultSenderId项

source: Could not find end of gcm_defaultSenderId entry in values.xml file
ja: values.xmlファイルにgcm_defaultSenderIdエントリの終わりが見つかりませんでした
ru: Не удалось найти конец записи gcm_defaultSenderId в файле values.xml
zh_cn: 无法在values.xml文件中找到gcm_defaultSenderId项的结尾

source: Could not find firebase_url entry in Firebase config file
ja: Firebase設定ファイルでfirebase_urlエントリを見つけることができませんでした
ru: Не удалось найти запись firebase_url в файле конфигурации Firebase
zh_cn: 无法在Firebase配置文件中找到firebase_url条目

source: Could not find end of firebase_url entry in Firebase config file
ja: Firebase設定ファイルのfirebase_urlエントリの終わりを見つけることができませんでした
ru: Не удалось найти конец записи firebase_url в файле конфигурации Firebase
zh_cn: 无法在Firebase配置文件中找到firebase_url条目的结尾

source: Could not find firebase_database_url entry in values.xml file
ja: values.xmlファイルにfirebase_database_urlエントリが見つかりませんでした
ru: Не удалось найти запись firebase_database_url в файле values.xml
zh_cn: 在values.xml文件中找不到firebase_database_url条目

source: Could not find end of firebase_database_url entry in values.xml file
ja: values.xmlファイル内のfirebase_database_urlエントリの終わりを見つけることができませんでした。
ru: Не удалось найти конец записи firebase_database_url в файле values.xml
zh_cn: 无法在values.xml文件中找到firebase_database_url条目的结尾

source: Could not find android package_name "%s" in the Firebase config file
ja: Firebase設定ファイルでアンドロイドパッケージ名 "％s"を見つけることができませんでした
ru: Не удалось найти файл android package_name «% s» в файле конфигурации Firebase
zh_cn: 在Firebase配置文件中找不到android package_name“％s”

source: Could not find matching mobilesdk_app_id entry in Firebase config file
ja: Firebase設定ファイルに一致するmobilesdk_app_idエントリが見つかりませんでした
ru: Не удалось найти соответствующую запись mobilesdk_app_id в файле конфигурации Firebase
zh_cn: 在Firebase配置文件中找不到匹配的mobilesdk_app_id条目

source: Could not find end of mobilesdk_app_id entry in Firebase config file
ja: Firebase設定ファイルにmobilesdk_app_idエントリの終わりが見つかりませんでした
ru: Не удалось найти конец записи mobilesdk_app_id в файле конфигурации Firebase
zh_cn: 无法在Firebase配置文件中找到mobilesdk_app_id条目的结尾

source: Could not find google_app_id entry in values.xml file
ja: values.xmlファイルにgoogle_app_idエントリが見つかりませんでした
ru: Не удалось найти запись google_app_id в файле values.xml
zh_cn: 无法在values.xml文件中找到google_app_id条目

source: Could not find end of google_app_id entry in values.xml file
ja: values.xmlファイルにgoogle_app_idエントリの終わりが見つかりませんでした
ru: Не удалось найти конец записи google_app_id в файле values.xml
zh_cn: 无法在values.xml文件中找到google_app_id条目的结尾

source: Could not find current_key entry in Firebase config file
ja: Firebase設定ファイルでcurrent_keyエントリを見つけることができませんでした
ru: Не удалось найти текущую запись в файле конфигурации Firebase
zh_cn: 在Firebase配置文件中找不到current_key条目

source: Could not find end of current_key entry in Firebase config file
ja: Firebase設定ファイルでcurrent_keyエントリの終わりを見つけることができませんでした
ru: Не удалось найти конец текущей записи в файле конфигурации Firebase
zh_cn: 无法在Firebase配置文件中找到current_key条目的结尾

source: Could not find google_api_key entry in values.xml file
ja: values.xmlファイルにgoogle_api_keyエントリが見つかりませんでした
ru: Не удалось найти запись google_api_key в файле values.xml
zh_cn: 无法在values.xml文件中找到google_api_key条目

source: Could not find end of google_api_key entry in values.xml file
ja: values.xmlファイルにgoogle_api_keyエントリの終わりが見つかりませんでした
ru: Не удалось найти конец записи google_api_key в файле values.xml
zh_cn: 无法在values.xml文件中找到google_api_key条目的结尾

source: Could not find google_crash_reporting_api_key entry in values.xml file
ja: values.xmlファイルにgoogle_crash_reporting_api_keyエントリが見つかりませんでした
ru: Не удалось найти запись google_crash_reporting_api_key в файле values.xml
zh_cn: 无法在values.xml文件中找到google_crash_reporting_api_key条目

source: Could not find end of google_crash_reporting_api_key entry in values.xml file
ja: values.xmlファイルにgoogle_crash_reporting_api_keyエントリの終わりが見つかりませんでした
ru: Не удалось найти конец записи google_crash_reporting_api_key в файле values.xml
zh_cn: 无法在values.xml文件中找到google_crash_reporting_api_key条目的结尾

source: Failed to write resource values.xml file: %s
ja: リソースのvalues.xmlファイルを書き込めませんでした：％s
ru: Не удалось записать файл ресурсов. Xml-файл:% s
zh_cn: 无法编写资源values.xml文件：％s

source: Failed to export project, AAPT2 program not found
ja: プロジェクトのエクスポートに失敗しました.AAPT2プログラムが見つかりませんでした
ru: Не удалось экспортировать проект, программа AAPT2 не найдена
zh_cn: 未能导出项目，找不到AAPT2程序

source: Failed to start packaging tool
ja: パッケージングツールの開始に失敗しました
ru: Не удалось запустить инструмент упаковки
zh_cn: 无法启动打包工具

source: Failed to load image icon: %s
ja: イメージアイコンの読み込みに失敗しました：％s
ru: Не удалось загрузить значок изображения:% s
zh_cn: 无法加载图片图标：％s

source: Failed to save xxxhdpi icon: %s
ja: xxxhdpiアイコンを保存できませんでした：％s
ru: Не удалось сохранить значок xxxhdpi:% s
zh_cn: 无法保存xxxhdpi图标：％s

source: Failed to save xxhdpi icon: %s
ja: xxhdpiアイコンを保存できませんでした：％s
ru: Не удалось сохранить значок xxhdpi:% s
zh_cn: 无法保存xxhdpi图标：％s

source: Failed to save xhdpi icon: %s
ja: xhdpiアイコンを保存できませんでした：％s
ru: Не удалось сохранить значок xhdpi:% s
zh_cn: 无法保存xhdpi图标：％s

source: Failed to save hdpi icon: %s
ja: hdpiアイコンの保存に失敗しました：％s
ru: Не удалось сохранить значок hdpi:% s
zh_cn: 无法保存hdpi图标：％s

source: Failed to save mdpi icon: %s
ja: mdpiアイコンの保存に失敗しました：％s
ru: Не удалось сохранить значок mdpi:% s
zh_cn: 无法保存mdpi图标：％s

source: Failed to save ldpi icon: %s
ja: ldpiアイコンの保存に失敗しました：％s
ru: Не удалось сохранить значок ldpi:% s
zh_cn: 无法保存ldpi图标：％s

source: Failed to load notification icon: %s
ja: 通知アイコンを読み込めませんでした：％s
ru: Не удалось загрузить значок уведомления:% s
zh_cn: 无法加载通知图标：％s

source: Failed to load Ouya large icon: %s
ja: Ouya大きなアイコンを読み込めませんでした：％s
ru: Не удалось загрузить большой значок Ouya:% s
zh_cn: 无法加载欧亚大图标：％s

source: Ouya large icon must be 732x412 pixels
ja: Ouya大きなアイコンは732x412ピクセルでなければなりません
ru: Ouya большой значок должен быть 732x412 пикселей
zh_cn: 欧亚大图标必须是732x412像素

source: Failed to save lean back icon: %s
ja: 無駄なバックアイコンを保存できませんでした：％s
ru: Не удалось сохранить значок с откидной назад:% s
zh_cn: 无法保存靠背图标：％s

source: Failed to write output files, check that your project directory is not in a write protected location
ja: 出力ファイルの書き込みに失敗し、プロジェクトディレクトリが書き込み禁止の場所にないことを確認してください
ru: Не удалось записать выходные файлы, убедитесь, что каталог проекта не находится в защищенном от записи месте
zh_cn: 无法写入输出文件，请检查您的项目目录是否不在写保护位置

source: Failed to initialise zip file for reading
ja: 読み取りのためにzipファイルを初期化できませんでした
ru: Не удалось инициализировать zip-файл для чтения
zh_cn: 无法初始化读取zip文件

source: Failed to open zip file for writing
ja: 書き込みのためにzipファイルを開けませんでした
ru: Не удалось открыть почтовый файл для записи
zh_cn: 无法打开用于写入的zip文件

source: Failed to add media files to APK
ja: メディアファイルをAPKに追加できませんでした
ru: Не удалось добавить файлы мультимедиа в APK
zh_cn: 无法将媒体文件添加到APK

source: Failed to add finalize zip file
ja: ファイナライズZIPファイルの追加に失敗しました
ru: Не удалось добавить финализацию zip-файла
zh_cn: 无法添加完成zip文件

source: Failed to end zip file
ja: ZIPファイルを終了できませんでした
ru: Не удалось завершить zip-файл
zh_cn: 无法结束zip文件

source: Failed to run signing tool: %s
ja: 署名ツールの実行に失敗しました：％s
ru: Не удалось запустить инструмент подписи:% s
zh_cn: 无法运行签名工具：％s

source: Failed to sign APK, is your keystore password and alias correct? (error: %s)
ja: APKに署名できませんでしたが、キーストアのパスワードとエイリアスは正しいですか？ （エラー：％s）
ru: Не удалось подписать APK, правильно ли пароль вашего пароля и псевдоним? (ошибка:% s)
zh_cn: 无法签名APK，您的密钥库密码和别名是否正确？ （错误：％s）

source: Failed to run zipalign tool: %s
ja: zipalignツールの実行に失敗しました：％s
ru: Не удалось запустить zipalign tool:% s
zh_cn: 无法运行zipalign工具：％s

source: Zip align tool returned error: %s
ja: ZIP整列ツールがエラーを返しました：％s
ru: Инструмент выравнивания Zip возвратил ошибку:% s
zh_cn: 邮编对齐工具返回错误：％s
