Repository: Dark-Basic-Software-Limited/AGKClassic
Catalog: AGK/IDE/Geany-1.24.1/po/*.po
Languages: ja, ru, zh_cn

source: R_ename
ja: R_名
zh_cn: 改名

source: Save the file and rename it
ja: ファイルを保存して名前を変更します
ru: Сохраните файл и переименуйте его
zh_cn: 保存该文件并重命名它

source: Error
ja: エラー
ru: ошибка
zh_cn: 错误

source: Question
ja: 質問
ru: Вопрос
zh_cn: 题

source: Warning
ja: 警告
ru: Предупреждение
zh_cn: 警告

source: Information
ja: 情報
ru: Информация
zh_cn: 信息

source: _Don't save
ja: _保存しない
ru: _Не сохраняйте
zh_cn: _不要保存

source: The file '%s' is not saved.
ja: ファイル '％s'は保存されません。
ru: Файл «% s» не сохраняется.
zh_cn: 文件'％s'未保存。

source: Do you want to save it before closing?
ja: 閉じる前に保存しますか？
ru: Вы хотите сохранить его перед закрытием?
zh_cn: 你想在关闭之前保存它吗？

source: Choose font
ja: フォントを選択
ru: Выберите шрифт
zh_cn: 选择字体

source: An error occurred or file information could not be retrieved (e.g. from a new file).
ja: エラーが発生したか、ファイル情報を取得できませんでした（たとえば、新しいファイルから）。
ru: Произошла ошибка или не удалось получить информацию о файле (например, из нового файла).
zh_cn: 发生错误或无法检索文件信息（例如，来自新文件）。

source: unknown
ja: 未知の
ru: неизвестный
zh_cn: 未知

source: %s Properties
ja: ％sプロパティ
ru: % s Свойства
zh_cn: ％s属性

source: (with BOM)
ja: （BOM付き）
ru: (с BOM)
zh_cn: （含BOM）

source: (without BOM)
ja: （BOMなし）
ru: (без спецификации)
zh_cn: （不含BOM）

source: File %s closed.
ja: ファイル％sは閉じました。
ru: Файл% s закрыт.
zh_cn: 文件％s已关闭。

source: Do you want to add the new file to the current project '%s'? (This will require you to save the new document somewhere)
ja: 新しいファイルを現在のプロジェクト '％s'に追加しますか？ （これにより、新しい文書をどこかに保存する必要があります）
ru: Вы хотите добавить новый файл в текущий проект «% s»? (Это потребует, чтобы вы где-то сохранили новый документ)
zh_cn: 你想将新文件添加到当前项目'％s'吗？ （这将要求您将新文档保存在某处）

source: New file "%s" opened.
ja: 新しいファイル "％s"が開かれました。
ru: Открывается новый файл «% s».
zh_cn: 新文件“％s”打开。

source: Project file "%s" could not be loaded.
ja: プロジェクトファイル "％s"を読み込めませんでした。
ru: Файл проекта «% s» не может быть загружен.
zh_cn: 项目文件“％s”无法加载。

source: Could not open file %s (%s)
ja: ファイル％sを開けませんでした（％s）
ru: Не удалось открыть файл% s (% s)
zh_cn: 无法打开文件％s（％s）

source: The file "%s" is not valid %s.
ja: ファイル "％s"は無効な％sです。
ru: Файл% s недействителен% s.
zh_cn: 文件“％s”无效％s。

source: The file "%s" does not look like a text file or the file encoding is not supported.
ja: ファイル "％s"はテキストファイルのように見えないか、ファイルエンコーディングがサポートされていません。
ru: Файл «% s» не похож на текстовый файл или кодировка файла не поддерживается.
zh_cn: 文件“％s”看起来不像文本文件，或者不支持文件编码。

source: The file "%s" could not be opened properly and has been truncated. This can occur if the file contains a NULL byte. Be aware that saving it can cause data loss. The file was set to read-only.
ja: ファイル "％s"を正しく開くことができず、切り捨てられました。これは、ファイルにNULLバイトが含まれている場合に発生します。保存するとデータが失われる可能性があることに注意してください。 ファイルは読み取り専用に設定されています。
ru: Файл «% s» не может быть правильно открыт и усечен. Это может произойти, если файл содержит NULL-байт. Имейте в виду, что сохранение может привести к потере данных. Файл был настроен только на чтение.
zh_cn: 文件“％s”无法正确打开并被截断。如果文件包含NULL字节，则会发生这种情况。请注意，保存它可能会导致数据丢失。 该文件被设置为只读。

source: File %s reloaded.
ja: ファイル％sがリロードされました。
ru: Файл% s перезагружен.
zh_cn: 文件％s重新加载。

source: File %s opened(%d%s).
ja: ファイル％sが開かれました（％d％s）。
ru: Файл% s открыт (% d% s).
zh_cn: 文件％s已打开（％d％s）。

source: , read-only
ja: 、読み取り専用
ru: , только для чтения
zh_cn: ， 只读

source: Error renaming file.
ja: ファイルの名前を変更中にエラーが発生しました。
ru: Ошибка переименования файла.
zh_cn: 重命名文件时出错。

source: An error occurred while converting the file from UTF-8 in "%s". The file remains unsaved.
ja: ファイルを "％s"のUTF-8から変換中にエラーが発生しました。ファイルは保存されません。
ru: Произошла ошибка при преобразовании файла из UTF-8 в «% s». Файл остается несохраненным.
zh_cn: 将文件从UTF-8转换为“％s”时发生错误。该文件仍未保存。

source: Error message: %s The error occurred at "%s" (line: %d, column: %d).
ja: エラーメッセージ：％s "％s"（行：％d、列：％d）でエラーが発生しました。
ru: Сообщения об ошибках Ошибка произошла при «% s» (строка:% d, столбец:% d).
zh_cn: 错误消息：％s 错误发生在“％s”（行：％d，列：％d）。

source: Error message: %s.
ja: エラーメッセージ：％s。
ru: Сообщения об ошибках.
zh_cn: 错误消息：％s。

source: Failed to open file '%s' for writing: fopen() failed: %s
ja: 書き込みのためにファイル '％s'を開けませんでした：fopen（）に失敗しました：％s
ru: Не удалось открыть файл «% s» для записи: fopen () не удалось:% s
zh_cn: 无法打开文件'％s'写入：fopen（）失败：％s

source: Failed to write file '%s': fwrite() failed: %s
ja: ファイル '％s'の書き込みに失敗しました：fwrite（）が失敗しました：％s
ru: Не удалось записать файл «% s»: сбой fwrite ():% s
zh_cn: 无法写入文件'％s'：fwrite（）失败：％s

source: Failed to close file '%s': fclose() failed: %s
ja: ファイル '％s'のクローズに失敗しました：fclose（）failed：％s
ru: Не удалось закрыть файл «% s»: fclose () не удалось:% s
zh_cn: 无法关闭文件'％s'：fclose（）失败：％s

source: Error saving file (%s).
ja: ファイル（％s）の保存中にエラーが発生しました。
ru: Ошибка сохранения файла (% s).
zh_cn: 保存文件（％s）时出错。

source: %s The file on disk may now be truncated!
ja: ％s ディスク上のファイルが切り捨てられることがあります。
ru: % s Файл на диске теперь может быть усечен!
zh_cn: ％S 磁盘上的文件现在可能被截断！

source: Error saving file.
ja: ファイルの保存中にエラー
ru: Ошибка сохранения файла.
zh_cn: 保存文件时出错。

source: File %s saved.
ja: ファイル％sが保存されました。
ru: Файл% s сохранен.
zh_cn: 文件％s已保存。

source: "%s" was not found.
ja: "％s"が見つかりませんでした。
ru: «% s» не найден.
zh_cn: 未找到“％s”。

source: Wrap search and find again?
ja: 検索をラップしてもう一度検索しますか？
ru: Оберните поиск и найдите еще раз?
zh_cn: 换行搜索并再次查找？

source: No matches found for "%s".
ja: "％s"に一致するものは見つかりませんでした。
ru: Не найдено совпадений для «% s».
zh_cn: 找不到“％s”的匹配项。

source: %s: replaced %d occurrence of "%s" with "%s".
ja: ％s： "％s"を "％s"で置き換えました。
ru: % s: заменил% d нахождение «% s» на «% s».
zh_cn: ％s：将“％s”的％d次出现替换为“％s”。

source: Do you want to reload it?
ja: それをリロードしますか？
ru: Вы хотите перезагрузить его?
zh_cn: 你想重新加载它吗？

source: The file '%s' on the disk is more recent than the current buffer.
ja: ディスク上のファイル '％s'は、 現在のバッファ
ru: Файл «% s» на диске более поздний, чем текущий буфер.
zh_cn: 磁盘上的文件'％s'比新近更新 当前的缓冲区。

source: Close _without saving
ja: 閉じる_保存なし
ru: Закрыть _without save
zh_cn: 关闭_无需保存

source: Try to resave the file?
ja: ファイルを再保存してみますか？
ru: Попробуйте сохранить файл?
zh_cn: 尝试重新保存文件？

source: File "%s" was not found on disk!
ja: ファイル "％s"がディスク上に見つかりませんでした！
ru: Файл «% s» не найден на диске!
zh_cn: 文件“％s”在磁盘上找不到！

source: %s: Something is wrong with the time stamps.
ja: ％s：タイムスタンプに何か問題があります。
ru: % s: Что-то не так с отметками времени.
zh_cn: ％s：时间戳有问题。

source: Can not parse accelerator "%s" from user snippets.conf
ja: ユーザーsnippets.confからアクセラレータ "％s"を解析できません
ru: Невозможно разобрать ускоритель «% s» от пользователя snippets.conf
zh_cn: 无法从用户snippets.conf解析加速器“％s”

source: Enter Tab Width
ja: タブ幅を入力
ru: Введите ширину вклада
zh_cn: 输入标签宽度

source: Enter the amount of spaces which should be replaced by a tab character.
ja: タブ文字で置き換えられるスペースの量を入力します。
ru: Введите количество пробелов, которое должно быть заменено символом табуляции.
zh_cn: 输入应由制表符替换的空格数量。

source: failed to load icon '%s': %s
ja: アイコン '％s'の読み込みに失敗しました：％s
ru: не удалось загрузить значок «% s»:% s
zh_cn: 未能加载图标'％s'：％s

source: incompatible image data for icon '%s'
ja: アイコン '％s'の互換性のない画像データ
ru: несовместимые данные изображения для значка «% s»
zh_cn: 图标'％s'不兼容的图像数据

source: Celtic
ja: ケルト語
ru: кельтская
zh_cn: 塞尔特

source: Greek
ja: ギリシャ語
ru: греческий
zh_cn: 希腊语

source: Nordic
ja: ノルディック
ru: нордический
zh_cn: 北欧

source: South European
ja: 南ヨーロッパ
ru: Юго-европейский
zh_cn: 南欧

source: Western
ja: 西洋
ru: вестерн
zh_cn: 西

source: Baltic
ja: バルト
ru: балтийский
zh_cn: 波罗的海的

source: Central European
ja: 中央ヨーロッパ
ru: Центральная Европа
zh_cn: 中欧

source: Cyrillic
ja: キリル
ru: кириллица
zh_cn: 西里尔

source: Cyrillic/Russian
ja: キリル文字/ロシア語
ru: Кириллица / русский
zh_cn: 西里尔字母/俄文

source: Cyrillic/Ukrainian
ja: キリル文字/ウクライナ語
ru: Кириллица / Украинский
zh_cn: 西里尔文/乌克兰

source: Romanian
ja: ルーマニア語
ru: румынский
zh_cn: 罗马尼亚

source: Arabic
ja: アラビア語
ru: арабский
zh_cn: 阿拉伯

source: Hebrew
ja: ヘブライ語
ru: иврит
zh_cn: 希伯来语

source: Hebrew Visual
ja: ヘブライ語ビジュアル
ru: Иврит Визуальный
zh_cn: 希伯来语视觉

source: Armenian
ja: アルメニア人
ru: армянин
zh_cn: 亚美尼亚

source: Georgian
ja: ジョージア語
ru: грузинский
zh_cn: 格鲁吉亚

source: Thai
ja: タイ語
ru: тайский
zh_cn: 泰国

source: Turkish
ja: トルコ語
ru: турецкий
zh_cn: 土耳其

source: Vietnamese
ja: ベトナム語
ru: вьетнамский
zh_cn: 越南

source: Chinese Simplified
ja: 中国語（簡体字
ru: Китайский упрощенный
zh_cn: 简体中文

source: Chinese Traditional
ja: 中国の伝統的な
ru: Китайский традиционный
zh_cn: 中国传统的

source: Japanese
ja: 日本語
ru: Японский
zh_cn: 日本

source: Korean
ja: 韓国語
ru: Корейский
zh_cn: 朝鲜的

source: Without encoding
ja: エンコーディングなし
ru: Без кодирования
zh_cn: 没有编码

source: _West European
ja: _Westヨーロッパ
ru: _Все европейский
zh_cn: _西欧

source: _East European
ja: _ヨーロッパ
ru: _Есть европейский
zh_cn: _东欧

source: East _Asian
ja: 東アジア
ru: Восточная Азия
zh_cn: 东亚_亚洲

source: _SE & SW Asian
ja: _SE＆SWアジア
zh_cn: _SE＆SW亚洲

source: _Middle Eastern
ru: _Ближневосточный
zh_cn: _中东

source: %s source file
ja: ％sソースファイル
ru: Исходный файл% s
zh_cn: ％s源文件

source: %s file
ja: ％sファイル
ru: Файл% s
zh_cn: ％s文件

source: %s script
ja: ％sスクリプト
ru: Скрипт% s
zh_cn: ％s脚本

source: %s document
ja: ドキュメント％s
ru: Документ% s
zh_cn: ％s文件

source: Config
ja: 設定
ru: конфиг
zh_cn: 配置

source: All Source
ja: すべてのソース
ru: Все источники
zh_cn: 所有来源

source: All files
ja: すべてのファイル
ru: Все файлы
zh_cn: 全部文件

source: Bad regex for filetype %s: %s
ja: ファイルタイプ％sの正規表現が正しくありません：％s
ru: Плохое регулярное выражение для типа файла% s:% s
zh_cn: 文件类型％s的错误正则表达式：％s

source: untitled
ja: 無題
ru: без названия
zh_cn: 无标题

source: Could not find file '%s'.
ja: ファイル '％s'を見つけることができませんでした。
ru: Не удалось найти файл «% s».
zh_cn: 找不到文件'％s'。

source: Default
ja: デフォルト
ru: По умолчанию
zh_cn: 默认

source: The current filetype overrides the default style.
ja: 現在のファイルタイプはデフォルトのスタイルを上書きします。
ru: Текущий тип файла отменяет стиль по умолчанию.
zh_cn: 当前文件类型覆盖默认样式。

source: This may cause color schemes to display incorrectly.
ja: これにより、カラースキームが正しく表示されないことがあります。
ru: Это может привести к неправильной отображению цветовых схем.
zh_cn: 这可能会导致配色方案显示不正确。

source: Color Schemes
ja: 配色
ru: Цветовые схемы
zh_cn: 配色方案

source: File
ja: ファイル
ru: файл
zh_cn: 文件

source: Clipboard
ja: クリップボード
ru: буфер обмена
zh_cn: 剪贴板

source: Select
ja: 選択
ru: Выбрать
zh_cn: 选择

source: Format
ja: フォーマット
ru: Формат
zh_cn: 格式

source: Insert
ja: インサート
ru: Вставить
zh_cn: 插

source: Settings
ja: 設定
ru: настройки
zh_cn: 设置

source: Search
ja: サーチ
ru: Поиск
zh_cn: 搜索

source: Go to
ja: に行く
ru: Идти к
zh_cn: 去

source: View
ja: ビュー
ru: Посмотреть
zh_cn: 视图

source: Document
ja: 資料
ru: Документ
zh_cn: 文件

source: Help
ja: 助けて
ru: Помогите
zh_cn: 帮帮我

source: Focus
ja: フォーカス
ru: фокус
zh_cn: 焦点

source: Notebook tab
ja: ノートブックタブ
ru: Вкладка Notebook
zh_cn: Notebook选项卡

source: New File
ja: 新しいファイル
ru: Новый файл
zh_cn: 新文件

source: Open
ja: 開いた
ru: открыто
zh_cn: 打开

source: Save
ja: セーブ
ru: Сохранить
zh_cn: 保存

source: Save as
ja: 名前を付けて保存
ru: Сохранить как
zh_cn: 另存为

source: Save all
ja: すべてを救う
ru: Сохранить все
zh_cn: 保存全部

source: Print
ja: 印刷
ru: Распечатать
zh_cn: 打印

source: Close
ja: 閉じる
ru: Закрыть
zh_cn: 关

source: Close all
ja: すべて閉じる
ru: Закрыть все
zh_cn: 关闭所有

source: Reload file
ja: リロードファイル
ru: Обновить файл
zh_cn: 重新加载文件

source: Re-open last closed tab
ja: 最後に閉じたタブを再度開く
ru: Повторно открыть последнюю закрытую вкладку
zh_cn: 重新打开最后关闭的选项卡

source: Quit
ja: 終了する
ru: Уволиться
zh_cn: 放弃

source: New
ja: 新しい
ru: новый
zh_cn: 新

source: Undo
ja: 元に戻す
ru: расстегивать
zh_cn: 解开

source: Redo
ja: やり直し
ru: переделывать
zh_cn: 重做

source: Delete to line end
ja: 行末まで削除
ru: Удалить до конца строки
zh_cn: 删除到行结束

source: _Transpose Current Line
ja: _現在の行を転送する
ru: _Трансляция текущей линии
zh_cn: _Transpose当前行

source: Scroll to current line
ja: 現在の行にスクロールする
ru: Прокрутите до текущей строки
zh_cn: 滚动到当前行

source: Scroll up the view by one line
ja: ビューを1行上にスクロールします。
ru: Прокрутка просмотра по одной строке
zh_cn: 将视图向上滚动一行

source: Scroll down the view by one line
ja: ビューを1行下にスクロールする
ru: Прокрутите вниз по одной строке
zh_cn: 向下滚动视图一行

source: Complete snippet
ja: 完全スニペット
ru: Полный фрагмент
zh_cn: 完整的片段

source: Move cursor in snippet
ja: スニペットでカーソルを移動する
ru: Перемещение курсора в фрагмент
zh_cn: 将光标移至片段中

source: Suppress snippet completion
ja: スニペットの完了を抑制する
ru: Подавление завершения фрагмента
zh_cn: 禁止片段完成

source: Context Action
ja: コンテキストアクション
ru: Контекстное действие
zh_cn: 上下文操作

source: Complete word
ja: 単語を完成させる
ru: Полное слово
zh_cn: 完整的单词

source: Show calltip
ja: コールティップを表示
ru: Показать подсказку
zh_cn: 显示calltip

source: Show macro list
ja: マクロリストを表示する
ru: Показать список макросов
zh_cn: 显示宏列表

source: Word part completion
ja: 単語部分の補完
ru: Завершение части слова
zh_cn: 字部分完成

source: Move line(s) up
ja: ラインを上に移動する
ru: Перемещение линий (линий) вверх
zh_cn: 向上移动线

source: Move line(s) down
ja: ラインを下に移動する
ru: Перемещение строк вниз
zh_cn: 向下移动线条

source: Cut
ja: カット
ru: Порез
zh_cn: 切

source: Copy
ja: コピー
ru: копия
zh_cn: 复制

source: Paste
ja: ペースト
ru: Вставить
zh_cn: 糊

source: Select All
ja: すべて選択
ru: Выбрать все
zh_cn: 全选

source: Select current word
ja: 現在の単語を選択
ru: Выберите текущее слово
zh_cn: 选择当前字词

source: Select to previous word part
ja: 前の単語部分に選択
ru: Выбрать предыдущую часть слова
zh_cn: 选择上一个单词部分

source: Select to next word part
ja: 次の単語部分に選択する
ru: Выберите следующую часть слова
zh_cn: 选择下一个单词部分

source: Toggle line commentation
ja: 行コメントの切り替え
ru: Комментировать
zh_cn: 切换行注释

source: Comment line(s)
ja: コメント行
ru: Строка комментариев
zh_cn: 评论专栏

source: Uncomment line(s)
ja: 行のコメントを解除する
zh_cn: 取消注释行

source: Increase indent
ja: インデントを増やします
ru: Увеличить отступ
zh_cn: 增加缩进

source: Decrease indent
ja: インデントを減らす
ru: Уменьшить отступ
zh_cn: 缩小缩进

source: Increase indent by one space
ja: インデントを1スペース増やす
ru: Увеличение отступа на один пробел
zh_cn: 将缩进增加一个空格

source: Decrease indent by one space
ja: インデントを1つ分減らす
ru: Уменьшить отступ на одно место
zh_cn: 将缩进缩小一个空格

source: Send to Custom Command 1
ja: カスタムコマンドに送信する1
ru: Отправить в пользовательскую команду 1
zh_cn: 发送到自定义命令1

source: Send to Custom Command 2
ja: カスタムコマンド2に送信
ru: Отправить в пользовательскую команду 2
zh_cn: 发送到自定义命令2

source: Send to Custom Command 3
ja: カスタムコマンドに送信3
ru: Отправить в пользовательскую команду 3
zh_cn: 发送到自定义命令3

source: Join lines
ja: 結合線
ru: Присоединительные линии
zh_cn: 加入线

source: Insert date
ja: 日付を挿入
ru: Вставить дату
zh_cn: 插入日期

source: Insert New Line Before Current
ja: 現在の前に改行を挿入する
ru: Вставить новую линию перед током
zh_cn: 在当前之前插入新行

source: Insert New Line After Current
ja: 現在の後に新しい行を挿入する
ru: Вставить новую строку после текущего
zh_cn: 在当前后插入新行

source: Find
ja: 検索
ru: найти
zh_cn: 找

source: Find Next
ja: 次を見つける
ru: Найти следующее
zh_cn: 找下一个

source: Find Previous
ja: 前の検索
ru: Найти Предыдущая
zh_cn: 查找上一个

source: Replace
ja: 置換
ru: замещать
zh_cn: 更换

source: Find in Files
ja: ファイルで検索
ru: Найти в файлах
zh_cn: 在文件中查找

source: Next Message
ja: 次のメッセージ
ru: Следующее сообщение
zh_cn: 下一条消息

source: Previous Message
ja: 前のメッセージ
ru: Предыдущее сообщение
zh_cn: 上一条消息

source: Find Usage
ja: 使用法を見つける
ru: Найти Usage
zh_cn: 查找用法

source: Find Document Usage
ja: ドキュメントの使用状況を確認する
ru: Поиск документов
zh_cn: 查找文档用法

source: Navigate back a location
ja: 場所をナビゲートする
ru: Переместить назад местоположение
zh_cn: 导航回一个位置

source: Navigate forward a location
ja: 場所を前方にナビゲートする
ru: Перемещение вперед по местоположению
zh_cn: 向前导航一个位置

source: Go to matching brace
ja: 一致するブレースに移動
ru: Перейти к соответствующей скобе
zh_cn: 去匹配大括号

source: Toggle marker
ja: マーカーを切り替える
ru: Переключить маркер
zh_cn: 切换标记

source: Go to Tag Definition
ja: タグ定義へ移動
ru: Перейти к определению метки
zh_cn: 转到标记定义

source: Go to Tag Declaration
ja: タグ宣言に行く
ru: Перейти к Декларации тегов
zh_cn: 转到标签声明

source: Go to Start of Line
ja: 行の先頭に移動
ru: Перейти к началу строки
zh_cn: 转到行首

source: Go to End of Line
ja: 行の終わりに行く
ru: Перейти к концу строки
zh_cn: 转到行尾

source: Go to Start of Display Line
ja: 表示行の開始に移動します。
ru: Перейти к началу строки отображения
zh_cn: 转到显示行的开始

source: Go to End of Display Line
ja: ディスプレイラインの終わりに行く
ru: Перейти к концу строки отображения
zh_cn: 转到显示行结束

source: Go to Previous Word Part
ja: 以前のWord部分に移動する
ru: Перейти к части предыдущего слова
zh_cn: 转到上一个单词部分

source: Go to Next Word Part
ja: 次のワードパーツに移動
ru: Перейти к части следующего слова
zh_cn: 转到下一个单词部分

source: Toggle All Additional Widgets
ja: すべての追加ウィジェットを切り替えます
ru: Переключить все дополнительные виджеты
zh_cn: 切换所有其他小部件

source: Fullscreen
ja: 全画面表示
ru: Полноэкранный
zh_cn: 全屏

source: Toggle Messages Window
ja: メッセージウィンドウの切り替え
ru: Окно «Переключить сообщения»
zh_cn: 切换消息窗口

source: Toggle Sidebar
ja: サイドバーの切り替え
ru: Переключить боковую панель
zh_cn: 切换边栏

source: Zoom In
ja: ズームイン
ru: Приблизить
zh_cn: 放大

source: Zoom Out
ja: ズームアウトする
ru: Уменьшить
zh_cn: 缩小

source: Zoom Reset
ja: ズームリセット
ru: Сброс зума
zh_cn: 缩放重置

source: Switch to Editor
ja: エディタに切り替え
ru: Переключить в Редактор
zh_cn: 切换到编辑器

source: Switch to Search Bar
ja: 検索バーに切り替える
ru: Переключиться на панель поиска
zh_cn: 切换到搜索栏

source: Switch to Message Window
ja: メッセージウィンドウに切り替える
ru: Перейти к окну сообщений
zh_cn: 切换到消息窗口

source: Switch to Compiler
ja: コンパイラに切り替え
ru: Переключиться на компилятор
zh_cn: 切换到编译器

source: Switch to Messages
ja: メッセージに切り替える
ru: Переключиться на сообщения
zh_cn: 切换到信息

source: Switch to Scribble
ja: 落書きに切り替える
ru: Переключить на Scribble
zh_cn: 切换到Scribble

source: Switch to VTE
ja: VTEに切り替えます
ru: Переключиться на VTE
zh_cn: 切换到VTE

source: Switch to Sidebar
ja: サイドバーに切り替える
ru: Переключиться на боковую панель
zh_cn: 切换到侧边栏

source: Switch to Sidebar Symbol List
ja: サイドバーのシンボルリストに切り替える
ru: Переключиться на список символов боковой панели
zh_cn: 切换到边栏符号列表

source: Switch to Sidebar Document List
ja: サイドバーのドキュメントリストに切り替える
ru: Переключиться на список документов боковой панели
zh_cn: 切换到补充工具栏文档列表

source: Switch to left document
ja: 左の文書に切り替える
ru: Переключиться на левый документ
zh_cn: 切换到左侧文档

source: Switch to right document
ja: 正しい文書に切り替える
ru: Переключиться на правый документ
zh_cn: 切换到正确的文件

source: Switch to last used document
ja: 前回使用したドキュメントに切り替える
ru: Переключиться на последний использованный документ
zh_cn: 切换到上次使用的文档

source: Move document left
ja: ドキュメントを左に移動する
ru: Переместить документ влево
zh_cn: 移动文件

source: Move document right
ja: ドキュメントを右に移動する
ru: Переместить документ вправо
zh_cn: 正确移动文档

source: Move document first
ja: ドキュメントを最初に移動する
ru: Перенесите документ первым
zh_cn: 先移动文件

source: Move document last
ja: 最後に文書を移動する
ru: Переместить документ последним
zh_cn: 最后移动文件

source: Toggle Line wrapping
ja: 折り返しの折り返し
ru: Переключить перенос строк
zh_cn: 切换线包装

source: Toggle Line breaking
ja: トグルラインを破る
ru: Переключение разрыва строки
zh_cn: 切换换行符

source: Replace tabs by space
ja: スペースでタブを置き換える
ru: Замена вкладок пробелом
zh_cn: 用空格替换标签

source: Replace spaces by tabs
ja: スペースをタブで置き換える
ru: Заменить пробелы вкладками
zh_cn: 用制表符替换空格

source: Toggle current fold
ja: 現在の折り畳みを切り替える
ru: Переключить текущую складку
zh_cn: 切换当前折叠

source: Fold all
ja: 全てを折りたたむ
ru: Сложить все
zh_cn: 全部折叠

source: Unfold all
ja: すべてを展開する
ru: Развернуть все
zh_cn: 展开全部

source: Reload symbol list
ja: シンボルリストをリロードする
ru: Обновить список символов
zh_cn: 重新加载符号列表

source: Remove Markers
ja: マーカーを削除する
ru: Удалить маркеры
zh_cn: 删除标记

source: Remove Error Indicators
ja: エラーインジケータを削除
ru: Удалить индикаторы ошибок
zh_cn: 删除错误指示器

source: Remove Markers and Error Indicators
ja: マーカーとエラーインジケータを削除する
ru: Удаление маркеров и индикаторов ошибок
zh_cn: 删除标记和错误指示

source: Compile
ja: コンパイル
ru: компилировать
zh_cn: 编

source: Run
ja: 走る
ru: Бег
zh_cn: 跑

source: Broadcast
ja: 放送
zh_cn: 广播

source: Build options
ja: ビルドオプション
ru: Варианты сборки
zh_cn: 构建选项

source: Pause/Continue
ja: 一時停止/継続
ru: Пауза / Продолжить
zh_cn: 暂停/继续

source: Step Over
ja: ステップオーバー
ru: Переступить
zh_cn: 一步到位

source: Step Out
ja: 踏みでる
ru: Выйти
zh_cn: 走出去

source: Show Color Chooser
ja: 色の選択を表示
ru: Показать выбор цвета
zh_cn: 显示颜色选择器

source: Keyboard Shortcuts
ja: キーボードショートカット
ru: Горячие клавиши
zh_cn: 键盘快捷键

source: The following keyboard shortcuts are configurable:
ja: 次のキーボードショートカットは設定可能です：
ru: Доступны следующие сочетания клавиш:
zh_cn: 以下键盘快捷键是可配置的：

source: Type here what you want, use it as a notice/scratch board
ja: あなたが望むものをここに入力し、通知/スクラッチボードとして使用してください
ru: Напечатайте здесь то, что вы хотите, используйте его как уведомление / царапины
zh_cn: 在此输入您想要的内容，将其用作通知/暂存板

source: Failed to load one or more session files.
ja: 1つ以上のセッションファイルの読み込みに失敗しました。
ru: Не удалось загрузить один или несколько файлов сеанса.
zh_cn: 无法加载一个或多个会话文件。

source: Debug Messages
ja: デバッグメッセージ
ru: Отладочные сообщения
zh_cn: 调试消息

source: Cl_ear
ru: Очистить
zh_cn: 明确

source: Set initial column number for the first opened file (useful in conjunction with --line)
ja: 最初に開いたファイルの最初の列番号を設定します（--lineと組み合わせて使用​​すると便利です）
ru: Установить начальный номер столбца для первого открытого файла (полезно в сочетании с -line)
zh_cn: 为第一个打开的文件设置初始列号（与-line一起使用）

source: Use an alternate configuration directory
ja: 別の構成ディレクトリを使用する
ru: Используйте альтернативный каталог конфигурации
zh_cn: 使用备用配置目录

source: Print internal filetype names
ja: 内部ファイルタイプ名を出力する
ru: Печать внутренних имен файлов
zh_cn: 打印内部文件类型名称

source: Generate global tags file (see documentation)
ja: グローバルタグファイルを生成する（ドキュメントを参照）
ru: Создание файла глобальных тегов (см. Документацию)
zh_cn: 生成全局标签文件（参见文档）

source: Don't preprocess C/C++ files when generating tags
ja: タグを生成するときにC / C ++ファイルを前処理しないでください。
ru: Не препроизводить файлы C / C ++ при создании тегов
zh_cn: 生成标签时不要预处理C / C ++文件

source: Don't open files in a running instance, force opening a new instance
ja: 実行中のインスタンス内のファイルを開かず、強制的に新しいインスタンスを開く
ru: Не открывайте файлы в запущенном экземпляре, чтобы открыть новый экземпляр
zh_cn: 不要在运行实例中打开文件，强制打开新实例

source: Use this socket filename for communication with a running Geany instance
ja: 実行中のGeanyインスタンスとの通信にこのソケットファイル名を使用する
ru: Используйте это имя файла сокета для связи с запущенным экземпляром Geany
zh_cn: 使用此套接字文件名与正在运行的Geany实例进行通信

source: Return a list of open documents in a running Geany instance
ja: 実行中のGeanyインスタンス内の開いているドキュメントのリストを返す
ru: Вернуть список открытых документов в запущенном экземпляре Geany
zh_cn: 返回正在运行的Geany实例中的打开文档列表

source: Set initial line number for the first opened file
ja: 最初に開いたファイルの初期行番号を設定する
ru: Установить начальный номер строки для первого открытого файла
zh_cn: 为第一个打开的文件设置起始行号

source: Don't show message window at startup
ja: 起動時にメッセージウィンドウを表示しない
ru: Не показывать окно сообщения при запуске
zh_cn: 启动时不显示消息窗口

source: Don't load auto completion data (see documentation)
ja: 自動補完データを読み込まない（ドキュメントを参照）
ru: Не загружать данные автозаполнения (см. Документацию)
zh_cn: 不要加载自动完成数据（请参阅文档）

source: Don't load plugins
ja: プラグインをロードしない
ru: Не загружать плагины
zh_cn: 不要加载插件

source: Print Geany's installation prefix
ja: Geanyのインストールプレフィックスを表示する
ru: Печать префикса установки Geany
zh_cn: 打印Geany的安装前缀

source: Open all FILES in read-only mode (see documention)
ja: すべてのファイルを読み取り専用モードで開く（ドキュメントを参照）
ru: Откройте все ФАЙЛЫ в режиме только для чтения (см. Документацию)
zh_cn: 以只读模式打开所有文件（参见文档）

source: Don't load the previous session's files
ja: 前のセッションのファイルを読み込まない
ru: Не загружать файлы предыдущего сеанса
zh_cn: 不要加载以前会话的文件

source: Don't load terminal support
ja: 端末サポートをロードしない
ru: Не загружать поддержку терминала
zh_cn: 不要加载终端支持

source: Filename of libvte.so
ja: libvte.soのファイル名
ru: Имя файла libvte.so
zh_cn: libvte.so的文件名

source: Be verbose
ja: 冗長にする
ru: Быть подробным
zh_cn: 详细

source: Show version and exit
ja: バージョンを表示して終了する
ru: Показать версию и выйти
zh_cn: 显示版本并退出

source: [FILES...]
ja: [ファイル...]
zh_cn: [文件...]

source: built on %s with
ja: ％sで構築
ru: построено на% s с
zh_cn: 建立在％s上

source: Move it now?
ja: 今すぐ移動しますか？
ru: Переместить его сейчас?
zh_cn: 现在移动它？
