Repository: Dark-Basic-Software-Limited/AGKClassic
Catalog: AGK/IDE/Geany-1.24.1/po/*.po
Languages: ja, ru, zh_cn

source: Use _escape sequences
ja: _エスケープシーケンスを使う
ru: Использовать последовательности _escape
zh_cn: 使用_escape序列

source: Replace \\, \t, \n, \r and \uXXXX (Unicode chararacters) with the corresponding control characters
ja: \\、\ t、\ n、\ rおよび\ uXXXX（Unicode文字）を対応する制御文字に置き換えます
ru: Замените \\, \ t, \ n, \ r и \ uXXXX (символы Unicode) с соответствующими управляющими символами
zh_cn: 将\\，\ t，\ n，\ r和\ uXXXX（Unicode字符）替换为相应的控制字符

source: C_ase sensitive
ja: 大文字と小文字を区別
ru: Деликатный случай
zh_cn: 区分大小写

source: Match only a _whole word
ja: 一致する単語のみを検索する
ru: Сопоставьте только одно слово
zh_cn: 只匹配一个_whole单词

source: Match from s_tart of word
ja: 単語のs_tartからの一致
ru: Матч из слова s_tart
zh_cn: 匹配从单词的s_tart

source: _Previous
ja: _前
zh_cn: _以前

source: _Next
ja: _次
ru: _Следующий
zh_cn: _下一个

source: _Search for:
ja: _検索する：
ru: _Искать:
zh_cn: _搜索：

source: _Find All
ja: _すべてを見つける
ru: _Найти все
zh_cn: _找到所有

source: _Mark
ja: _マーク
ru: _Отметка
zh_cn: _标记

source: Mark all matches in the current document
ja: 現在のドキュメントにすべての一致をマークする
ru: Отметьте все совпадения в текущем документе
zh_cn: 标记当前文档中的所有匹配项

source: In Sessi_on
ja: Sessi_onで
ru: В сессии
zh_cn: 在Sessi_on

source: _In Document
ja: _Inドキュメント
ru: _В документе
zh_cn: _In文件

source: Close _dialog
ja: _dialogを閉じる
ru: Закрыть _dialog
zh_cn: 关闭_dialog

source: Disable this option to keep the dialog open
ja: ダイアログを開いたままにするには、このオプションを無効にします
ru: Отключите эту опцию, чтобы открыть диалоговое окно
zh_cn: 禁用此选项可保持对话框打开

source: _Replace
ja: _置き換え
zh_cn: _更换

source: Replace & Fi_nd
ru: Заменить & Fi_nd
zh_cn: 替换＆Fi_nd

source: Replace wit_h:
ja: と置換する：
ru: Заменить:
zh_cn: 用。。。来代替：

source: Re_place All
ja: すべてのRe_place
ru: Заменить все
zh_cn: 全部替换

source: In Se_lection
ja: Se_選択で
ru: В Se_lection
zh_cn: 在Selection中

source: Replace all matches found in the currently selected text
ja: 現在選択されているテキストにあるすべての一致を置換する
ru: Заменить все совпадения, найденные в текущем выделенном тексте
zh_cn: 替换当前选定文本中找到的所有匹配项

source: all
ja: すべて
ru: все
zh_cn: 所有

source: project
ja: プロジェクト
ru: проект
zh_cn: 项目

source: custom
ja: カスタム
ru: обычай
zh_cn: 习惯

source: All: search all files in the directory Project: use file patterns defined in the project settings Custom: specify file patterns manually
ja: すべて：ディレクトリ内のすべてのファイルを検索する プロジェクト：プロジェクト設定で定義されたファイルパターンを使用する カスタム：ファイルパターンを手動で指定する
ru: Все: поиск всех файлов в каталоге Проект: использование шаблонов файлов, определенных в настройках проекта Пользовательский: укажите шаблоны файлов вручную
zh_cn: 全部：搜索目录中的所有文件 项目：使用项目设置中定义的文件模式 自定义：手动指定文件模式

source: File patterns, e.g. *.c *.h
ja: ファイルパターン。 * .c * .h
ru: Шаблоны файлов, например. * .c * .h
zh_cn: 文件模式，例如* .c * .h

source: _Directory:
ja: _ディレクトリ：
zh_cn: _目录：

source: See grep's manual page for more information
ja: 詳細については、grepのマニュアルページを参照してください。
ru: Дополнительную информацию см. На странице руководства пользователя grep.
zh_cn: 有关更多信息，请参阅grep的手册页

source: _Recurse in subfolders
ru: _Recurse в подпапках
zh_cn: _在子文件夹中输入

source: _Invert search results
ja: _検索結果を無効にする
ru: _Инвестировать результаты поиска
zh_cn: _反转搜索结果

source: Invert the sense of matching, to select non-matching lines
ja: マッチングの感覚を反転し、一致しない線を選択する
ru: Инвертируйте смысл соответствия, чтобы выбрать несогласованные строки
zh_cn: 颠倒匹配的意义，选择不匹配的行

source: E_xtra options:
ja: E_xtraオプション：
ru: Дополнительные опции:
zh_cn: E_xtra选项：

source: Other options to pass to Grep
ja: Grepに渡すその他のオプション
ru: Другие варианты, чтобы перейти к Grep
zh_cn: 其他选项传递给Grep

source: Found %d match for "%s".
ja: "％s"に一致する％dが見つかりました。
ru: Найдено% d для «% s».
zh_cn: 找到％d匹配“％s”。

source: Replaced %u matches in %u documents.
ja: 置き換えられた％uは％uドキュメントで一致します。
ru: Заменено% u соответствует в% u документах.
zh_cn: 取代％u匹配％u文件。

source: Invalid directory for find in files.
ja: ファイル内のfindのディレクトリが無効です。
ru: Недопустимый каталог для поиска в файлах.
zh_cn: 无法找到文件的目录。

source: No text to find.
ja: 検索するテキストがありません。
ru: Нет текста для поиска.
zh_cn: 没有文字可以找到。

source: Cannot execute grep tool '%s'; check the path setting in Preferences.
ja: grepツール '％s'を実行できません。環境設定でパス設定を確認してください。
ru: Не удается выполнить grep tool '% s'; проверьте настройку пути в настройках.
zh_cn: 无法执行grep工具'％s';在首选项中检查路径设置。

source: Cannot parse extra options: %s
ja: 余分なオプションを解析できません：％s
ru: Невозможно проанализировать дополнительные параметры:% s
zh_cn: 无法解析额外的选项：％s

source: Searching...
ja: 検索中...
ru: Поиск ...
zh_cn: 搜索...

source: %s %s -- %s (in directory: %s)
ja: ％s％s - ％s（ディレクトリ：％s）
ru: % s% s -% s (в каталоге:% s)
zh_cn: ％s％s - ％s（在目录中：％s）

source: Could not open directory (%s)
ja: ディレクトリ（％s）を開けませんでした
ru: Не удалось открыть каталог (% s)
zh_cn: 无法打开目录（％s）

source: Search failed.
ja: 検索に失敗しました。
ru: Поиск не удался.
zh_cn: 搜索失败。

source: Search completed with %d match.
ja: ％d件の検索で検索が完了しました。
ru: Поиск завершен с соответствием% d.
zh_cn: 搜索已完成％d匹配。

source: No matches found.
ja: 一致するものは見つかりませんでした。
ru: Совпадений не найдено.
zh_cn: 找不到匹配项。

source: Bad regex: %s
ja: 不正な正規表現：％s
ru: Плохое регулярное выражение:% s
zh_cn: 错误的正则表达式：％s

source: No tags found
ja: タグが見つかりません
ru: Не найдено тегов
zh_cn: 未找到标签

source: Variable
ja: 変数
ru: переменная
zh_cn: 变量

source: Value
ja: 値
ru: Стоимость
zh_cn: 值

source: Open Containing Folder
ja: 開いているフォルダを含む
ru: Открыть содержащую папку
zh_cn: 打开包含文件夹

source: Remove From Project
ja: プロジェクトから削除
ru: Удалить из проекта
zh_cn: 从项目中删除

source: Add To Current Project
ja: 現在のプロジェクトに追加
ru: Добавить в текущий проект
zh_cn: 添加到当前项目

source: Close Project
ja: プロジェクトを閉じる
ru: Закрыть проект
zh_cn: 关闭项目

source: Close Document
ja: ドキュメントを閉じる
ru: Закрыть документ
zh_cn: 关闭文档

source: Geany tried to access the Unix Domain socket of another instance running as another user. This is a fatal error and Geany will now quit.
ja: Geanyは別のユーザーとして実行中の別のインスタンスのUnix Domainソケットにアクセスしようとしました。 これは致命的なエラーで、Geanyは終了します。
ru: Geany попытался получить доступ к сокету Unix домена другого экземпляра, запущенного как другой пользователь. Это фатальная ошибка, и теперь Geany уйдет.
zh_cn: Geany试图访问以另一个用户身份运行的另一个实例的Unix域套接字。 这是一个致命的错误，Geany现在将退出。

source: Name
ja: 名
ru: имя
zh_cn: 名称

source: Sections
ja: セクション
ru: Разделы
zh_cn: 第

source: Keys
ja: キー
ru: Ключи
zh_cn: 按键

source: Functions
ja: 機能
ru: функции
zh_cn: 功能

source: Constants
ja: 定数
ru: Константы
zh_cn: 常量

source: Types
ja: タイプ
ru: Типы
zh_cn: 类型

source: Labels
ja: ラベル
ru: Этикетки
zh_cn: 标签

source: Members
ja: メンバー
ru: члены
zh_cn: 会员

source: Other
ja: その他
ru: Другие
zh_cn: 其他

source: Namespaces
ja: 名前空間
ru: Пространства имен
zh_cn: 命名空间

source: Classes
ja: クラス
ru: Классы
zh_cn: 类

source: Interfaces
ja: インターフェイス
ru: Интерфейсы
zh_cn: 接口

source: Structs
ja: 構造
ru: Структуры
zh_cn: 结构

source: Extern Variables
ja: Extern変数
ru: Внешние переменные
zh_cn: 外部变量

source: Unknown filetype extension for "%s".
ja: "％s"の不明なファイル拡張子。
ru: Неизвестное расширение типа файла для «% s».
zh_cn: “％s”的未知文件类型扩展名。

source: Failed to create tags file, perhaps because no tags were found.
ja: おそらくタグが見つからなかったため、タグファイルの作成に失敗しました。
ru: Не удалось создать файл тегов, возможно, из-за отсутствия тегов.
zh_cn: 未能创建标签文件，可能因为没有找到标签。

source: Usage: %s -g <Tag File> <File list>
ja: 使用法：％s -g <タグファイル> <ファイルリスト>
ru: Использование:% s -g <Файл тега> <Список файлов>
zh_cn: 用法：％s -g <标签文件> <文件列表>

source: Example: CFLAGS=`pkg-config gtk+-2.0 --cflags` %s -g gtk2.c.tags /usr/include/gtk-2.0/gtk/gtk.h
ja: 例： CFLAGS = `pkg-config gtk + -2.0 --cflags`％s -g gtk2.c.tags /usr/include/gtk-2.0/gtk/gtk.h
ru: Пример: CFLAGS = `pkg-config gtk + -2.0 --cflags`% s -g gtk2.c.tags /usr/include/gtk-2.0/gtk/gtk.h
zh_cn: 例： CFLAGS =`pkg-config gtk + -2.0 --cflags`％s -g gtk2.c.tags /usr/include/gtk-2.0/gtk/gtk.h

source: Load Tags
ja: タグを読み込む
ru: Загрузить теги
zh_cn: 加载标签

source: Geany tag files (*.*.tags)
ja: Geanyタグファイル（*。*。タグ）
ru: Файлы тегов Geany (*. *. Теги)
zh_cn: Geany标签文件（*。*。标签）

source: Loaded %s tags file '%s'.
ja: ％s個のタグファイル '％s'を読み込みました。
ru: Загрузил% s теги файл '% s'.
zh_cn: 加载的％s标签文件'％s'。

source: Could not load tags file '%s'.
ja: タグファイル '％s'を読み込めませんでした。
ru: Не удалось загрузить файл тэга '% s'.
zh_cn: 无法加载标记文件'％s'。

source: Forward declaration "%s" not found.
ja: フォワード宣言 "％s"が見つかりません。
ru: Вперед декларация «% s» не найдена.
zh_cn: 未找到前向声明“％s”。

source: Definition of "%s" not found.
ja: "％s"の定義が見つかりません。
ru: Определение «% s» не найдено.
zh_cn: 未找到“％s”的定义。

source: Sort by _Name
ja: 名前順
ru: Сортировать по имени
zh_cn: 按名称分类

source: Sort by _Appearance
ja: _Appearanceで並べ替え
ru: Сортировать по _Appearance
zh_cn: 按_外观排序

source: Failed to convert template file "%s" to UTF-8
ja: テンプレートファイル "％s"をUTF-8に変換できませんでした
ru: Не удалось преобразовать файл шаблона «% s» в UTF-8
zh_cn: 无法将模板文件“％s”转换为UTF-8

source: Create a new project
ja: 新しいプロジェクトを作成する
ru: Создать новый проект
zh_cn: 创建一个新项目

source: Save the current file
ja: 現在のファイルを保存する
ru: Сохранить текущий файл
zh_cn: 保存当前文件

source: Save all open files
ja: 開いているファイルをすべて保存する
ru: Сохранить все открытые файлы
zh_cn: 保存所有打开的文件

source: Reload the current file from disk
ja: 現在のファイルをディスクから再ロードする
ru: Перезагрузить текущий файл с диска
zh_cn: 从磁盘重新加载当前文件

source: Close the current file
ja: 現在のファイルを閉じる
ru: Закройте текущий файл
zh_cn: 关闭当前文件

source: Close all open files
ja: 開いているファイルをすべて閉じる
ru: Закрыть все открытые файлы
zh_cn: 关闭所有打开的文件

source: Cut the current selection
ja: 現在の選択範囲をカットする
ru: Вырезать текущий выбор
zh_cn: 切断当前选择

source: Copy the current selection
ja: 現在の選択範囲をコピーする
ru: Скопируйте текущий выбор
zh_cn: 复制当前选择

source: Paste the contents of the clipboard
ja: クリップボードの内容を貼り付けます
ru: Вставить содержимое буфера обмена
zh_cn: 粘贴剪贴板的内容

source: Delete the current selection
ja: 現在の選択を削除する
ru: Удалить текущий выбор
zh_cn: 删除当前选择

source: Undo the last modification
ja: 最後の変更を元に戻す
ru: Отменить последнюю модификацию
zh_cn: 撤消上次修改

source: Redo the last modification
ja: 最後の変更をやり直す
ru: Повторить последнюю модификацию
zh_cn: 重做最后一次修改

source: Compile the current project
ja: 現在のプロジェクトをコンパイルする
ru: Скомпилировать текущий проект
zh_cn: 编译当前项目

source: Run the current project on the local machine
ja: ローカルマシン上で現在のプロジェクトを実行する
ru: Запустить текущий проект на локальной машине
zh_cn: 在本地机器上运行当前项目

source: Broadcast the current project to devices
ja: 現在のプロジェクトをデバイスにブロードキャストする
ru: Передача текущего проекта на устройства
zh_cn: 将当前项目广播到设备

source: Debug the current project
ja: 現在のプロジェクトをデバッグする
ru: Отладить текущий проект
zh_cn: 调试当前项目

source: Open a color chooser dialog, to interactively pick colors from a palette
ja: カラーチューザーダイアログを開き、パレットから色をインタラクティブに選択する
ru: Откройте диалоговое окно выбора цвета, чтобы интерактивно выбрать цвета из палитры
zh_cn: 打开颜色选择器对话框，交互式地从调色板中选取颜色

source: Zoom in the text
ja: テキストを拡大する
ru: Увеличить текст
zh_cn: 放大文字

source: Zoom out the text
ja: テキストをズームアウトする
ru: Уменьшить текст
zh_cn: 缩小文字

source: Decrease indentation
ja: 押し込み量を減らす
ru: Уменьшение отступа
zh_cn: 减少缩进

source: Increase indentation
ja: インデントを増やす
ru: Увеличить отступ
zh_cn: 增加缩进

source: Find the entered text in the current file
ja: 現在のファイルに入力されたテキストを検索する
ru: Найти введенный текст в текущем файле
zh_cn: 在当前文件中找到输入的文本

source: Show the preferences dialog
ja: 環境設定ダイアログを表示する
ru: Показать диалог настроек
zh_cn: 显示首选项对话框

source: Quit Geany
ja: Geanyを終了する
ru: Выйти из Geany
zh_cn: 退出Geany

source: Print document
ja: 文書を印刷する
ru: Печатать документ
zh_cn: 打印文档

source: Replace text in the current document
ja: 現在のドキュメントのテキストを置き換える
ru: Заменить текст в текущем документе
zh_cn: 替换当前文档中的文本

source: Open an existing project
ja: 既存のプロジェクトを開く
ru: Открыть существующий проект
zh_cn: 打开一个现有的项目

source: Open a recent project
ja: 最近のプロジェクトを開く
ru: Откройте недавний проект
zh_cn: 打开最近的项目

source: Search Field
ja: 検索フィールド
ru: Поле поиска
zh_cn: 搜索字段

source: Separator
ja: セパレータ
ru: Разделитель
zh_cn: 分隔器

source: --- Separator ---
ja: ---セパレータ---
ru: --- Разделитель ---
zh_cn: - - 分隔器 - -

source: Select items to be displayed on the toolbar. Items can be reordered by drag and drop.
ja: ツールバーに表示する項目を選択します。アイテムは、ドラッグ＆ドロップで並べ替えることができます。
ru: Выберите элементы, которые будут отображаться на панели инструментов. Элементы можно переупорядочить путем перетаскивания.
zh_cn: 选择要在工具栏上显示的项目。项目可以通过拖放进行重新排序。

source: Available Items
ja: 利用可能なアイテム
ru: Доступные предметы
zh_cn: 可用项目

source: Displayed Items
ja: 表示される項目
ru: Отображаемые товары
zh_cn: 显示的项目

source: Invalid command: %s
ja: 無効なコマンド：％s
ru: Недопустимая команда:% s
zh_cn: 无效的命令：％s

source: Command not found
ja: コマンドが見つかりません
ru: Команда не найдена
zh_cn: 找不到命令

source: The executed custom command returned an error. Your selection was not changed. Error message: %s
ja: 実行されたカスタムコマンドがエラーを返しました。あなたの選択は変更されませんでした。エラーメッセージ：％s
ru: Выполненная пользовательская команда вернула ошибку. Ваш выбор не был изменен. Сообщения об ошибках
zh_cn: 执行的自定义命令返回错误。您的选择没有改变。错误消息：％s

source: The executed custom command exited with an unsuccessful exit code.
ja: 実行されたカスタムコマンドは、終了コードが失敗して終了しました。
ru: Выполненная пользовательская команда вышла с неудачным кодом выхода.
zh_cn: 已执行的自定义命令退出并显示不成功的退出代码。

source: Custom command failed: %s
ja: カスタムコマンドが失敗しました：％s
ru: Не удалось выполнить команду:% s
zh_cn: 自定义命令失败：％s

source: Passing data and executing custom command: %s
ja: データの受け渡しとカスタムコマンドの実行：％s
ru: Передача данных и выполнение пользовательской команды:% s
zh_cn: 传递数据并执行自定义命令：％s

source: Set Custom Commands
ja: カスタムコマンドの設定
ru: Установка пользовательских команд
zh_cn: 设置自定义命令

source: You can send the current selection to any of these commands and the output of the command replaces the current selection.
ja: 現在の選択をこれらのコマンドのいずれかに送信することができ、コマンドの出力が現在の選択を置き換えます。
ru: Вы можете отправить текущий выбор в любую из этих команд, и вывод команды заменяет текущий выбор.
zh_cn: 您可以将当前选择发送到这些命令中的任何一个，并且该命令的输出会替换当前选择。

source: No custom commands defined.
ja: カスタムコマンドが定義されていません。
ru: Определенные пользовательские команды не определены.
zh_cn: 没有定义自定义命令。

source: Word Count
ja: ワード数
ru: Количество слов
zh_cn: 字数

source: selection
ja: 選択
ru: выбор
zh_cn: 选择

source: whole document
ja: 全てのドキュメント
ru: весь документ
zh_cn: 整个文档

source: Range:
ja: 範囲：
ru: Ассортимент:
zh_cn: 范围：

source: Lines:
ja: ライン：
ru: линии:
zh_cn: 行：

source: Words:
ja: 言葉：
ru: Слова:
zh_cn: 话：

source: Characters:
ja: キャラクター：
ru: Персонажи:
zh_cn: 特点：

source: line: %l / %L col: %c sel: %s %w %t %mmode: %M encoding: %e filetype: %f scope: %S
ja: 行：％l /％L col：％c sel：％s％w％t％mmode：％Mエンコード：％eファイルタイプ：％fスコープ：％S
ru: line:% l /% L col:% c sel:% s% w% t% mmode:% M кодировка:% e filetype:% f scope:% S
zh_cn: 行：％l /％L col：％c sel：％s％w％t％mmode：％M编码：％e文件类型：％f范围：％S

source: %dL
ru: % дл
zh_cn: ％升

source: TAB
ja: タブ
zh_cn: 标签

source: (new instance)
ja: （新しいインスタンス）
ru: (новый экземпляр)
zh_cn: （新实例）

source: Font updated (%s).
ja: フォントが更新されました（％s）。
ru: Обновлен шрифт (% s).
zh_cn: 字体已更新（％s）。

source: _Set Custom Date Format
ja: _カスタム日付形式の設定
ru: _Настройка пользовательского формата даты
zh_cn: 设置自定义日期格式

source: Select Folder
ja: フォルダーを選択
ru: Выберите папку
zh_cn: 选择文件夹

source: Select File
ja: ファイルを選ぶ
ru: Выберите файл
zh_cn: 选择文件

source: Save All
ja: すべてを救う
ru: Сохранить все
zh_cn: 保存全部

source: Close All
ja: すべて閉じる
ru: Закрыть все
zh_cn: 关闭所有

source: Geany cannot start!
ja: ゲイニーは始まらない！
ru: Geany не может начаться!
zh_cn: Geany无法启动！

source: Installing:
ja: インストール：
ru: Установка:
zh_cn: 安装：

source: Failed to get projects source folder
ja: プロジェクトのソースフォルダを取得できませんでした
ru: Не удалось получить исходную папку проектов
zh_cn: 无法获取项目源文件夹

source: Failed to get C++ libraries source folder
ja: C ++ライブラリのソースフォルダを取得できませんでした
ru: Не удалось получить исходную папку библиотек C ++
zh_cn: 无法获取C ++库源文件夹

source: Failed to find projects source folder at location: %s
ja: 場所のプロジェクトソースフォルダを見つけることができませんでした：％s
ru: Не удалось найти исходную папку проектов по адресу:% s
zh_cn: 无法找到位置为％s的项目源文件夹

source: Unexpected: Projects source folder is not a folder: %s
ja: 予期しない：プロジェクトのソースフォルダがフォルダではありません：％s
ru: Неожиданно: исходная папка проектов не является папкой:% s
zh_cn: 意外：项目源文件夹不是文件夹：％s

source: Failed to find C++ libraries folder at location: %s
ja: 場所：％sのC ++ライブラリフォルダを見つけることができませんでした
ru: Не удалось найти папку библиотек C ++ в папке:% s
zh_cn: 无法在位置：％s找到C ++库文件夹

source: Unexpected: C++ libraries folder is not a folder: %s
ja: 予期しない：C ++ライブラリのフォルダがフォルダではありません：％s
ru: Неожиданно: папка библиотек C ++ не является папкой:% s
zh_cn: 意外：C ++库文件夹不是一个文件夹：％s

source: Select Browser
ja: ブラウザを選択
ru: Выбрать браузер
zh_cn: 选择浏览器

source: Failed to spawn the configured browser command. Please correct it or enter another one.
ja: 設定されたブラウザコマンドを生成できませんでした。それを修正するか、別のものを入力してください。
ru: Не удалось создать настроенную команду браузера. Пожалуйста, исправьте его или введите другой.
zh_cn: 无法产生配置的浏览器命令。请更正它或输入另一个。

source: invalid VTE library "%s": missing symbol "%s"
ja: 無効なVTEライブラリ "％s"：シンボル "％s"がありません
ru: недействительная библиотека VTE «% s»: отсутствующий символ «% s»
zh_cn: 无效的VTE库“％s”：缺少符号“％s”

source: _Set Path From Document
ja: _ドキュメントからのパスを設定する
ru: _Написать путь из документа
zh_cn: 从文档中设置路径

source: _Restart Terminal
ja: _Restartターミナル
ru: Терминал _Restart
zh_cn: _Restart终端

source: _Input Methods
ja: _Inputメソッド
ru: Вводные методы
zh_cn: _输入法

source: Could not change the directory in the VTE because it probably contains a command.
ja: おそらくコマンドが含まれているため、VTEのディレクトリを変更できませんでした。
ru: Не удалось изменить каталог в VTE, потому что он, вероятно, содержит команду.
zh_cn: 无法更改VTE中的目录，因为它可能包含命令。

source: Geany project files
ja: Geanyプロジェクトファイル
ru: Файлы проекта Geany
zh_cn: Geany项目文件

source: Executables
ja: 実行可能ファイル
ru: исполняемые
zh_cn: 可执行文件

source: Process timed out after %.02f s!
ja: プロセスは％.02f秒後にタイムアウトしました。
ru: Процесс истекает после% .02f s!
zh_cn: 进程在％.02f s之后超时！

source: _Spaces
ja: _スペース

source: _Tabs
ja: _タブス

source: _Reload
ja: _Road

source: _Commands
ja: _コマンド

source: _Compile
ja: _コンパイル

source: _Debug
ja: _デバッグ
ru: _Отлаживать

source: Build _Options...
ja: _Optionsを作成...
ru: Построить _Опции ...

source: D_ebug
ja: デバッグ
ru: Отлаживать

source: Geany Credits
ja: ゲーニークレジット
ru: Кредиты Geany

source: _Unicode
ja: _ユニコード

source: _Override
ja: _オーバーライド

source: E_ncoding:
ja: エンコーディング：

source: Win (CRLF)
ja: 勝利（CRLF）
ru: Выиграть (CRLF)

source: AGK
ru: АГК

source: AGK
ru: АГК

source: _Tools
ru: _Инструменты

source: dd.mm.yyyy
ru: дд.мм.гггг

source: yyyy/mm/dd
ru: дд гггг / мм /

source: ID
ru: Я БЫ

source: OVR
ru: ОВР
