Repository: Dark-Basic-Software-Limited/AGKClassic
Catalog: AGK/IDE/Geany-1.24.1/po/*.po
Languages: ja, ru, zh_cn

source: Switch to last used document after closing a tab
ja: タブを閉じた後に最後に使用した文書に切り替える
ru: Переключиться на последний использованный документ после закрытия вкладки
zh_cn: 关闭选项卡后，切换到上次使用的文档

source: <b>Editor tabs</b>
ja: <b>エディタタブ</ b>
ru: <b> вкладки редактора </ b>
zh_cn: <b>编辑器标签</ b>

source: Sidebar:
ja: サイドバー：
ru: Боковая панель:
zh_cn: 边栏：

source: <b>Tab positions</b>
ja: <b>タブの位置</ b>
ru: <b> Позиции табуляции </ b>
zh_cn: <b>标签位置</ b>

source: Notebook tabs
ja: ノートブックタブ
ru: Вкладки для ноутбуков
zh_cn: 笔记本标签

source: Show t_oolbar
ja: t_oolbarを表示
ru: Показать t_oolbar
zh_cn: 显示t_oolbar

source: _Append toolbar to the menu
ja: _ツールバーをメニューに追加
ru: Панель инструментов _Append в меню
zh_cn: _将工具栏添加到菜单

source: Pack the toolbar to the main menu to save vertical space
ja: ツールバーをメインメニューにパックして縦のスペースを節約する
ru: Установите панель инструментов в главное меню, чтобы сохранить вертикальное пространство
zh_cn: 将工具栏打包到主菜单以节省垂直空间

source: Customize Toolbar
ja: ツールバーのカスタマイズ
ru: Настройка панели инструментов
zh_cn: 自定义工具栏

source: System _default
ja: システムのデフォルト
ru: Системные установки по умолчанию
zh_cn: 系统_默认

source: Images _and text
ja: 画像_とテキスト
ru: Изображения _ и текст
zh_cn: 图片_和文字

source: _Images only
ja: _イメージのみ
ru: _Имеется только
zh_cn: _仅限图像

source: _Text only
ja: _テキストのみ
ru: _Только текст
zh_cn: _纯文本

source: <b>Icon style</b>
ja: <b>アイコンスタイル</ b>
ru: <b> Стиль значков </ b>
zh_cn: <b>图标样式</ b>

source: S_ystem default
ja: システムのデフォルト
ru: Системные установки по умолчанию
zh_cn: S_ystem默认值

source: _Small icons
ja: _小さなアイコン
ru: Значки _Small
zh_cn: _小图标

source: _Very small icons
ja: _非常に小さなアイコン
ru: _Все маленькие значки
zh_cn: _很小的图标

source: _Large icons
ja: _大きなアイコン
ru: _Большие иконки
zh_cn: _大图标

source: <b>Icon size</b>
ja: <b>アイコンサイズ</ b>
ru: <b> Размер значка </ b>
zh_cn: <b>图标大小</ b>

source: <b>Toolbar</b>
ja: <b>ツールバー</ b>
ru: <Б> Панель инструментов </ b>
zh_cn: <B>工具栏</ b>的

source: Toolbar
ja: ツールバー
ru: Панель инструментов
zh_cn: 工具栏

source: Line wrapping
ja: 行の折り返し
ru: Линейная упаковка
zh_cn: 线包装

source: Wrap the line at the window border and continue it on the next line. Note: line wrapping has a high performance cost for large documents so should be disabled on slow machines.
ja: ウィンドウの境界線で折り返して、次の行に移動します。注：行の折り返しは、大きな文書では高いパフォーマンスのコストがかかるため、遅いマシンでは無効にする必要があります。
ru: Оберните линию на границе окна и продолжите ее на следующей строке. Примечание. Линейная упаковка имеет высокую производительность для больших документов, поэтому ее следует отключать на медленных машинах.
zh_cn: 将窗口边框包裹起来，并在下一行继续。注意：换行对于大型文档具有很高的性能成本，因此应在慢速机器上禁用。

source: "Smart" home key
ja: "スマート"ホームキー
ru: «Умный» домашний ключ
zh_cn: “智能”家庭钥匙

source: When "smart" home is enabled, the HOME key will move the caret to the first non-blank character of the line, unless it is already there, it moves to the very beginning of the line. When this feature is disabled, the HOME key always moves the caret to the start of the current line, regardless of its current position.
ja: "スマート"ホームが有効になっている場合、HOMEキーは、キャレットを空白でない最初の文字に移動します。それ以外の場合は、行頭に移動します。この機能を無効にすると、HOMEキーは現在の位置にかかわらず常にカレットを現在の行の先頭に移動します。
ru: Когда «умный» дом включен, клавиша HOME переместит курсор на первый непустой символ строки, если он уже не существует, он перемещается в самое начало строки. Когда эта функция отключена, кнопка HOME всегда перемещает каретку в начало текущей строки независимо от ее текущей позиции.
zh_cn: 当启用“智能”主页时，HOME键会将插入符移动到该行的第一个非空白字符，除非它已经在那里，它会移动到行的最开始位置。当禁用此功能时，无论当前位置如何，HOME键始终将插入符号移动到当前行的起始位置。

source: Disable Drag and Drop
ja: ドラッグ＆ドロップを無効にする
ru: Отключить перетаскивание
zh_cn: 禁用拖放

source: Disable drag and drop completely in the editor window so you can't drag and drop any selections within or outside of the editor window
ja: エディタウィンドウ内でドラッグアンドドロップを完全に無効にして、エディタウィンドウ内または外の選択項目をドラッグアンドドロップすることはできません
ru: Отключить перетаскивание полностью в окне редактора, чтобы вы не могли перетаскивать любые выделения внутри или вне окна редактора
zh_cn: 禁止在编辑器窗口中完全拖放，因此无法在编辑器窗口内或外部拖放任何选择

source: Code folding
ja: コード折りたたみ
ru: Сгибание кода
zh_cn: 代码折叠

source: Fold/unfold all children of a fold point
ja: 折りたたみポイントのすべての子を折りたたんで展開する
ru: Складывать / разворачивать всех детей точки сгиба
zh_cn: 折叠/展开折叠点的所有孩子

source: Fold or unfold all children of a fold point. By pressing the Shift key while clicking on a fold symbol the contrary behavior is used.
ja: フォールドポイントのすべての子を折り畳んだり展開したりする。折り畳み記号をクリックしながらShiftキーを押すと、逆の動作が使用されます。
ru: Сложите или разворачивайте всех детей точки сгиба. При нажатии клавиши Shift при нажатии на символ сгиба используется противоположное поведение.
zh_cn: 折叠或展开折叠点的所有孩子。点击折叠符号时按住Shift键，会使用相反的行为。

source: Use indicators to show compile errors
ja: インジケータを使用してコンパイルエラーを表示する
ru: Использовать индикаторы для отображения ошибок компиляции
zh_cn: 使用指示器显示编译错误

source: Whether to use indicators (a squiggly underline) to highlight the lines where the compiler found a warning or an error
ja: コンパイラが警告またはエラーを検出した行を強調表示するためにインジケータ（かすかな下線）を使用するかどうか
ru: Использовать индикаторы (подчеркнуто подчеркивание), чтобы выделить строки, где компилятор обнаружил предупреждение или ошибку
zh_cn: 是否使用指示符（一种扭曲的下划线）突出显示编译器发现警告或错误的行

source: Newline strips trailing spaces
ja: 改行は末尾のスペースを取り除く
ru: Новые строки перекрывают пробелы
zh_cn: 换行去掉尾随空格

source: Enable newline to strip the trailing spaces on the previous line
ja: 改行を有効にして、前の行の末尾のスペースを削除する
ru: Включить новую строку для удаления конечных пробелов на предыдущей строке
zh_cn: 启用换行来去除前一行的尾部空格

source: Highlight instances of selected word
ja: 選択した単語のインスタンスを強調表示する
ru: Выделите экземпляры выбранного слова
zh_cn: 突出显示所选单词的实例

source: When selecting a word other instances of that word will be highlighted in the current document
ja: 単語を選択すると、その単語の他のインスタンスが現在の文書で強調表示されます
ru: При выборе слова другие экземпляры этого слова будут выделены в текущем документе
zh_cn: 选择单词时，该单词的其他实例将在当前文档中突出显示

source: Line breaking column:
ja: 改行列：
ru: Столбец разрыва строки:
zh_cn: 换行列：

source: Comment toggle marker:
ja: コメントトグルマーカー：
ru: Комментарий toggle marker:
zh_cn: 评论切换标记：

source: A string which is added when toggling a line comment in a source file, it is used to mark the comment as toggled.
ja: ソースファイル内の行コメントを切り替えるときに追加される文字列で、コメントをトグルとしてマークするために使用されます。
ru: Строка, которая добавляется при переключении комментария строки в исходном файле, используется для пометки комментария как переведенного.
zh_cn: 在切换源文件中的行注释时添加的字符串，用于将注释标记为切换。

source: <b>Features</b>
ja: <b>機能</ b>
ru: <Б> Функции </ b>
zh_cn: <B>功能</ b>的

source: Features
ja: 特徴
ru: Особенности
zh_cn: 特征

source: Width:
ja: 幅：
ru: Ширина:
zh_cn: 宽度：

source: The width in chars of a single indent
ja: 1つのインデントの幅
ru: Ширина в символах одного отступа
zh_cn: 单个缩进的字符宽度

source: Auto-indent mode:
ja: 自動インデントモード：
ru: Автоматический отступ:
zh_cn: 自动缩进模式：

source: T_abs and spaces
ja: T_absとスペース
ru: T_abs и пробелы
zh_cn: T_abs和空格

source: Same as Tabs except backspacing will treat groups of spaces at the beginning of lines like tabs
ja: バックスペースを除いてタブと同じです。タブのような行の先頭にあるスペースのグループを扱います
ru: То же, что и вкладки, кроме обратного прокрутки, будут обрабатывать группы пробелов в начале строк, таких как вкладки
zh_cn: 与“制表符”相同，但“退格制”将在制表符的行首处理空格组

source: Use spaces when indenting
ja: インデント時にスペースを使用する
ru: Использовать пробелы при отступе
zh_cn: 缩进时使用空格

source: Uses tabs when indenting
ja: インデント時にタブを使用する
ru: Использование вкладок при отступов
zh_cn: 缩进时使用制表符

source: Type:
ja: タイプ：
ru: Тип:
zh_cn: 类型：

source: Tab key indents
ja: タブキーインデント
ru: Вкладки клавиш
zh_cn: Tab键缩进

source: Pressing tab/shift-tab indents/unindents instead of inserting a tab character
ja: タブ文字を挿入するのではなく、タブ/シフトタブのインデント/アンインデントを押す
ru: Нажатие вкладки / сдвига-вставки / отступов вместо ввода символа табуляции
zh_cn: 按tab / shift-tab缩进/ unindents而不是插入制表符

source: <b>Indentation</b>
ja: <b>インデント</ b>
ru: <Б> Отступ </ B>
zh_cn: <B>压痕</ b>的

source: Indentation
ja: インデント
ru: вдавливание
zh_cn: 缩进

source: Snippet completion
ja: スニペットの完了
ru: Завершение фрагмента
zh_cn: 代码段完成

source: Type a defined short character sequence and complete it to a more complex string using a single keypress
ja: 定義された短い文字シーケンスを入力し、単一のキーを使用してそれをより複雑な文字列に完成させる
ru: Введите определенную короткую последовательность символов и завершите ее до более сложной строки с помощью одного нажатия клавиши
zh_cn: 输入定义的短字符序列，并使用单个按键将其完成为更复杂的字符串

source: XML/HTML tag auto-closing
ja: XML / HTMLタグ自動クローズ
ru: Автоматическое закрытие тега XML / HTML
zh_cn: XML / HTML标签自动关闭

source: Insert matching closing tag for XML/HTML
ja: XML / HTMLに一致する終了タグを挿入する
ru: Вставить соответствующий тег закрытия для XML / HTML
zh_cn: 为XML / HTML插入匹配结束标记

source: Automatic continuation of multi-line comments
ja: 複数行コメントの自動継続
ru: Автоматическое продолжение многострочных комментариев
zh_cn: 自动延续多行注释

source: Continue automatically multi-line comments in languages like C, C++ and Java when a new line is entered inside such a comment
ja: そのようなコメントの中に新しい行が入力されると、C、C ++、Javaなどの言語で自動的に複数行のコメントが続行されます
ru: Продолжайте автоматически многострочные комментарии на таких языках, как C, C ++ и Java, когда в такой комментарий вводится новая строка
zh_cn: 当在这样的评论中输入新行时，用C，C ++和Java等语言自动继续多行注释

source: Autocomplete symbols
ja: オートコンプリートシンボル
ru: Автозаполненные символы
zh_cn: 自动填充符号

source: Automatic completion of known symbols in open files (function names, global variables, ...)
ja: 開いているファイル（関数名、グローバル変数など）内の既知のシンボルの自動補完
ru: Автоматическое завершение известных символов в открытых файлах (имена функций, глобальные переменные, ...)
zh_cn: 自动完成已打开文件中的已知符号（函数名称，全局变量，...）

source: Autocomplete all words in document
ja: ドキュメント内のすべての単語をオートコンプリートする
ru: Автозаполнение всех слов в документе
zh_cn: 自动完成文档中的所有单词

source: Drop rest of word on completion
ja: 完了時に残りの単語を削除する
ru: Оставьте слово на завершении
zh_cn: 完成后放下其余的单词

source: Max. symbol name suggestions:
ja: マックスシンボル名の提案：
ru: Максимум. предложение названия символа:
zh_cn: 最大。符号名称建议：

source: Completion list height:
ja: 完了リストの高さ：
ru: Высота списка завершений:
zh_cn: 完成列表高度：

source: Characters to type for autocompletion:
ja: オートコンプリートを入力する文字：
ru: Символы для ввода автозаполнения:
zh_cn: 输入自动完成的字符：

source: The amount of characters which are necessary to show the symbol autocompletion list
ja: シンボルの自動補完リストを表示するのに必要な文字の量
ru: Количество символов, необходимых для отображения списка автозаполнения символа
zh_cn: 显示符号自动完成列表所需的字符数量

source: Display height in rows for the autocompletion list
ja: オートコンプリートリストの行の高さを表示する
ru: Отображать высоту в строках для списка автозаполнения
zh_cn: 显示自动完成列表的行高

source: Maximum number of entries to display in the autocompletion list
ja: オートコンプリートリストに表示するエントリの最大数
ru: Максимальное количество записей, отображаемых в списке автозаполнения
zh_cn: 自动完成列表中显示的最大条目数

source: Symbol list update frequency:
ja: シンボルリストの更新頻度：
ru: Частота обновления списка символов:
zh_cn: 符号列表更新频率：

source: Minimal delay (in milliseconds) between two automatic updates of the symbol list. Note that a too short delay may have performance impact, especially with large files. A delay of 0 disables real-time updates.
ja: シンボルリストの2つの自動更新間の最小遅延（ミリ秒単位）。あまりにも短い遅延は、特に大きなファイルでパフォーマンスに影響を与える可能性があることに注意してください。 0の遅延は、リアルタイム更新を無効にします。
ru: Минимальная задержка (в миллисекундах) между двумя автоматическими обновлениями списка символов. Обратите внимание, что слишком короткая задержка может повлиять на производительность, особенно с большими файлами. Задержка 0 отключает обновления в режиме реального времени.
zh_cn: 符号列表的两次自动更新之间的最小延迟（以毫秒为单位）。请注意，太短的延迟可能会对性能产生影响，特别是对于大文件。延迟0会禁用实时更新。

source: <b>Completions</b>
ja: <b>完了</ b>
ru: <Б> заканчивания </ B>
zh_cn: <B>的完成</ b>的

source: Parenthesis ( )
ja: 括弧（）
ru: Скобки ()
zh_cn: 括号（）

source: Auto-close parenthesis when typing an opening one
ja: 開始括弧を入力するときに括弧を自動的に閉じます
ru: Автоматическое закрытие круглых скобок при вводе открывающего
zh_cn: 输入开头的时候自动关闭括号

source: Single quotes ' '
ja: 一重引用符 ''
ru: Одиночные кавычки ''
zh_cn: 单引号''

source: Auto-close single quote when typing an opening one
ja: 開始時に一重引用符を自動的に閉じる
ru: Автоматическое закрытие одиночной кавычки при вводе открывающего
zh_cn: 输入开头的单引号时自动关闭单引号

source: Curly brackets { }
ja: 中括弧 { }
ru: Фигурные скобки { }
zh_cn: 大括号 { }

source: Auto-close curly bracket when typing an opening one
ja: 開いているときに中かっこを自動的に閉じます
ru: Автоматически закрывать фигурные скобки при вводе открывающего
zh_cn: 输入空格时自动关闭大括号

source: Square brackets [ ]
ja: 角括弧 [ ]
ru: Квадратные скобки [ ]
zh_cn: 方括号 [ ]

source: Auto-close square-bracket when typing an opening one
ja: 開始時に角かっこを自動的に閉じる
ru: Автоматическое закрытие квадратного кронштейна при вводе открывающего
zh_cn: 输入开头的方括号时自动关闭方括号

source: Double quotes " "
ja: 二重引用符 ""
ru: Двойные кавычки " "
zh_cn: 双引号 ” ”

source: Auto-close double quote when typing an opening one
ja: 開始時にダブルクォートを自動的に閉じる
ru: Автоматическая закрытие двойной кавычки при вводе
zh_cn: 输入开始时自动关闭双引号

source: <b>Auto-close quotes and brackets</b>
ja: <b>引用符と括弧を自動的に閉じる</ b>
ru: <b> Автоматическое закрытие цитат и скобок </ b>
zh_cn: <b>自动关闭引号和括号</ b>

source: Completions
ja: 完了
ru: Пополнения
zh_cn: 落成

source: Invert syntax highlighting colors
ja: 構文の強調表示の色を反転する
ru: Инвертировать подсветку синтаксиса
zh_cn: 反转语法高亮颜色

source: Invert all colors, by default using white text on a black background
ja: すべての色を反転する、デフォルトでは黒い背景に白いテキストを使用する
ru: Инвертировать все цвета, по умолчанию, используя белый текст на черном фоне
zh_cn: 反转所有颜色，默认情况下使用黑色背景上的白色文字

source: Show indentation guides
ja: インデントガイドを表示する
ru: Показать руководства по отстукам
zh_cn: 显示缩进指南

source: Shows small dotted lines to help you to use the right indentation
ja: 右のインデントを使用するのに役立つ小さな点線を示します
ru: Показывает небольшие пунктирные линии, которые помогут вам использовать правый углубление
zh_cn: 显示小虚线以帮助您使用正确的缩进

source: Show white space
ja: 空白を表示する
ru: Показать пробел
zh_cn: 显示空白

source: Marks spaces with dots and tabs with arrows
ja: スペースをドットとタブに矢印でマークします
ru: Помечает пробелы точками и вкладками со стрелками
zh_cn: 用箭头标记具有点和标签的空格

source: Show line endings
ja: 行末を表示する
ru: Показать окончания строки
zh_cn: 显示行尾

source: Shows the line ending character
ja: 行末の文字を表示します。
ru: Показывает символ окончания строки
zh_cn: 显示行尾字符

source: Show line numbers
ja: 行番号を表示する
ru: Показать номера строк
zh_cn: 显示行号

source: Shows or hides the Line Number margin
ja: 行番号のマージンを表示または非表示にします。
ru: Показывает или скрывает маркер номера строки
zh_cn: 显示或隐藏行号边距

source: Show markers margin
ja: マーカーマージンを表示する
ru: Показывать маркеры
zh_cn: 显示标记边距

source: Shows or hides the small margin right of the line numbers, which is used to mark lines
ja: 行番号を表示するために使用される行番号の右側に小さな余白を表示または非表示にします。
ru: Показывает или скрывает небольшое поле справа от номеров строк, которое используется для обозначения строк
zh_cn: 显示或隐藏行号的小边界右侧，用于标记行

source: Stop scrolling at last line
ja: 最後の行でスクロールを停止する
ru: Остановить прокрутку последней строки
zh_cn: 在最后一行停止滚动

source: Whether to stop scrolling one page past the last line of a document
ja: ドキュメントの最後の行を超えて1ページスクロールを停止するかどうか
ru: Отключение прокрутки одной страницы за последней строкой документа
zh_cn: 是否停止滚动文档最后一行的一页

source: <b>Display</b>
ja: <b>表示</ b>
ru: <Б> Дисплей </ b>
zh_cn: <B>显示</ b>的

source: Column:
ja: カラム：
ru: Колонка:
zh_cn: 柱：

source: Color:
ja: 色：
ru: Цвет:
zh_cn: 颜色：

source: Sets the color of the long line marker
ja: 長いラインマーカーの色を設定します。
ru: Устанавливает цвет маркера длинной строки
zh_cn: 设置长线标记的颜色

source: Color Chooser
ja: 色の選択
ru: Выбор цвета
zh_cn: 颜色选择器

source: The long line marker is a thin vertical line in the editor, it helps to mark long lines, or as a hint to break the line. Set this value to a value greater than 0 to specify the column where it should appear.
ja: 長い線のマーカーは、エディター内の細い垂直線です。長い線をマークするのに役立ちます。また、線を壊すヒントとして役立ちます。表示する列を指定するには、この値を0より大きい値に設定します。
ru: Маркер длинной строки - это тонкая вертикальная линия в редакторе, она помогает отмечать длинные строки или как подсказку, чтобы сломать линию. Установите для этого значения значение больше 0, чтобы указать столбец, в котором он должен появиться.
zh_cn: 长线标记在编辑器中是一条很细的垂直线，它有助于标记较长的线条，或作为打破线条的提示。将此值设置为大于0的值以指定它应出现的列。

source: Line
ja: ライン
ru: Линия
zh_cn: 线

source: Prints a vertical line in the editor window at the given cursor position (see below)
ja: 指定されたカーソル位置のエディタウィンドウに垂直線を印刷します（下記参照）。
ru: Распечатывает вертикальную линию в окне редактора в указанной позиции курсора (см. Ниже)
zh_cn: 在编辑器窗口中的给定光标位置打印垂直线（见下文）

source: Background
ja: バックグラウンド
ru: Задний план
zh_cn: 背景

source: The background color of characters after the given cursor position (see below) changed to the color set below, (this is recommended if you use proportional fonts)
ja: 指定されたカーソル位置（下記参照）の後の文字の背景色は、以下の色に変更されました（これは比例フォントを使用する場合に推奨されます）
ru: Цвет фона символов после заданной позиции курсора (см. Ниже) изменился на цвет, указанный ниже (это рекомендуется, если вы используете пропорциональные шрифты)
zh_cn: 给定光标位置（见下文）后的字符背景颜色已更改为以下颜色集（如果使用比例字体，则建议使用此颜色）

source: Enabled
ja: 有効
ru: Включено
zh_cn: 启用

source: <b>Long line marker</b>
ja: <b>長い行マーカー</ b>
ru: <b> Маркер длинной строки </ b>
zh_cn: <b>长线标记</ b>

source: Disabled
ja: 無効
ru: Отключено
zh_cn: 残

source: Do not show virtual spaces
ja: 仮想空間を表示しない
ru: Не показывать виртуальные пространства
zh_cn: 不要显示虚拟空间

source: Only for rectangular selections
ja: 長方形の選択のみ
ru: Только для прямоугольных выборов
zh_cn: 仅限于矩形选择

source: Only show virtual spaces beyond the end of lines when drawing a rectangular selection
ja: 長方形の選択を描画するときに、行末を越える仮想空間のみを表示する
ru: Показывать только виртуальные пространства за пределами строк при рисовании прямоугольного выделения
zh_cn: 绘制矩形选区时，仅显示超出行尾的虚拟空间

source: Always
ja: 常に
ru: Всегда
zh_cn: 总是

source: Always show virtual spaces beyond the end of lines
ja: 常に線の終わりを超えて仮想空間を表示する
ru: Всегда показывать виртуальные пространства за пределами строк
zh_cn: 始终显示超出行尾的虚拟空间

source: <b>Virtual spaces</b>
ja: <b>仮想スペース</ b>
ru: <b> Виртуальные пространства </ b>
zh_cn: <b>虚拟空间</ b>

source: Display
ja: 表示
ru: дисплей
zh_cn: 显示

source: Editor
ja: 編集者
ru: редактор
zh_cn: 编辑

source: Open new documents from the command-line
ja: コマンドラインから新しい文書を開く
ru: Открытие новых документов из командной строки
zh_cn: 从命令行打开新文档

source: Start a new file for each command-line filename that doesn't exist
ja: 存在しない各コマンドラインファイル名の新しいファイルを開始する
ru: Запустите новый файл для каждого имени файла командной строки, который не существует
zh_cn: 为每个不存在的命令行文件名启动一个新文件

source: Default end of line characters:
ja: デフォルトの行末文字：
ru: По умолчанию символы конца строки:
zh_cn: 行字符的缺省结尾：

source: <b>New files</b>
ja: <b>新しいファイル</ b>
ru: <b> Новые файлы </ b>
zh_cn: <b>新文件</ b>

source: Default encoding (new files):
ja: デフォルトのエンコード（新しいファイル）：
ru: Кодировка по умолчанию (новые файлы):
zh_cn: 默认编码（新文件）：

source: Sets the default encoding for newly created files
ja: 新しく作成されたファイルのデフォルトのエンコーディングを設定します。
ru: Устанавливает кодировку по умолчанию для вновь созданных файлов
zh_cn: 为新创建的文件设置默认编码

source: Use fixed encoding when opening non-Unicode files
ja: 非Unicodeファイルを開くときに固定エンコードを使用する
ru: Использовать фиксированную кодировку при открытии файлов без Unicode
zh_cn: 打开非Unicode文件时使用固定编码

source: This option disables the automatic detection of the file encoding when opening non-Unicode files and opens the file with the specified encoding (usually not needed)
ja: このオプションは、非Unicodeファイルを開くときにファイルエンコーディングの自動検出を無効にし、指定されたエンコーディングでファイルを開きます（通常は不要です）
ru: Этот параметр отключает автоматическое обнаружение кодировки файла при открытии файлов, отличных от Unicode, и открывает файл с указанной кодировкой (как правило, не требуется)
zh_cn: 此选项禁止在打开非Unicode文件时自动检测文件编码并使用指定的编码打开文件（通常不需要）

source: Default encoding (existing non-Unicode files):
ja: デフォルトのエンコーディング（既存の非Unicodeファイル）：
ru: Кодировка по умолчанию (существующие файлы, отличные от Unicode):
zh_cn: 默认编码（现有的非Unicode文件）：

source: Sets the default encoding for opening existing non-Unicode files
ja: 既存の非Unicodeファイルを開くためのデフォルトのエンコーディングを設定します。
ru: Устанавливает кодировку по умолчанию для открытия существующих файлов, отличных от Unicode
zh_cn: 设置打开现有非Unicode文件的默认编码

source: <b>Encodings</b>
ja: <b>エンコード</ b>
ru: <Б> Кодировки </ B>
zh_cn: <B>编码</ b>的

source: Ensure new line at file end
ja: ファイルの終わりに新しい行があることを確認する
ru: Убедитесь, что новая строка в конце файла
zh_cn: 确保文件末尾有新行

source: Ensures that at the end of the file is a new line
ja: ファイルの末尾に改行があることを確認します。
ru: Обеспечивает, чтобы в конце файла появилась новая строка
zh_cn: 确保文件末尾有一个新行

source: Ensure consistent line endings
ja: 一貫した行末を確実にする
ru: Обеспечить согласованные окончания строк
zh_cn: 确保一致的行结束

source: Ensures that newline characters always get converted before saving, avoiding mixed line endings in the same file
ja: 保存する前に改行文字が常に変換されるようにし、同じファイル内に改行が混在しないようにします
ru: Обеспечивает, чтобы символы новой строки всегда преобразовывались перед сохранением, избегая контуров смешанных строк в одном файле
zh_cn: 确保换行符总是在保存之前进行转换，避免在同一文件中出现混合行结束符

source: Strip trailing spaces and tabs
ja: 末尾のスペースとタブを取り除く
ru: Полосы пробелов и вкладки
zh_cn: 尾随空格和制表符

source: Removes trailing spaces and tabs and the end of lines
ja: 末尾のスペースやタブ、行末を削除します。
ru: Удаляет конечные пробелы и вкладки и конец строк
zh_cn: 删除尾部空格和制表符并结束行

source: Replace tabs with spaces
ja: タブをスペースで置き換える
ru: Заменить вкладки пробелами
zh_cn: 用空格替换标签

source: Replaces all tabs in document with spaces
ja: ドキュメント内のすべてのタブを空白に置き換えます。
ru: Заменяет все вкладки в документе пробелами
zh_cn: 用空格替换文档中的所有选项卡

source: <b>Saving files</b>
ja: <b>ファイルを保存する</ b>
ru: <b> Сохранение файлов </ b>
zh_cn: <b>保存文件</ b>

source: Recent files list length:
ja: 最近のファイルリストの長さ：
ru: Длина списка последних файлов:
zh_cn: 最近的文件列表长度：

source: Specifies the number of files which are stored in the Recent files list
ja: 最近のファイルリストに保存されているファイルの数を指定します。
ru: Указывает количество файлов, которые хранятся в списке последних файлов
zh_cn: 指定存储在“最近的文件”列表中的文件数量

source: Disk check timeout:
ja: ディスクチェックタイムアウト：
ru: Тайм-аут проверки диска:
zh_cn: 磁盘检查超时：

source: How often to check for changes to document files on disk, in seconds. Zero disables checking.
ja: ディスク上のドキュメントファイルの変更を確認する頻度（秒単位）。ゼロはチェックを無効にします。
ru: Как часто проверять изменения файлов документов на диске за считанные секунды. Zero отключает проверку.
zh_cn: 几秒钟内检查磁盘上文档文件更改的频率。零禁用检查。

source: Files
ja: ファイル
ru: файлы
zh_cn: 档

source: Base directory of all files that make up the project. This can be a new path, or an existing directory tree. Must be an absolute path.
ja: プロジェクトを構成するすべてのファイルのベースディレクトリ。これは、新しいパスまたは既存のディレクトリツリーにすることができます。絶対パスでなければなりません。
ru: Базовый каталог всех файлов, составляющих проект. Это может быть новый путь или существующее дерево каталогов. Должен быть абсолютный путь.
zh_cn: 组成项目的所有文件的基本目录。这可以是新的路径，也可以是现有的目录树。必须是绝对路径。

source: Path To Compiler:
ja: コンパイラへのパス：
ru: Путь к компилятору:
zh_cn: 编译器的路径：

source: <b>Build Options</b>
ja: <b>ビルドオプション</ b>
ru: <b> Параметры сборки </ b>
zh_cn: <b>构建选项</ b>

source: Broadcast Port:
ja: ブロードキャストポート：
ru: Порт трансляции:
zh_cn: 广播端口：

source: (Default: 5689) (Currently has no affect)
ja: （デフォルト：5689）（現在は影響ありません）
ru: (По умолчанию: 5689) (В настоящее время не влияет)
zh_cn: （默认：5689）（目前没有影响）

source: Device IP Address:
ja: デバイスのIPアドレス：
ru: IP-адрес устройства:
zh_cn: 设备IP地址：

source: Use Steam Integration:
ja: スチームインテグレーションを使用する：
ru: Использование интеграции Steam:
zh_cn: 使用Steam集成：

source: If checked then the Steam overlay will be active when testing apps with the IDE. Only applies if using the Steam version of AGK, currently Windows only.
ja: オンにすると、IDEでアプリケーションをテストするときにSteamオーバーレイがアクティブになります。 Steam版のAGKを使用している場合のみ適用されます。現在はWindowsのみです。
ru: Если этот флажок установлен, то при тестировании приложений с помощью среды ID будет активным наложение Steam. Действует только при использовании версии Steam AGK, в настоящее время только для Windows.
zh_cn: 如果选中，则在使用IDE测试应用程序时，Steam叠加层将处于活动状态。仅适用于使用Steam版本的AGK，仅适用于Windows。
