Repository: Dark-Basic-Software-Limited/AGKClassic
Catalog: AGK/IDE/Geany-1.24.1/po/*.po
Languages: ja, ru, zh_cn

source: This will build an IPA from your media and bytecode that will run on any iOS device running iOS 7 or greater. You must have the correct distribution certificate and corresponding private key in your keychain for the provisioning profile you are using. It can also be used to produce an IPA suitable for the uploading if you use an AppStore provisioning profile, you will need to install Application Loader, or install XCode and use its Application Loader, to submit the actual IPA to iTunes Connect. Note that only AdHoc and App Store provisioning profiles will work with this exporter.
ja: これにより、iOS 7以上のiOSデバイスで実行されるメディアとバイトコードからIPAが構築されます。使用しているプロビジョニングプロファイルのキーチェーンに、正しい配布証明書と対応する秘密鍵が必要です。また、AppStoreプロビジョニングプロファイルを使用する場合はアップロードに適したIPAを作成するために使用できます。実際にIPAをiTunes Connectに送信するには、Application Loaderをインストールするか、XCodeをインストールしApplication Loaderを使用する必要があります。 AdHocとApp Storeのプロビジョニングプロファイルのみがこのエクスポータで動作することに注意してください。
ru: Это создаст IPA с вашего носителя и байт-код, который будет работать на любом устройстве iOS под управлением iOS 7 или выше. У вас должен быть правильный сертификат распространения и соответствующий закрытый ключ в вашей цепочке ключей для профиля обеспечения, который вы используете. Он также может использоваться для создания IPA, подходящего для загрузки, если вы используете профиль подготовки AppStore, вам нужно будет установить Application Loader или установить XCode и использовать его Application Loader для отправки фактического IPA в iTunes Connect. Обратите внимание, что с этим экспортером будут работать только профили подготовки AdHoc и App Store.
zh_cn: 这将从您的媒体和字节码中构建一个IPA，并可在运行iOS 7或更高版本的任何iOS设备上运行。您必须在您使用的供应配置文件的钥匙串中拥有正确的分配证书和相应的私钥。如果您使用AppStore供应配置文件，它也可用于生成适合上传的IPA，您需要安装Application Loader或安装XCode并使用其应用程序加载器将实际的IPA提交给iTunes Connect。 请注意，只有AdHoc和App Store供应配置文件才能与此导出器配合使用。

source: Facebook App ID:
ru: Facebook ID приложения:
zh_cn: Facebook应用程序ID：

source: Provisioning Profile:
ja: プロビジョニングプロファイル：
ru: Профиль профилирования:
zh_cn: 配置文件：

source: Provisioning profile downloaded from your Apple developer account containing the list of devices this build will work on (or the App Store)
ja: このビルドが動作するデバイス（またはApp Store）のリストを含むApple開発者アカウントからダウンロードしたプロビジョニングプロファイル。
ru: Профиль профилирования, загруженный с вашего аккаунта разработчика Apple, содержащий список устройств, в которых эта сборка будет работать (или в App Store)
zh_cn: 从您的Apple开发人员帐户下载的配置文件包含此版本将使用的设备列表（或App Store）

source: Sets the initial orientation when your app starts. To limit the device orientation you must use SetOrientationAllowed() in your code
ja: アプリの起動時の初期の向きを設定します。デバイスの向きを制限するには、コードでSetOrientationAllowed（）を使用する必要があります
ru: Устанавливает начальную ориентацию при запуске приложения. Чтобы ограничить ориентацию устройства, вы должны использовать SetOrientationAllowed () в своем коде
zh_cn: 设置应用启动时的初始方向。要限制设备方向，您必须在代码中使用SetOrientationAllowed（）

source: Both
ja: どちらも
ru: И то и другое
zh_cn: 都

source: Must be at least 1024x1024 pixels, PNG only, can contain transparency
ja: 少なくとも1024x1024ピクセル（PNGのみ）で透過性を含めることができます
ru: Должно быть не менее 1024x1024 пикселей, только PNG, может содержать прозрачность
zh_cn: 至少必须是1024x1024像素，仅限PNG，可以包含透明度

source: 0-9 and . only, this must match the version number you use in iTunes Connect
ja: 0-9と。これは、iTunes Connectで使用しているバージョン番号と一致する必要があります
ru: 0-9 и. только это должно соответствовать номеру версии, который вы используете в iTunes Connect
zh_cn: 0-9和。只有这些必须与您在iTunes Connect中使用的版本号相匹配

source: (optional) if you use the Facebook commands you must put the Facebook App ID here
ja: （オプション）Facebookコマンドを使用する場合は、FacebookのApp IDをここに入力する必要があります
ru: (необязательно), если вы используете команды Facebook, вы должны разместить здесь идентификатор Facebook
zh_cn: （可选）如果您使用Facebook命令，则必须在此放置Facebook应用程序ID

source: Build Number:
ja: ビルド番号：
ru: Номер сборки:
zh_cn: 内部编号：

source: 0-9 and . only
ja: 0-9と。のみ
ru: 0-9 и. только
zh_cn: 0-9和。只要

source: Device Type:
ja: デバイスタイプ：
ru: Тип устройства:
zh_cn: 设备类型：

source: Choose what type of devices will be able to see this app on the AppStore
ja: AppStoreでこのアプリを見ることができるデバイスのタイプを選択する
ru: Выберите тип устройств, которые смогут увидеть это приложение в AppStore.
zh_cn: 选择哪种类型的设备将能够在AppStore上看到这个应用程序

source: iPhone and iPad
ja: iPhoneとiPad
ru: iPhone и iPad
zh_cn: iPhone和iPad

source: iPhone Only
ja: iPhone専用
ru: Только iPhone
zh_cn: 仅限iPhone

source: iPad Only
ja: iPad専用
ru: Только iPad
zh_cn: 仅限iPad

source: Splash Screen (640x960):
ja: スプラッシュスクリーン（640x960）：
ru: Экран заставки (640x960):
zh_cn: 启动画面（640x960）：

source: Splash Screen (640x1136):
ja: スプラッシュスクリーン（640x1136）：
ru: Экран заставки (640x1136):
zh_cn: 启动画面（640x1136）：

source: Splash Screen (1125x2436):
ja: スプラッシュ画面（1125x2436）：
ru: Экран заставки (1125x2436):
zh_cn: 启动画面（1125x2436）：

source: Displayed whilst your app is launching on iPhone 4 and below, should be at least 640x960. Landscape splash screens should be rotated 90 degrees clockwise so the bottom of the image is to the left
ja: あなたのアプリがiPhone 4以降で起動している間に表示される、少なくとも640x960である必要があります。風景のスプラッシュ画面は時計回りに90度回転して、画像の下端が左になるようにしてください
ru: Отображается, пока ваше приложение запускается на iPhone 4 и ниже, должно быть не менее 640x960. Пейзажные заставки должны быть повернуты на 90 градусов по часовой стрелке, так что нижняя часть изображения находится слева
zh_cn: 当您的应用在iPhone 4及更低版本上启动时显示，应至少为640x960。景观启动画面应顺时针旋转90度，以便图像的底部位于左侧

source: (Optional) Displayed whilst your app is launching on iPhone 5 and above, should be at least 640x1136. Landscape splash screens should be rotated 90 degrees clockwise so the bottom of the image is to the left
ja: （オプション）あなたのアプリがiPhone 5以上で起動している間に表示される、少なくとも640x1136である必要があります。風景のスプラッシュ画面は時計回りに90度回転して、画像の下端が左になるようにしてください
ru: (Необязательно) Отображается, пока ваше приложение запускается на iPhone 5 и выше, должно быть не менее 640x1136. Пейзажные заставки должны быть повернуты на 90 градусов по часовой стрелке, так что нижняя часть изображения находится слева
zh_cn: （可选）当您的应用在iPhone 5及更高版本上启动时显示，应至少为640x1136。景观启动画面应顺时针旋转90度，以便图像的底部位于左侧

source: (Optional) Displayed whilst your app is launching on iPad, should be at least 1536x2048. Landscape splash screens should be rotated 90 degrees clockwise so the bottom of the image is to the left
ja: （オプション）アプリがiPadで起動している間に表示される、少なくとも1536x2048である必要があります。風景のスプラッシュ画面は時計回りに90度回転して、画像の下端が左になるようにしてください
ru: (Необязательно) Отображается, пока ваше приложение запускается на iPad, должно быть не менее 1536x2048. Пейзажные заставки должны быть повернуты на 90 градусов по часовой стрелке, так что нижняя часть изображения находится слева
zh_cn: （可选）当您的应用在iPad上启动时显示，应至少为1536x2048。景观启动画面应顺时针旋转90度，以便图像的底部位于左侧

source: Uses Adverts or Facebook Install Tracking:
ja: 広告やFacebookを使用する トラッキングをインストールする：
ru: Использует рекламу или Facebook Установить отслеживание:
zh_cn: 使用广告或Facebook 安装跟踪：

source: Tick this box if your app uses the AdMob, Amazon Ads, or Chartboost commands, or the Facebook install tracking command. This will include the Advertising Identifier (IDFA) in your exported app. If you only use the Facebook comands but NOT the Facebook install tracking then you should not tick this box
ja: アプリでAdMob、Amazon Ads、またはChartboostコマンド、またはFacebookインストールトラッキングコマンドを使用している場合は、このチェックボックスをオンにします。これには、エクスポートされたアプリに広告ID（IDFA）が含まれます。あなたがFacebookのcomandsを使うだけで、Facebookのインストールの追跡はしないなら、このボックスにチェックを入れてはいけません
ru: Отметьте этот флажок, если ваше приложение использует команды AdMob, Amazon Ads или Chartboost или команду отслеживания установки Facebook. Это будет включать в себя идентификатор рекламы (IDFA) в экспортированном приложении. Если вы используете только комманды Facebook, но НЕ устанавливаете отслеживание Facebook, тогда вы не должны указывать этот флажок
zh_cn: 如果您的应用使用AdMob，Amazon Ads或Chartboost命令或Facebook安装跟踪命令，请勾选此框。这将包括您的导出应用中的广告标识符（IDFA）。如果你只使用Facebook的命令，但不是Facebook的安装跟踪，那么你不应该勾选这个框

source: Firebase Config File (.plist):
ja: Firebase設定ファイル（.plist）：
ru: Файл конфигурации Firebase (.plist):
zh_cn: Firebase配置文件（.plist）：

source: (Optional) The GoogleService-Info.plist file you downloaded when setting up your Firebase project, this is different for every app.
ja: （オプション）Firebaseプロジェクトの設定時にダウンロードしたGoogleService-Info.plistファイルです。これはアプリごとに異なります。
ru: (Необязательно) Файл GoogleService-Info.plist, загруженный при настройке проекта Firebase, для каждого приложения отличается.
zh_cn: （可选）设置Firebase项目时下载的GoogleService-Info.plist文件，每个应用程序都有所不同。

source: Splash Screen (1536x2048):
ja: スプラッシュ画面（1536x2048）：
ru: Экран заставки (1536x2048):
zh_cn: 闪屏（1536x2048）：

source: (Optional) Displayed whilst your app is launching on iPhone X, should be at least 1125x2436. Landscape splash screens should be rotated 90 degrees clockwise so the bottom of the image is to the left
ja: （オプション）あなたのアプリがiPhone Xで起動している間に表示される、少なくとも1125x2436である必要があります。風景のスプラッシュ画面は時計回りに90度回転して、画像の下端が左になるようにしてください
ru: (Необязательно) Отображается, пока ваше приложение запускается на iPhone X, должно быть не менее 1125x2436. Пейзажные заставки должны быть повернуты на 90 градусов по часовой стрелке, так что нижняя часть изображения находится слева
zh_cn: （可选）当您的应用在iPhone X上启动时显示，应至少为1125x2436。景观启动画面应顺时针旋转90度，以便图像的底部位于左侧

source: Generate
ja: 生成する
ru: генерировать
zh_cn: 生成

source: A keystore is a container file for a private key that is used to sign your app so that it can be submitted to the Google Play or Amazon store. If you are distributing outside either of these app stores, or you just want to test on your device, then you do not need this. Once you have submitted your signed app, all updates to it must be signed with the same keystore. Keystores are protected with a password, if you lose your keystore file or forget its password then <b>you will not be able to submit updates to any apps that were signed with it</b>. Each of your apps could use a separate keystore, but for simplicity it is easier to have a single keystore for all your apps. For those of you that want to use this keystore with other programs the alias name will be "mykeystore" and the alias password will be the same as the one you type below. To generate a keystore file you need to submit some information about you or your company that will tell people who signed it. You may leave these blank (except the password) but anyone inspecting the key used to sign an app may be less likely to trust it if all the fields are blank.
ja: キーストアは、Google PlayストアまたはAmazonストアに送信できるようにアプリに署名するために使用される秘密キーのコンテナファイルです。これらのApp Storeの外に配布している場合、またはあなたのデバイスでテストしたいだけの場合は、この必要はありません。 署名付きアプリを提出したら、すべての更新プログラムに同じキーストアで署名する必要があります。キーストアファイルを紛失した場合やパスワードを忘れた場合は、<b>署名済みのアプリに更新を送信できません</ b>。キーストアはパスワードで保護されます。 それぞれのアプリは別々のキーストアを使用できますが、簡単にするためにすべてのアプリに対して単一のキーストアを使用する方が簡単です。他のプログラムでこのキーストアを使いたいと思う人のために、エイリアス名は "mykeystore"になり、エイリアスパスワードはあなたが入力したものと同じになります。 キーストアファイルを生成するには、署名した人に通知するあなたまたは会社に関する情報を提出する必要があります。これらは空白のままにしておくことができます（パスワードは除く）が、すべてのフィールドが空白の場合は、アプリに署名するために使用されたキーを検査する人はそれを信頼しない可能性があります。
ru: Хранилище ключей - это файл контейнера для закрытого ключа, который используется для подписи вашего приложения, чтобы его можно было отправить в магазин Google Play или Amazon. Если вы распространяете данные из любой из этих магазинов приложений или просто хотите протестировать на своем устройстве, вам это не нужно. После того, как вы отправили подписанное приложение, все обновления к нему должны быть подписаны с тем же хранилищем ключей. Keystores защищены паролем, если вы потеряете файл хранилища ключей или забыли его пароль, тогда <b> вы не сможете отправлять обновления в любые приложения, которые были подписаны с ним </ b>. Каждое из ваших приложений может использовать отдельное хранилище ключей, но для простоты проще иметь одно хранилище ключей для всех ваших приложений. Для тех из вас, кто хочет использовать это хранилище ключей с другими программами, псевдоним будет «mykeystore», а пароль псевдонима будет таким же, как тот, который вы наберете ниже. Чтобы создать файл хранилища ключей, вам необходимо предоставить некоторую информацию о вас или вашей компании, которая сообщит тем, кто ее подписал. Вы можете оставить эти пробелы (кроме пароля), но любой, кто проверяет ключ, используемый для подписи приложения, может с меньшей вероятностью доверять ему, если все поля пустые.
zh_cn: 密钥库是私钥的容器文件，用于签署您的应用，以便将其提交给Google Play或Amazon商店。如果您在这些应用程序商店之外进行分发，或者您只想在设备上进行测试，那么您不需要这些。 提交已签名的应用程序后，必须使用相同的密钥库对其所有更新进行签名。密钥库受密码保护，如果您丢失了密钥库文件或忘记密码，那么<b>您将无法将更新提交给任何已使用它签名的应用程序</ b>。 您的每个应用程序都可以使用单独的密钥库，但为了简单起见，为所有应用程序提供单个密钥库会更容易。对于那些想在其他程序中使用此密钥库的人，别名将为“mykeystore”，别名密码将与您在下面输入的密码相同。 要生成密钥库文件，您需要提交一些关于您或您的公司的信息，以告诉签名人。你可以留下这些空白（密码除外），但任何检查用于签名应用的密钥的人都可能不太可能相信它，如果所有的字段都是空白的。

source: Your Full Name:
ja: あなたのフルネーム：
ru: Ваше полное имя:
zh_cn: 你的全名：

source: Re-enter Password:
ja: パスワード再入力：
ru: Повторно введите пароль:
zh_cn: 重新输入密码：

source: A-Z and spaces only
ja: A-Zとスペースのみ
ru: A-Z и только пробелы
zh_cn: 只有A-Z和空格

source: City:
ja: シティ：
ru: Город:
zh_cn: 市：

source: Two Letter Country Code:
ja: 2文字の国コード：
ru: Код страны с двумя буквами:
zh_cn: 双字母国家代码：

source: Company Name:
ja: 会社名：
ru: Название компании:
zh_cn: 公司名：

source: Create a Password:
ja: パスワードを作成：
ru: Создайте пароль:
zh_cn: 创建一个密码：

source: A-Z only
ja: A-Zのみ
ru: Только A-Z
zh_cn: 仅限A-Z

source: <b>Keystore Details</b>
ja: <b>キーストアの詳細</ b>
ru: <b> Детали хранилища </ b>
zh_cn: <b>密钥库详情</ b>

source: The location to save the keystore file
ja: キーストアファイルを保存する場所
ru: Место для сохранения файла хранилища ключей
zh_cn: 保存密钥库文件的位置

source: Left
ja: 左
ru: Оставил
zh_cn: 剩下

source: Right
ja: 右
ru: Правильно
zh_cn: 对

source: Top
ja: 上
ru: верхний
zh_cn: 最佳

source: Bottom
ja: ボトム
ru: Дно
zh_cn: 底部

source: Preferences
ja: 設定
ru: предпочтения
zh_cn: 优先

source: Load virtual terminal support
ja: 仮想端末のサポートをロードする
ru: Загрузка поддержки виртуального терминала
zh_cn: 加载虚拟终端支持

source: Enable plugin support
ja: プラグインのサポートを有効にする
ru: Включить поддержку плагинов
zh_cn: 启用插件支持

source: Remember open projects
ja: オープンプロジェクトを覚えて
ru: Помните открытые проекты
zh_cn: 记住打开的项目

source: When active, any projects that were open when the IDE was closed will be reopened when the IDE is restarted
ja: アクティブにすると、IDEが閉じられたときに開いていたプロジェクトは、IDEの再起動時に再び開きます
ru: Когда активен, любые проекты, которые были открыты при закрытии IDE, будут снова открываться при повторном запуске IDE
zh_cn: 处于活动状态时，IDE关闭时打开的任何项目将在重新启动IDE时重新打开

source: <b>Startup</b>
ja: <b>スタートアップ</ b>
ru: <Б> Запуск </ B>
zh_cn: <B>启动</ b>的

source: Save window position and geometry
ja: ウィンドウの位置と形状を保存する
ru: Сохранить положение окна и геометрию
zh_cn: 保存窗口位置和几何图形

source: Saves the window position and geometry and restores it at the start
ja: ウィンドウの位置とジオメトリを保存し、開始時に復元します。
ru: Сохраняет положение окна и геометрию и восстанавливает его в начале
zh_cn: 保存窗口位置和几何图形并在开始时恢复它

source: Confirm exit
ja: 出口を確認する
ru: Подтвердить выход
zh_cn: 确认退出

source: Shows a confirmation dialog on exit
ja: 終了時に確認ダイアログを表示します。
ru: Показывает окно подтверждения при выходе
zh_cn: 退出时显示确认对话框

source: <b>Shutdown</b>
ja: <b>シャットダウン</ b>
ru: <Б> Выключение </ B>
zh_cn: <B>关闭</ b>的

source: Startup path:
ja: スタートアップパス：
ru: Путь запуска:
zh_cn: 启动路径：

source: Path to start in when opening or saving files. Must be an absolute path.
ja: ファイルを開くときや保存するときに始まるパス。絶対パスでなければなりません。
ru: Путь к началу при открытии или сохранении файлов. Должен быть абсолютный путь.
zh_cn: 打开或保存文件时开始的路径。必须是绝对路径。

source: Project files:
ja: プロジェクトファイル：
ru: Файлы проекта:
zh_cn: 项目文件：

source: Path to start in when opening project files
ja: プロジェクトファイルを開くときに開始するパス
ru: Путь к началу при открытии файлов проекта
zh_cn: 打开项目文件时开始的路径

source: Extra plugin path:
ja: 余分なプラグインのパス：
ru: Дополнительный путь к плагину:
zh_cn: 额外的插件路径：

source: Geany looks by default in the global installation path and in the configuration directory. The path entered here will be searched additionally for plugins. Leave blank to disable.
ja: Geanyはデフォルトでグローバルインストールパスと設定ディレクトリにあります。ここに入力されたパスには、プラグインが追加検索されます。空白のままにすると無効になります。
ru: Geany выглядит по умолчанию в глобальном пути установки и в каталоге конфигурации. Путь, введенный здесь, будет искать дополнительно для плагинов. Оставьте пустым для отключения.
zh_cn: Geany默认在全局安装路径和配置目录中查找。此处输入的路径将被额外搜索插件。留空以禁用。

source: <b>Paths</b>
ja: <b>パス</ b>
ru: <Б> Дорожки </ B>
zh_cn: <B>路径</ b>的

source: Startup
ja: 起動
ru: Запускать
zh_cn: 启动

source: Beep on errors or when compilation has finished
ja: エラー時またはコンパイルが終了したらビープ音を鳴らす
ru: Звуковой сигнал при ошибках или когда компиляция завершена
zh_cn: 在错误或编译完成时发出哔声

source: Whether to beep if an error occurred or when the compilation process has finished
ja: エラーが発生したときにビープ音を鳴らすか、コンパイルプロセスが終了したか
ru: Должен ли звуковой сигнал, произошла ли ошибка или когда процесс компиляции завершен
zh_cn: 是否在发生错误或编译过程结束时发出哔声

source: Switch to status message list at new message
ja: 新しいメッセージでステータスメッセージリストに切り替えます
ru: Переключиться на список сообщений о состоянии в новом сообщении
zh_cn: 以新消息切换到状态消息列表

source: Switch to the status message tab (in the notebook window at the bottom) if a new status message arrives
ja: 新しいステータスメッセージが届いたら、ステータスメッセージタブ（ノートブックウィンドウの下部にある）に切り替えます。
ru: Перейдите на вкладку сообщений о состоянии (в окне ноутбука внизу), если появится новое сообщение о состоянии
zh_cn: 如果有新的状态消息到达，则切换到状态消息选项卡（位于底部的笔记本窗口中）

source: Suppress status messages in the status bar
ja: ステータスバーのステータスメッセージを表示しない
ru: Подавлять сообщения о состоянии в строке состояния
zh_cn: 取消状态栏中的状态消息

source: Removes all messages from the status bar. The messages are still displayed in the status messages window.
ja: ステータスバーからすべてのメッセージを削除します。メッセージはステータスメッセージウィンドウに表示されたままです。
ru: Удаляет все сообщения из строки состояния. Сообщения все еще отображаются в окне сообщений о состоянии.
zh_cn: 删除状态栏中的所有消息。消息仍显示在状态消息窗口中。

source: Auto-focus widgets (focus follows mouse)
ja: 自動フォーカスウィジェット（フォーカスはマウスの後に表示されます）
ru: Виджеты автоматической фокусировки (фокус следует за мышью)
zh_cn: 自动对焦小部件（重点关注鼠标）

source: Gives the focus automatically to widgets below the mouse cursor. Works for the main editor widget, the scribble, the toolbar search and goto line fields and the VTE.
ja: マウスカーソルの下のウィジェットにフォーカスを自動的に与えます。メインエディタウィジェット、落書き、ツールバーの検索とGoto行フィールド、VTEに対応しています。
ru: Автоматически выделяет фокус для виджетов под курсором мыши. Работает для главного редактора виджета, каракули, поиска на панели инструментов и полей линии goto и VTE.
zh_cn: 将焦点自动提供给鼠标光标下方的小部件。适用于主编部件，涂鸦，工具栏搜索和goto行字段以及VTE。

source: Use Windows native dialogs
ja: Windowsのネイティブダイアログを使用する
ru: Использовать собственные диалоги Windows
zh_cn: 使用Windows本机对话框

source: Defines whether to use the Windows native dialogs or whether to use the GTK default dialogs
ja: Windowsネイティブダイアログを使用するかどうか、またはGTKのデフォルトダイアログを使用するかどうかを定義します
ru: Определяет, следует ли использовать собственные диалоги Windows или использовать диалоги по умолчанию GTK
zh_cn: 定义是使用Windows本机对话框还是使用GTK默认对话框

source: <b>Miscellaneous</b>
ja: <b>その他</ b>
ru: <Б> Разное </ b>
zh_cn: <B>杂</ b>的

source: Always wrap search
ja: 常にラップ検索
ru: Всегда включать поиск
zh_cn: 始终包装搜索

source: Always wrap search around the document
ja: ドキュメントの周囲を常にラップする
ru: Всегда заверните поиск по документу
zh_cn: 始终围绕文档进行搜索

source: Hide the Find dialog
ja: 検索ダイアログを非表示にする
ru: Скрыть диалог поиска
zh_cn: 隐藏查找对话框

source: Hide the Find dialog after clicking Find Next/Previous
ja: [次へ] / [前を検索]をクリックした後に[検索]
ru: Скрыть диалоговое окно «Поиск» после нажатия «Найти следующий / предыдущий»
zh_cn: 单击“查找下一个/上一个”后隐藏查找对话框

source: Use the current word under the cursor for Find dialogs
ja: カーソルの下にある現在の単語を検索ダイアログに使用する
ru: Используйте текущее слово под курсором для диалогов «Найти»
zh_cn: 使用光标下的当前单词查找对话框

source: Use current word under the cursor when opening the Find, Find in Files or Replace dialog and there is no selection
ja: [検索]、[ファイルで検索]または[置換]ダイアログを開くときにカーソルの下にある現在の単語を使用し、選択がない
ru: Используйте текущее слово под курсором при открытии диалогового окна «Найти», «Найти в файлах» или «Заменить», и нет выбора
zh_cn: 打开“查找”，“在文件中查找”或“替换”对话框时，请使用光标下的当前单词并且没有选择

source: Use the current file's directory for Find in Files
ja: 現在のファイルのディレクトリを使用してファイルで検索する
ru: Используйте каталог текущего файла для поиска в файлах
zh_cn: 使用当前文件的目录在文件中查找

source: <b>Search</b>
ja: <b>検索</ b>
ru: <Б> Поиск </ b>
zh_cn: <b>搜索</ b>的

source: Miscellaneous
ja: 雑
ru: Разное
zh_cn: 杂

source: General
ja: 一般
ru: Генеральная
zh_cn: 一般

source: Show symbol list
ja: シンボルリストを表示する
ru: Показать список символов
zh_cn: 显示符号列表

source: Toggle the symbol list on and off
ja: シンボルリストのオンとオフを切り替えます
ru: Включение и выключение списка символов
zh_cn: 打开和关闭符号列表

source: Show documents list
ja: ドキュメントリストを表示する
ru: Показать список документов
zh_cn: 显示文件列表

source: Toggle the documents list on and off
ja: ドキュメントリストのオン/オフを切り替える
ru: Включение и выключение списка документов
zh_cn: 打开和关闭文档列表

source: Show sidebar
ja: サイドバーを表示
ru: Показать боковую панель
zh_cn: 显示侧边栏

source: Position:
ja: ポジション：
ru: Должность:
zh_cn: 位置：

source: <b>Sidebar</b>
ja: <b>サイドバー</ b>
ru: <Б> Боковая панель </ B>
zh_cn: <B>边栏</ b>的

source: Auto hide message window
ja: 自動メッセージウィンドウを隠す
ru: Автоматическое скрытие окна сообщений
zh_cn: 自动隐藏消息窗口

source: <b>Message window</b>
ja: <b>メッセージウィンドウ</ b>
ru: <b> Окно сообщений </ b>
zh_cn: <b>留言窗口</ b>

source: Symbol list:
ja: シンボルリスト：
ru: Список символов:
zh_cn: 符号列表：

source: Message window:
ja: メッセージウィンドウ：
ru: Окно сообщений:
zh_cn: 消息窗口：

source: Editor:
ja: 編集者：
ru: Редактор:
zh_cn: 编辑：

source: Sets the font for the message window
ja: メッセージウィンドウのフォントを設定します。
ru: Устанавливает шрифт для окна сообщения
zh_cn: 设置消息窗口的字体

source: Sets the font for the symbol list
ja: シンボルリストのフォントを設定します。
ru: Устанавливает шрифт для списка символов
zh_cn: 设置符号列表的字体

source: Sets the editor font
ja: エディタフォントを設定します。
ru: Устанавливает шрифт редактора
zh_cn: 设置编辑器字体

source: <b>Fonts</b>
ja: <b>フォント</ b>
ru: <Б> Шрифты </ b>
zh_cn: <B>字体</ b>的

source: Show status bar
ja: ステータスバーを表示
ru: Показать строку состояния
zh_cn: 显示状态栏

source: Whether to show the status bar at the bottom of the main window
ja: メインウィンドウの下部にステータスバーを表示するかどうか
ru: Показывать ли строку состояния в нижней части главного окна
zh_cn: 是否在主窗口底部显示状态栏

source: Interface
ja: インタフェース
ru: Интерфейс
zh_cn: 接口

source: Show editor tabs
ja: エディタタブを表示
ru: Показать вкладки редактора
zh_cn: 显示编辑器标签

source: Show close buttons
ja: 閉じるボタンを表示
ru: Показать кнопки закрытия
zh_cn: 显示关闭按钮

source: Shows a small cross button in the file tabs to easily close files when clicking on it (requires restart of Geany)
ja: ファイルタブに小さな十字ボタンが表示され、ファイルをクリックすると簡単に閉じることができます（Geanyを再起動する必要があります）
ru: Показывает небольшую кросс-кнопку на вкладках файлов, чтобы легко закрыть файлы при нажатии на нее (требуется перезапуск Geany)
zh_cn: 在文件标签中显示一个小十字按钮，在点击它时可轻松关闭文件（需要重新启动Geany）

source: Placement of new file tabs:
ja: 新しいファイルタブの配置：
ru: Размещение новых вкладок файлов:
zh_cn: 新文件标签的放置：

source: File tabs will be placed on the left of the notebook
ja: ファイルタブはノートブックの左側に配置されます
ru: Вкладки слева от ноутбука будут помещены в закладки
zh_cn: 文件标签将被放置在笔记本的左侧

source: File tabs will be placed on the right of the notebook
ja: ファイルタブはノートブックの右側に配置されます
ru: Справа от ноутбука будут помещены вкладки для файлов.
zh_cn: 文件标签将被放置在笔记本的右侧

source: Next to current
ja: 現在の次の
ru: Рядом с текущим
zh_cn: 在当前旁边

source: Whether to place file tabs next to the current tab rather than at the edges of the notebook
ja: ノートブックの端ではなく現在のタブの横にファイルタブを配置するかどうか
ru: Не добавлять ли вкладки файлов рядом с текущей вкладкой, а не по краям ноутбука
zh_cn: 是否将文件选项卡放置在当前选项卡旁边而非笔记本边缘

source: Double-clicking hides all additional widgets
ja: ダブルクリックすると、すべてのウィジェットが非表示になります
ru: Двойной щелчок скрывает все дополнительные виджеты
zh_cn: 双击隐藏所有其他小部件

source: Calls the View->Toggle All Additional Widgets command
ja: 表示 - >すべての追加のウィジェットの切り替えコマンドを呼び出します
ru: Вызывает команду View-> Toggle All Additional Widgets
zh_cn: 调用视图 - >切换所有其他小部件命令
