Repository: Dark-Basic-Software-Limited/AGKClassic
Catalog: AGK/IDE/Geany-1.24.1/po/*.po
Languages: ja, ru, zh_cn

source: Export Android APK
ja: Android APKをエクスポートする
ru: Экспорт Android APK
zh_cn: 导出Android APK

source: Export
ja: 輸出する
ru: экспорт
zh_cn: 出口

source: This will build an APK from your media and bytecode that will run on any Android device running 4.0.3 or above. It can also be used to produce an APK suitable for the Google Play, Amazon, or Ouya store if you also provide a keystore file for signing. If you don't yet have a keystore file you can generate one from the Tools menu or in Android Studio.
ja: 4.0.3以上のAndroid搭載端末で動作するメディアとバイトコードからAPKを作成します。また、署名用のキーストアファイルを提供する場合は、Google Play、Amazon、またはOuyaストアに適したAPKを作成するためにも使用できます。まだキーストアファイルがない場合は、ツールメニューまたはAndroid Studioで生成することができます。
ru: Это создаст APK с вашего медиа и байт-кода, который будет работать на любом Android-устройстве под управлением 4.0.3 или выше. Его также можно использовать для создания APK, подходящего для магазина Google Play, Amazon или Ouya, если вы также предоставляете файл хранилища ключей для подписания. Если у вас еще нет файла хранилища ключей, вы можете создать его в меню «Инструменты» или в Android Studio.
zh_cn: 这将从您的媒体和字节码构建一个APK，该字符码将在运行4.0.3或更高版本的任何Android设备上运行。如果您还提供用于签名的密钥存储文件，则它还可用于生成适用于Google Play，Amazon或Ouya商店的APK。如果您还没有密钥存储文件，您可以从工具菜单或Android Studio中生成一个密钥存储文件。

source: <b>APK Export</b>
ja: <b> APKエクスポート</ b>
ru: <b> Экспорт APK </ b>
zh_cn: APK导出</ b>

source: App Name:
ja: アプリケーション名：
ru: Имя приложения:
zh_cn: 应用名称：

source: Package Name:
ja: パッケージ名：
ru: Имя пакета:
zh_cn: 包裹名字：

source: App Icon:
ja: アプリアイコン：
ru: Значок приложения:
zh_cn: 应用图标：

source: Orientation:
ja: オリエンテーション：
ru: Ориентация:
zh_cn: 方向：

source: A-Z . and underscore only, should be in the format com.mycompany.my_app
ja: A-Z。およびアンダースコアのみは、com.mycompany.my_appの形式にする必要があります
ru: A-Z. и только подчеркивание, должно быть в формате com.mycompany.my_app
zh_cn: A-Z。并仅下划线，应采用格式com.mycompany.my_app

source: should be at least 192x192 pixels, PNG only, can contain transparency
ja: 少なくとも192x192ピクセル、PNGのみ、透過性を含むことができます
ru: должно быть не менее 192x192 пикселей, только PNG, может содержать прозрачность
zh_cn: 应该至少为192x192像素，仅限PNG，可以包含透明度

source: Landscape
ja: 風景
ru: Пейзаж
zh_cn: 景观

source: Portrait
ja: ポートレート
ru: Портрет
zh_cn: 肖像

source: All
ja: すべて
ru: Все
zh_cn: 所有

source: A-Z, 0-9, spaces or underscore allowed
ja: A〜Z、0〜9、空白またはアンダースコア
ru: A-Z, 0-9, пробелы или подчеркивание разрешено
zh_cn: A-Z，0-9，允许有空格或下划线

source: APK Type:
ja: APKタイプ：
ru: APK Тип:
zh_cn: APK类型：

source: Select whether this APK will be used on a Google, Amazon, or Ouya device
ja: このAPKをGoogle、Amazon、またはOuyaデバイスで使用するかどうかを選択します
ru: Выберите, будет ли этот APK использоваться на устройстве Google, Amazon или Ouya
zh_cn: 选择是否将在Google，Amazon或Ouya设备上使用此APK

source: Ouya Large Icon:
ja: Ouya大きなアイコン：
ru: Значок Оуи Большой:
zh_cn: 欧亚大图标：

source: must be 732x412 pixels, PNG only
ja: 732x412ピクセル、PNGのみである必要があります
ru: должно быть 732x412 пикселей, только PNG
zh_cn: 必须是732x412像素，仅限PNG

source: Notification Icon:
ja: 通知アイコン：
ru: Значок уведомлений:
zh_cn: 通知图标：

source: Used in the Android notification bar if you display local or push notifications. Should be at least 96x96, PNG only. It must be all white with the shape defined by the alpha channel
ja: ローカル通知またはプッシュ通知を表示する場合は、Android通知バーで使用されます。少なくとも96x96、PNGのみである必要があります。アルファチャンネルによって定義された形状を持つすべてが白でなければなりません
ru: Используется в панели уведомлений Android, если вы показываете локальные или push-уведомления. Должно быть не менее 96x96, только PNG. Должно быть все белое с формой, определяемой альфа-каналом
zh_cn: 如果您显示本地或推送通知，则在Android通知栏中使用。应该至少为96x96，仅限PNG。它必须全部为白色，并由alpha通道定义形状

source: Minimum Android Version:
ja: 最小Androidバージョン：
ru: Минимальная версия Android:
zh_cn: 最低Android版本：

source: Only applies to Google and Amazon export. For maximum compatibility choose 4.0.3, or restrict your app to chosen minimum version. If you choose 6.0 (API 23) or above then you must use the RequestPermission command to request any required permissions before using certain commands
ja: GoogleとAmazonの輸出にのみ適用されます。互換性を最大限に高めるには、4.0.3を選択するか、アプリを選択した最小バージョンに制限してください。 6.0（API 23）以上を選択した場合、特定のコマンドを使用する前にRequestPermissionコマンドを使用して必要な権限を要求する必要があります
ru: Используется только для экспорта Google и Amazon. Для максимальной совместимости выберите 4.0.3 или ограничьте свое приложение на выбранную минимальную версию. Если вы выберете 6.0 (API 23) или выше, вы должны использовать команду RequestPermission для запроса любых необходимых разрешений перед использованием определенных команд
zh_cn: 仅适用于Google和Amazon导出。为了获得最大的兼容性，请选择4.0.3，或将您的应用限制在所选最低版本。如果选择6.0（API 23）或更高版本，那么在使用某些命令之前，您必须使用RequestPermission命令请求任何必需的权限

source: Sets whether your app uses or requires ARCore to be installed on the user's device. Requiring ARCore will limit your app to Android 7.0 or above
ja: あなたのアプリがユーザーのデバイスにARCoreをインストールするかどうかを設定します。 ARCoreを要求すると、アプリがAndroid 7.0以上に制限されます
ru: Устанавливает, использует ли ваше приложение или требует, чтобы ARCore был установлен на устройстве пользователя. Требование, что ARCore ограничит ваше приложение Android 7.0 или выше
zh_cn: 设置您的应用是否使用或要求在用户设备上安装ARCore。要求ARCore将您的应用限制为Android 7.0或更高版本

source: Not Used
ja: 使用されていない
ru: Не используется
zh_cn: 不曾用过

source: Optional
ja: オプション
ru: Необязательный
zh_cn: 可选的

source: Required
ja: 必須
ru: необходимые
zh_cn: 需要

source: <b>APK Settings</b>
ja: <b> APKの設定</ b>
ru: <b> Настройки APK </ b>
zh_cn: <b> APK设置</ b>

source: Write External Storage
ja: 外部ストレージの書き込み
ru: Запись внешнего хранилища
zh_cn: 写入外部存储

source: Used for camera capture images, shared variables, and "raw:" file access
ja: カメラキャプチャ画像、共有変数、および "raw："ファイルアクセスに使用されます。
ru: Используется для изображений захвата камеры, общих переменных и доступа к файлам «raw:»
zh_cn: 用于相机捕捉图像，共享变量和“raw：”文件访问

source: Precise Location
ja: 正確な場所
ru: Точное местоположение
zh_cn: 精确的位置

source: Used by the GPS commands for exact location
ja: 正確な位置を求めるためにGPSコマンドによって使用される
ru: Используется командами GPS для точного местоположения
zh_cn: 由GPS命令用于精确定位

source: Internet/Network
ja: インターネット/ネットワーク
ru: Интернет / Сеть
zh_cn: 互联网/网络

source: Used for network or internet access
ja: ネットワークまたはインターネットアクセスに使用
ru: Используется для доступа к сети или интернету
zh_cn: 用于网络或互联网访问

source: Wake Lock
ja: ウェイクロック
zh_cn: 唤醒锁

source: Used to prevent the device from sleeping
ja: デバイスがスリープ状態にならないようにするために使用されます。
ru: Используется для предотвращения сна снаружи устройства
zh_cn: 用于防止设备进入睡眠状态

source: Coarse Location
ja: 粗い場所
ru: Грубое местоположение
zh_cn: 粗糙的位置

source: Used by the GPS commands for rough location
ja: 大まかな場所にGPSコマンドで使用される
ru: Используется командами GPS для грубого местоположения
zh_cn: 由GPS命令用于粗略位置

source: In App Purchase
ja: アプリ購入で
ru: Покупки в приложении
zh_cn: 在应用程序内购买

source: Used by the In App Purchase commands
ja: アプリ内購入コマンドで使用されます
ru: Используется командами покупки приложения
zh_cn: 由In App Purchase命令使用

source: Push Notifications
ja: プッシュ通知
ru: Всплывающее уведомление
zh_cn: 推送通知

source: Used by the Push Notification command
ja: プッシュ通知コマンドで使用されます。
ru: Используется командой Push Notification
zh_cn: 推送通知命令使用

source: Expansion Files
ja: 拡張ファイル
ru: Файлы расширения
zh_cn: 扩展文件

source: Adds the Get Accounts and Google Licensing permissions used by the expansion file commands
ja: 拡張ファイルコマンドで使用されるアカウント取得権限とGoogleライセンス権限を追加します
ru: Добавляет разрешения Get Accounts и Google Licensing, используемые командами файла расширения
zh_cn: 添加扩展文件命令使用的获取帐户和Google许可权限

source: Camera
ja: カメラ
ru: камера
zh_cn: 相机

source: Used by the SetDeviceCameraToImage command
ja: SetDeviceCameraToImageコマンドで使用されます。
ru: Используется командой SetDeviceCameraToImage
zh_cn: 由SetDeviceCameraToImage命令使用

source: Vibrate
ja: 振動する
ru: вибрировать
zh_cn: 颤动

source: Used to allow vibration of the device
ja: 装置の振動を許容するために使用される
ru: Используется для вибрации устройства
zh_cn: 用于允许设备的振动

source: Record Audio
ja: レコードオーディオ
ru: Запись аудио
zh_cn: 录制音频

source: Used to allow recording from the microphone when recording the screen
ja: 画面の録音時にマイクからの録音を許可する場合に使用します
ru: Используется для записи с микрофона при записи экрана
zh_cn: 录制屏幕时用于允许从麦克风进行录制

source: <b>Permissions</b>
ja: <b>権限</ b>
ru: <Б> Права доступа </ B>
zh_cn: <B>权限</ b>的

source: Output File Location:
ja: 出力ファイルの場所：
ru: Расположение выходного файла:
zh_cn: 输出文件位置：

source: The location to save the final APK file
ja: 最終的なAPKファイルを保存する場所
ru: Место для сохранения окончательного файла APK
zh_cn: 保存最终APK文件的位置

source: <b>Output</b>
ja: <b>出力</ b>
ru: <B> Выход </ B>
zh_cn: <B>输出</ b>的

source: Google Play Application ID:
ja: Google PlayアプリケーションID：
ru: Идентификатор приложения Google Play:
zh_cn: Google Play应用程序ID：

source: The 12 digit application ID assigned by Google Game Services to your app
ja: Googleゲームサービスからアプリに割り当てられた12桁のアプリケーションID
ru: 12-значный идентификатор приложения, присвоенный Google Play Services для вашего приложения.
zh_cn: 由Google游戏服务分配给您的应用的12位数应用ID

source: GameCircle API Key:
ja: GameCircle APIキー：
ru: Ключ API GameCircle:
zh_cn: GameCircle API密钥：

source: The very long API Key string generated by Amazon in the GameCircle setup process, note that this varies based on what keystore you are using to sign the APK
ja: GameCircleセットアッププロセスでAmazonによって生成された非常に長いAPIキー文字列。これは、APKに署名するために使用しているキーストアによって異なることに注意してください
ru: Очень длинная строка API Key, созданная Amazon в процессе установки GameCircle, обратите внимание, что это зависит от того, какое хранилище ключей вы используете для подписания APK
zh_cn: Amazon在GameCircle设置过程中生成的非常长的API密钥字符串，请注意，这取决于您用于签署APK的密钥库

source: When GameCircle asks for a Signature you can use the following for unsigned apps 77:5F:98:ED:6E:C3:D9:57:4F:EA:63:7A:BB:E7:2D:4C For signed apps you must generate the Signature from your keystore file
ja: GameCircleが署名を要求すると、署名されていないアプリケーションに対して以下を使用できます 77：5F：98：ED：6E：C3：D9：57：4F：EA：63：7A：BB：E7：2D：4C 署名付きアプリケーションの場合は、キーストアファイルから署名を生成する必要があります
ru: Когда GameCircle запрашивает подпись, вы можете использовать следующие для неподписанных приложений 77: 5F: 98: ED: 6E: С3: D9: 57: 4F: ЕА: 63: 7A: BB: Е7: 2D: 4C Для подписанных приложений вы должны сгенерировать подпись из файла хранилища ключей
zh_cn: 当GameCircle要求签名时，您可以对未签名的应用使用以下内容 77：5F：98：ED：6E：C3：D9：57：4F：EA：63：7A：BB：E7：2D：4C 对于已签名的应用程序，您必须从密钥库文件生成签名

source: <b>Google Game Services/GameCircle Integration</b> (optional)
ja: <b> Googleゲームサービス/ GameCircle統合</ b>（オプション）
ru: <b> Интеграция Google Game Services / GameCircle </ b> (необязательно)
zh_cn: <b> Google游戏服务/游戏圈集成</ b>（可选）

source: Firebase Config File (.json):
ja: Firebase設定ファイル（.json）：
ru: Файл конфигурации Firebase (.json):
zh_cn: Firebase配置文件（.json）：

source: The google-services.json file that you downloaded when setting up your Firebase project, this is different for every app.
ja: Firebaseプロジェクトを設定するときにダウンロードしたgoogle-services.jsonファイルは、すべてのアプリで異なります。
ru: Файл google-services.json, который вы загрузили при настройке проекта Firebase, для каждого приложения отличается.
zh_cn: 您在设置Firebase项目时下载的google-services.json文件对于每个应用都是不同的。

source: <b>Firebase Integration</b> (optional)
ja: <b> Firebase Integration </ b>（オプション）
ru: <b> Интеграция Firebase </ b> (необязательно)
zh_cn: <b> Firebase整合</ b>（可选）

source: The following must be filled out if you want an APK suitable for submitting to the Google Play, Amazon, or Ouya store.
ja: APKをGoogle Play、Amazon、またはOuyaストアに送信するのに適したものにしたい場合は、次のように入力する必要があります。
ru: При желании APK подходит для отправки в магазин Google Play, Amazon или Ouya.
zh_cn: 如果您希望APK适合提交到Google Play，Amazon或Ouya商店，则必须填写以下内容。

source: Keystore File:
ja: キーストアファイル：
ru: Файл Keystore:
zh_cn: 密钥库文件：

source: If you don't have this you can generate one from the Tools menu
ja: あなたがこれを持っていない場合、あなたはツールメニューから1つを生成することができます
ru: Если у вас его нет, вы можете сгенерировать его в меню «Сервис»
zh_cn: 如果你没有这个，你可以从工具菜单中生成一个

source: Keystore Password:
ja: キーストアのパスワード：
ru: Пароль Keystore:
zh_cn: 密钥库密码：

source: The password used to create the keystore
ja: キーストアを作成するために使用されるパスワード
ru: Пароль, используемый для создания хранилища ключей
zh_cn: 用于创建密钥库的密码

source: Version Name:
ja: バージョン名：
ru: Название версии:
zh_cn: 版本名称：

source: e.g. 1.0.1
ja: 例えば1.0.1
ru: например 1.0.1
zh_cn: 例如1.0.1

source: Version Number:
ja: バージョンナンバー：
ru: Номер версии:
zh_cn: 版本号：

source: Must be an integer, must be higher than any value already submitted to the store
ja: 整数である必要があります。すでにストアに送信されている値よりも大きい値である必要があります。
ru: Должно быть целое число, должно быть выше любого значения, уже отправленного в хранилище
zh_cn: 必须是整数，必须高于已提交给商店的任何值

source: <b>Advanced</b>: If you are providing a keystore generated by Android Studio please enter the alias name and password used to access it.
ja: <b>高度な</ b>：Android Studioで生成されたキーストアを提供する場合は、アクセスに使用するエイリアス名とパスワードを入力してください。
ru: <b> Дополнительно </ b>. Если вы предоставляете хранилище ключей, созданное Android Studio, введите имя псевдонима и пароль, используемые для доступа к нему.
zh_cn: <b>高级</ b>：如果您要提供由Android Studio生成的密钥库，请输入用于访问该密钥库的别名和密码。

source: Alias:
ja: エイリアス：
zh_cn: 别名：

source: Alias Password:
ja: エイリアスパスワード：
ru: Пароль псевдонима:
zh_cn: 别名密码：

source: The name of the alias used when the keystore file was generated
ja: キーストアファイルが生成されたときに使用されるエイリアスの名前
ru: Имя псевдонима, используемого при создании файла хранилища ключей
zh_cn: 生成密钥库文件时使用的别名的名称

source: The alias password used when the keystore file was generated
ja: キーストアファイルが生成されたときに使用されるエイリアスパスワード
ru: Пароль псевдонима, используемый при создании файла хранилища ключей
zh_cn: 生成密钥库文件时使用的别名密码

source: <b>Signing</b> (optional)
ja: <b>署名</ b>（オプション）
ru: <b> Подписание </ b> (необязательно)
zh_cn: <b>签名</ b>（可选）

source: Exports both Amazon and Google Play APKs for all currently open projects, using the settings contained in their project files
ja: プロジェクトファイルに含まれている設定を使用して、現在開いているすべてのプロジェクトのAmazonおよびGoogle Play APKをエクスポートします。
ru: Экспортирует как Amazon, так и APK для Google Play для всех открытых в настоящее время проектов, используя настройки, содержащиеся в их файлах проектов
zh_cn: 使用其项目文件中包含的设置，为当前所有打开的项目导出亚马逊和Google Play APK

source: Keystore/Alias Password:
ja: キーストア/エイリアスパスワード：
ru: Пароль Keystore / Alias:
zh_cn: 密钥库/别名密码：

source: <b>App Settings</b>
ja: <b>アプリの設定</ b>
ru: <b> Настройки приложения </ b>
zh_cn: <b>应用程式设定</ b>

source: Output Folder:
ja: 出力フォルダ：
ru: Папки вывода:
zh_cn: 导出目录：

source: Cancel
ja: キャンセル
ru: Отмена
zh_cn: 取消

source: This will the HTML5 necessary to host your app on a website. You will need to upload these files somewhere to make your game accessible to others. For the best experience we recommend you use Firefox or Chrome to view the HTML5 app. When testing the files locally, without uploading them to a server, Chrome will not work. When testing on an Android device, Chrome is the best choice as Firefox has trouble when the app goes full screen. iOS devices do not support full screen at all, and tend to have much lower HTML5 performance than other platforms. Note that HTML5 only has partial support for the AGK command set so not all commands will work. In particular the Networking commands HostNetwork and JoinNetwork are not functional in HTML5 apps. Also the file commands will work but are not persistent, so any saved files will be lost when the user closes or reloads the app. File size is very important when hosting apps online, so you should remove any unnecessary files from the project's media folder before exporting.
ja: これは、ウェブサイトでアプリケーションをホストするために必要なHTML5です。他の人がゲームにアクセスできるように、これらのファイルをどこかにアップロードする必要があります。 最高の体験を得るには、FirefoxまたはChromeを使用してHTML5アプリを表示することをおすすめします。ファイルをサーバーにアップロードせずにローカルでテストすると、Chromeは動作しません。 Android搭載端末でテストするとき、ChromeがアプリがフルスクリーンになったときにFirefoxが問題を抱えているため、最良の選択です。 iOSデバイスはフルスクリーンをサポートしておらず、他のプラットフォームよりもHTML5のパフォーマンスがはるかに低い傾向があります。 HTML5はAGKコマンドセットの部分的なサポートしか持たないので、すべてのコマンドが機能するわけではありません。特に、ネットワーキングコマンドHostNetworkとJoinNetworkは、HTML5アプリケーションでは機能しません。また、ファイルコマンドは機能しますが、永続的ではありません。したがって、ユーザーがアプリケーションを閉じるか再読み込みすると、保存されたファイルはすべて失われます。 オンラインでアプリケーションをホスティングするときはファイルサイズが非常に重要なので、エクスポートする前にプロジェクトのメディアフォルダから不要なファイルを削除する必要があります。
ru: Это будет HTML5, необходимый для размещения вашего приложения на веб-сайте. Вам нужно будет загрузить эти файлы где-нибудь, чтобы сделать вашу игру доступной для других. Для лучшего опыта рекомендуем использовать Firefox или Chrome для просмотра приложения HTML5. При локальном тестировании файлов, не загружая их на сервер, Chrome не работает. При тестировании на Android-устройстве Chrome - лучший выбор, так как Firefox имеет проблемы, когда приложение переходит в полноэкранный режим. Устройства iOS полностью не поддерживают полный экран и, как правило, имеют гораздо более низкую производительность HTML5, чем другие платформы. Обратите внимание, что HTML5 имеет частичную поддержку набора команд AGK, поэтому не все команды будут работать. В частности, команды Networking HostNetwork и JoinNetwork не работают в приложениях HTML5. Кроме того, команды файлов будут работать, но не будут сохраняться, поэтому любые сохраненные файлы будут потеряны, когда пользователь закроет или перезагрузит приложение. Размер файла очень важен при размещении приложений в Интернете, поэтому перед экспортом вы должны удалить ненужные файлы из папки мультимедиа проекта.
zh_cn: 这将是在网站上托管您的应用程序所需的HTML5。您需要将这些文件上传到某个地方，以便其他人可以访问您的游戏。 为了获得最佳体验，我们建议您使用Firefox或Chrome查看HTML5应用。在本地测试文件时，如果不将其上传到服务器，Chrome将无法工作。在Android设备上进行测试时，Chrome是最佳选择，因为Firefox在全屏显示时遇到问题。 iOS设备完全不支持全屏，并且往往比其他平台的HTML5性能低得多。 请注意，HTML5只支持AGK命令集，所以不是所有的命令都可以使用。特别是网络命令HostNetwork和JoinNetwork在HTML5应用程序中不起作用。此外，文件命令将工作，但不是持久的，所以当用户关闭或重新加载应用程序时，任何保存的文件都将丢失。 在线托管应用程序时，文件大小非常重要，因此您应该在导出之前从项目的媒体文件夹中删除任何不必要的文件。

source: Commands Used:
ja: 使用されるコマンド：
ru: Используемые команды:
zh_cn: 使用的命令：

source: Selecting 2D Only will reduce the file size which will improve loading times, but all 3D commands will be disabled.
ja: [2Dのみ]を選択するとファイルサイズが小さくなり、ロード時間が短縮されますが、すべての3Dコマンドは無効になります。
ru: Выбор 2D Only уменьшит размер файла, что улучшит время загрузки, но все 3D-команды будут отключены.
zh_cn: 选择2D Only将减小文件大小，这将改善加载时间，但所有3D命令将被禁用。

source: 2D Only
ja: 2Dのみ
ru: Только 2D
zh_cn: 仅限2D

source: 2D and 3D
ja: 2Dと3D
ru: 2D и 3D
zh_cn: 2D和3D

source: Disables some optimizations, but allows your app to use more than 256MB of RAM
ja: いくつかの最適化を無効にしますが、アプリは256MB以上のRAMを使用できます
ru: Отключает некоторые оптимизации, но позволяет вашему приложению использовать более 256 МБ ОЗУ
zh_cn: 禁用某些优化，但允许您的应用使用超过256MB的RAM

source: Dynamic Memory:
ja: ダイナミックメモリ：
ru: Динамическая память:
zh_cn: 动态内存：

source: _Toolbar Preferences
ja: _ツールバー設定
ru: Настройки _Toolbar
zh_cn: _工具栏首选项

source: _Hide Toolbar
ja: _ツールバーを隠す
ru: Панель инструментов _Hide
zh_cn: _隐藏工具栏

source: Go to _Tag Definition
ja: _Tagの定義に移動
ru: Перейти к определению _Tag
zh_cn: 去_Tag定义

source: Find _Usage
ja: _Usageを検索
ru: Найти _Usage
zh_cn: 查找_Usage

source: Open Selected F_ile
ja: 選択したF_ileを開く
ru: Открыть выбранный F_ile
zh_cn: 打开选定的F_ile

source: _Edit
ja: _編集
ru: _Редактировать
zh_cn: _编辑

source: _Format
ja: _フォーマット
ru: _Формат
zh_cn: _格式

source: _Search
ja: _サーチ
ru: _Поиск
zh_cn: _搜索

source: Passes the selected word to the command set in Preferences->Tools
ja: [設定] - > [ツール]で設定したコマンドに選択した単語を渡します。
ru: Пропускает выбранное слово к набору команд в настройках-> Инструменты
zh_cn: 将所选单词传递给在首选项 - >工具中设置的命令

source: Conte_xt Action
ja: Conte_xtアクション
ru: Действие Conte_xt
zh_cn: Conte_xt动作

source: None
ja: なし
ru: Никто
zh_cn: 没有

source: Basic
ja: ベーシック
ru: основной
zh_cn: 基本

source: Current chars
ja: 現在の文字
ru: Текущие символы
zh_cn: 当前字符

source: Match braces
ja: マッチブレース
ru: Скобки
zh_cn: 匹配大括号

source: Install Additional Files
ja: 追加ファイルをインストールする
ru: Установка дополнительных файлов
zh_cn: 安装其他文件

source: AGK comes with a set of example projects for BASIC and a set of native libraries for development with C++. By default these are located in the AGK installation folder but it might be more convenient to store them elsewhere, and in the case of Windows the Program Files directory is not writeable so is not suitable for projects. This dialog will let you copy these additional files to a location of your choice, and optionally keep those locations up to date as the local files are updated. You can close this dialog and come back to it at any time from the Tools->Install Additional Files menu option. You can leave either path blank if you do not want to install these files.
ja: AGKには、BASIC用の一連のサンプルプロジェクトと、C ++による開発用のネイティブライブラリセットが付属しています。デフォルトでは、これらはAGKインストールフォルダにありますが、他の場所に保存する方が便利かもしれません.Windowsの場合、Program Filesディレクトリは書き込み可能ではないため、プロジェクトには適していません。このダイアログでは、これらの追加ファイルを任意の場所にコピーし、ローカルファイルが更新されるとその場所を最新の状態に保つことができます。 このダイアログを閉じて、[ツール] - > [追加ファイルのインストール]メニューオプションからいつでも戻ってくることができます。これらのファイルをインストールしない場合は、いずれかのパスを空白のままにしておくことができます。
ru: AGK поставляется с набором примеров проектов для BASIC и набора собственных библиотек для разработки с C ++. По умолчанию они находятся в папке установки AGK, но было бы удобнее хранить их в другом месте, а в случае Windows каталог Program Files не может быть записан, поэтому он не подходит для проектов. В этом диалоговом окне вы можете скопировать эти дополнительные файлы в выбранное вами местоположение и, при необходимости, обновить эти местоположения по мере обновления локальных файлов. Вы можете закрыть это диалоговое окно и вернуться к нему в любое время в меню «Инструменты -> Установить дополнительные файлы». Вы можете оставить пустой путь, если вы не хотите устанавливать эти файлы.
zh_cn: AGK附带一套BASIC示例项目和一套用C ++开发的本地库。默认情况下，它们位于AGK安装文件夹中，但将它们存储在其他位置可能更方便，而对于Windows，Program Files目录不可写入，因此不适用于项目。通过此对话框，可以将这些附加文件复制到您选择的位置，并随着本地文件的更新而随时更新这些位置。 您可以随时关闭此对话框并随时从Tools-> Install Additional Files菜单选项回到它。如果您不想安装这些文件，可以将这两个路径留空。

source: <b>Additional Files</b>
ja: <b>追加ファイル</ b>
ru: <b> Дополнительные файлы </ b>
zh_cn: <b>其他文件</ b>

source: New Location:
ja: 新しい場所：
ru: Новое место:
zh_cn: 新地点：

source: The location to place the example projects, leave blank to ignore these
ja: サンプルプロジェクトを配置する場所。空白のままにしてこれらのプロジェクトを無視する
ru: Место размещения примеров проектов, оставьте пустым, чтобы игнорировать эти
zh_cn: 放置示例项目的位置留空以忽略这些项目

source: When AGK Updates:
ja: AGK更新時：
ru: Когда обновления AGK:
zh_cn: 当AGK更新：

source: What to do when AGK detects that it has updated since you installed the files
ja: ファイルをインストールしてからAGKがアップデートを検出したときの対処方法
ru: Что делать, когда AGK обнаруживает, что он обновлен с момента установки файлов
zh_cn: 自安装文件后，AGK检测到它已更新时该怎么办

source: Update these files
ja: これらのファイルを更新する
ru: Обновление этих файлов
zh_cn: 更新这些文件

source: Ask me what to do
ja: 何をすべきか教えてください
ru: Спросите меня, что делать
zh_cn: 问我该怎么做

source: Do nothing
ja: 何もしない
ru: Ничего не делать
zh_cn: 没做什么

source: <b>AGK Projects</b>
ja: <b> AGKプロジェクト</ b>
ru: <b> Проекты AGK </ b>
zh_cn: <b> AGK项目</ b>

source: The location to place the c++ libraries, leave blank to ignore these
ja: C ++ライブラリを配置する場所は空白のままにして、これらを無視する
ru: Место для размещения библиотек c ++, оставьте пустым, чтобы игнорировать эти
zh_cn: 放置c ++库的位置，留空以忽略这些

source: <b>C++ Libraries</b>
ja: <b> C ++ライブラリ</ b>
ru: <b> Библиотеки C ++ </ b>
zh_cn: <b> C ++库</ b>

source: Apply
ja: 適用
ru: Подать заявление
zh_cn: 应用

source: Apply settings only, no files will be copied
ja: 設定を適用するだけで、ファイルはコピーされません
ru: Применить настройки только, файлы не будут скопированы
zh_cn: 仅应用设置，不会复制文件

source: Install
ja: インストール
ru: устанавливать
zh_cn: 安装

source: Apply settings and copy the files to the specified locations
ja: 設定を適用し、ファイルを指定された場所にコピーします。
ru: Применить настройки и скопировать файлы в указанные местоположения
zh_cn: 应用设置并将文件复制到指定的位置
