Repository: Dark-Basic-Software-Limited/AGKClassic
Catalog: AGK/IDE/Geany-1.24.1/po/*.po
Languages: ja, ru, zh_cn

source: Enter the IP of a device to broadcast apps directly to it, this is useful if AGK has trouble detecting the device. This can be IPv4 or IPv6
ja: アプリケーションを直接ブロードキャストするデバイスのIPアドレスを入力します。これは、AGKがデバイスを検出できない場合に便利です。 IPv4またはIPv6でもかまいません
ru: Введите IP-адрес устройства для непосредственного вещания приложений, это полезно, если у AGK есть проблемы с обнаружением устройства. Это может быть IPv4 или IPv6
zh_cn: 输入设备的IP以直接向其广播应用程序，如果AGK无法检测到设备，则这很有用。这可以是IPv4或IPv6

source: <b>Broadcast</b>
ja: <b>ブロードキャスト</ b>
ru: <Б> Broadcast </ b>
zh_cn: <B>广播</ b>的

source: Enter the IP of a device to use for debugging, leaving it blank will debug on the local machine. This can be IPv4 or IPv6
ja: デバッグに使用するデバイスのIPを入力します。空のままにすると、ローカルマシンでデバッグされます。 IPv4またはIPv6でもかまいません
ru: Введите IP-адрес устройства, которое будет использоваться для отладки, оставив его пустым, будет отлаживаться на локальном компьютере. Это может быть IPv4 или IPv6
zh_cn: 输入要用于调试的设备的IP，将其留空将在本地计算机上进行调试。这可以是IPv4或IPv6

source: <b>Debug</b>
ja: <b>デバッグ</ b>
ru: <Б> Отладка </ B>
zh_cn: <B>调试</ b>的

source: Build
ja: ビルド
ru: строить
zh_cn: 建立

source: Terminal:
ja: ターミナル：
ru: Терминал:
zh_cn: 终奌站：

source: Browser:
ja: ブラウザ：
ru: Браузер:
zh_cn: 浏览器：

source: A terminal emulator command (%c is substituted with the Geany run script filename)
ja: 端末エミュレータコマンド（％cはGeany実行スクリプトファイル名で置き換えられます）
ru: Команда эмулятора терминала (% c заменяется именем файла сценария Geany)
zh_cn: 终端模拟器命令（％c用Geany运行脚本文件名替换）

source: Path (and possibly additional arguments) to your favorite browser
ja: お気に入りのブラウザへのパス（場合によっては追加引数）
ru: Путь (и, возможно, дополнительные аргументы) в ваш любимый браузер
zh_cn: 路径（可能还有其他参数）到您最喜欢的浏览器

source: Grep:
zh_cn: grep的：

source: <b>Tool paths</b>
ja: <b>ツールパス</ b>
ru: <b> Пути инструментов </ b>
zh_cn: <b>刀具路径</ b>

source: Context action:
ja: コンテキストアクション：
ru: Контекстное действие:
zh_cn: 上下文操作：

source: Context action command. The currently selected word can be used with %s. It can appear anywhere in the given command and will be replaced before execution.
ja: コンテキストアクションコマンド。現在選択されている単語は％sで使用できます。それは与えられたコマンドのどこにでも現れ、実行前に置き換えられます。
ru: Команда контекстного действия. В настоящее время выбранное слово можно использовать с% s. Он может появляться в любой точке данной команды и будет заменен перед выполнением.
zh_cn: 上下文操作命令。当前选择的字可以与％s一起使用。它可以出现在给定的命令中的任何地方，并在执行前被替换。

source: <b>Commands</b>
ja: <b>コマンド</ b>
ru: <Б> Команды </ B>
zh_cn: <B>命令</ b>的

source: Tools
ja: ツール
ru: инструменты
zh_cn: 工具

source: email address of the developer
ja: 開発者の電子メールアドレス
ru: адрес электронной почты разработчика
zh_cn: 开发人员的电子邮件地址

source: Initials of the developer name
ja: 開発者名の頭文字
ru: Инициалы имени разработчика
zh_cn: 开发人员姓名的缩写

source: Initial version:
ja: 最初のバージョン：
ru: Первоначальная версия:
zh_cn: 初始版本：

source: Version number, which a new file initially has
ja: 新しいファイルが最初に持っているバージョン番号
ru: Номер версии, который изначально имеет новый файл
zh_cn: 版本号，新文件最初具有的版本号

source: Company name
ja: 会社名
ru: Название компании
zh_cn: 公司名

source: Developer:
ja: 開発者：
ru: Разработчик:
zh_cn: 开发商：

source: Company:
ja: 会社：
ru: Компания:
zh_cn: 公司：

source: Mail address:
ja: メールアドレス：
ru: Почта Адрес:
zh_cn: 邮件地址：

source: Initials:
ja: イニシャル：
ru: Инициалы:
zh_cn: 缩写：

source: The name of the developer
ja: 開発者の名前
ru: Имя разработчика
zh_cn: 开发者的名字

source: Year:
ja: 年：
ru: Год:
zh_cn: 年：

source: Date:
ja: 日付：
ru: Дата:
zh_cn: 日期：

source: Date & time:
ja: 日付時刻：
ru: Дата и время:
zh_cn: 约会时间：

source: Specify a format for the the {datetime} wildcard. You can use any conversion specifiers which can be used with the ANSI C strftime function.
ja: {datetime}ワイルドカードの形式を指定します。 ANSI Cのstrftime関数で使用できる任意の変換指定子を使用できます。
ru: Укажите формат для шаблона {datetime}. Вы можете использовать любые спецификаторы преобразования, которые могут использоваться с функцией ANSI C strftime.
zh_cn: 指定{datetime}通配符的格式。您可以使用任何可以与ANSI C strftime函数一起使用的转换说明符。

source: Specify a format for the the {year} wildcard. You can use any conversion specifiers which can be used with the ANSI C strftime function.
ja: {year}ワイルドカードの書式を指定します。 ANSI Cのstrftime関数で使用できる任意の変換指定子を使用できます。
ru: Укажите формат для шаблона {year}. Вы можете использовать любые спецификаторы преобразования, которые могут использоваться с функцией ANSI C strftime.
zh_cn: 指定{year}通配符的格式。您可以使用任何可以与ANSI C strftime函数一起使用的转换说明符。

source: Specify a format for the the {date} wildcard. You can use any conversion specifiers which can be used with the ANSI C strftime function.
ja: {date}ワイルドカードの形式を指定します。 ANSI Cのstrftime関数で使用できる任意の変換指定子を使用できます。
ru: Укажите формат для шаблона {date}. Вы можете использовать любые спецификаторы преобразования, которые могут использоваться с функцией ANSI C strftime.
zh_cn: 指定{日期}通配符的格式。您可以使用任何可以与ANSI C strftime函数一起使用的转换说明符。

source: <b>Template data</b>
ja: <b>テンプレートデータ</ b>
ru: <b> Данные шаблона </ b>
zh_cn: <b>模板数据</ b>

source: Templates
ja: テンプレート
ru: Шаблоны
zh_cn: 模板

source: C_hange
ja: 変化する
ru: Изменить
zh_cn: 更改

source: <b>Keyboard shortcuts</b>
ja: <b>キーボードショートカット</ b>
ru: <b> Ярлыки клавиш </ b>
zh_cn: <b>键盘快捷键</ b>

source: Keybindings
ja: キーバインディング
ru: Сочетания клавиш
zh_cn: 键绑定

source: Command:
ja: コマンド：
ru: Команда:
zh_cn: 命令：

source: Path to the command for printing files (use %f for the filename)
ja: ファイルを印刷するコマンドのパス（ファイル名に％fを使用）
ru: Путь к команде для печати файлов (используйте файл% f для имени файла)
zh_cn: 打印文件命令的路径（使用％f作为文件名）

source: Use an external command for printing
ja: 印刷に外部コマンドを使用する
ru: Использовать внешнюю команду для печати
zh_cn: 使用外部命令进行打印

source: Print line numbers
ja: 行番号を印刷する
ru: Номера строк печати
zh_cn: 打印行号

source: Add line numbers to the printed page
ja: 印刷されたページに行番号を追加する
ru: Добавить номера строк на распечатанную страницу
zh_cn: 将行号添加到打印页面

source: Print page numbers
ja: ページ番号を印刷する
ru: Печать номеров страниц
zh_cn: 打印页码

source: Add page numbers at the bottom of each page. It takes 2 lines of the page.
ja: 各ページの下部にページ番号を追加します。それはページの2行を取ります。
ru: Добавьте номера страниц в нижней части каждой страницы. Он занимает 2 строки страницы.
zh_cn: 在每个页面的底部添加页码。它占用了页面的两行。

source: Print page header
ja: ページヘッダーを印刷する
ru: Заголовок страницы печати
zh_cn: 打印页眉

source: Add a little header to every page containing the page number, the filename and the current date (see below). It takes 3 lines of the page.
ja: ページ番号、ファイル名、現在の日付を含むすべてのページに小さなヘッダーを追加します（下記参照）。それはページの3行かかります。
ru: Добавьте немного заголовка на каждую страницу, содержащую номер страницы, имя файла и текущую дату (см. Ниже). Он занимает 3 строки страницы.
zh_cn: 为包含页码，文件名和当前日期的每个页面添加一个小标题（见下文）。它占用了3行页面。

source: Use the basename of the printed file
ja: 印刷ファイルのベース名を使用する
ru: Используйте базовое имя печатного файла
zh_cn: 使用打印文件的基本名称

source: Print only the basename (without the path) of the printed file
ja: 印刷ファイルの基本名（パスなし）のみを出力する
ru: Распечатайте только базовое имя (без пути) отпечатанного файла
zh_cn: 只打印打印文件的基本名称（不含路径）

source: Date format:
ja: 日付形式：
ru: Формат даты:
zh_cn: 日期格式：

source: Specify a format for the date and time stamp which is added to the page header on each page. You can use any conversion specifiers which can be used with the ANSI C strftime function.
ja: 各ページのページヘッダーに追加される日付とタイムスタンプの形式を指定します。 ANSI Cのstrftime関数で使用できる任意の変換指定子を使用できます。
ru: Укажите формат даты и времени, который добавляется в заголовок страницы на каждой странице. Вы можете использовать любые спецификаторы преобразования, которые могут использоваться с функцией ANSI C strftime.
zh_cn: 指定添加到每个页面上页面标题的日期和时间戳的格式。您可以使用任何可以与ANSI C strftime函数一起使用的转换说明符。

source: Use native GTK printing
ja: ネイティブGTK印刷を使用する
ru: Использовать собственную печать GTK
zh_cn: 使用原生GTK打印

source: <b>Printing</b>
ja: <b>印刷</ b>
ru: <Б> Печать </ b>
zh_cn: <B>打印</ b>的

source: Printing
ja: 印刷
ru: печать
zh_cn: 印花

source: Font:
ja: フォント：
ru: Шрифт:
zh_cn: 字体：

source: Sets the font for the terminal widget
ja: 端末ウィジェットのフォントを設定します。
ru: Устанавливает шрифт для виджета терминала
zh_cn: 设置终端小部件的字体

source: Choose Terminal Font
ja: ターミナルフォントを選択
ru: Выберите Terminal Font
zh_cn: 选择终端字体

source: Foreground color:
ja: フォアグラウンドカラー：
ru: Цвет переднего плана:
zh_cn: 前景色：

source: Background color:
ja: 背景色：
ru: Фоновый цвет:
zh_cn: 背景颜色：

source: Background image:
ja: 背景画像：
ru: Изображение на заднем плане:
zh_cn: 背景图：

source: Scrollback lines:
ja: スクロールバック行：
ru: Линии прокрутки:
zh_cn: 回滚行：

source: Shell:
ja: シェル：
ru: Оболочка:
zh_cn: 贝壳：

source: Sets the foreground color of the text in the terminal widget
ja: ターミナルウィジェットのテキストの前景色を設定します。
ru: Устанавливает цвет переднего плана текста в виде виджета терминала
zh_cn: 设置终端窗口小部件中文本的前景色

source: Sets the background color of the text in the terminal widget
ja: 端末ウィジェットのテキストの背景色を設定します
ru: Устанавливает фоновый цвет текста в виджетах терминала
zh_cn: 设置终端窗口小部件中文本的背景颜色

source: Sets the path to the background image in the terminal widget
ja: 端末ウィジェットの背景画像へのパスを設定する
ru: Устанавливает путь к фоновому изображению в виджетах терминала
zh_cn: 设置终端窗口小部件中背景图片的路径

source: Specifies the history in lines, which you can scroll back in the terminal widget
ja: 行の履歴を指定します。これは端末ウィジェットでスクロールバックできます
ru: Указывает историю в строках, которые вы можете прокручивать назад в виджет терминала
zh_cn: 指定行中的历史记录，您可以在终端窗口小部件中向后滚动

source: Sets the path to the shell which should be started inside the terminal emulation
ja: ターミナルエミュレーション内で起動するシェルへのパスを設定します。
ru: Устанавливает путь к оболочке, которая должна запускаться внутри эмуляции терминала
zh_cn: 设置应该在终端仿真中启动的shell的路径

source: Scroll on keystroke
ja: キーストロークをスクロール
ru: Прокрутка по нажатию клавиши
zh_cn: 在击键上滚动

source: Whether to scroll to the bottom if a key was pressed
ja: キーが押された場合、下にスクロールするかどうか
ru: Независимо от того, чтобы прокручивать нижнюю часть, если нажата клавиша
zh_cn: 是否在按下按键时滚动到底部

source: Scroll on output
ja: 出力をスクロールする
ru: Прокрутка на выходе
zh_cn: 在输出上滚动

source: Whether to scroll to the bottom when output is generated
ja: 出力が生成されたときに下にスクロールするかどうか
ru: Независимо от того, чтобы прокручивать нижнюю часть при выходе
zh_cn: 输出生成时是否滚动到底部

source: Cursor blinks
ja: カーソルが点滅する
ru: Курсор мигает
zh_cn: 光标闪烁

source: Whether to blink the cursor
ja: カーソルを点滅させるかどうか
ru: Следует ли мигать курсором
zh_cn: 是否闪烁光标

source: Override Geany keybindings
ja: Geanyキーバインドをオーバーライドする
ru: Переопределение привязок Geany
zh_cn: 覆盖Geany键绑定

source: Allows the VTE to receive keyboard shortcuts (apart from focus commands)
ja: VTEがキーボードショートカットを受信できるようにします（フォーカスコマンドは別として）
ru: Позволяет VTE получать быстрые клавиши (кроме команд фокуса)
zh_cn: 允许VTE接收键盘快捷键（除了焦点命令）

source: Disable menu shortcut key (F10 by default)
ja: メニューショートカットキーを無効にする（デフォルトではF10）
ru: Отключить контекстную клавишу меню (по умолчанию F10)
zh_cn: 禁用菜单快捷键（默认为F10）

source: This option disables the keybinding to popup the menu bar (default is F10). Disabling it can be useful if you use, for example, Midnight Commander within the VTE.
ja: このオプションは、メニューバーをポップアップするためのキーバインディングを無効にします（デフォルトはF10）。それを無効にすると、たとえばVTE内でMidnight Commanderを使用すると便利です。
ru: Эта опция отключает привязку клавиш для всплытия панели меню (по умолчанию F10). Отключение его может быть полезно, если вы используете, например, Midnight Commander в VTE.
zh_cn: 此选项禁用键绑定来弹出菜单栏（默认为F10）。如果您在VTE内使用Midnight Commander，禁用它可能很有用。

source: Follow path of the current file
ja: 現在のファイルのパスに従います。
ru: Следуйте по пути к текущему файлу
zh_cn: 按照当前文件的路径

source: Whether to execute \"cd $path\" when you switch between opened files
ja: 開いているファイルを切り替えるときに\ "cd $ path \"を実行するかどうか
ru: Выполнять \ "cd $ path \" при переключении между открытыми файлами
zh_cn: 在打开的文件之间切换时是否执行\“cd $ path \”

source: Execute programs in the VTE
ja: VTEでプログラムを実行する
ru: Выполнять программы в VTE
zh_cn: 执行VTE中的程序

source: Run programs in VTE instead of opening a terminal emulation window. Please note, programs executed in VTE cannot be stopped
ja: 端末エミュレーションウィンドウを開く代わりにVTEでプログラムを実行する。 VTEで実行されたプログラムは停止できません
ru: Запускать программы в VTE вместо открытия окна эмуляции терминала. Обратите внимание, что программы, выполняемые в ВТЭ, не могут быть остановлены
zh_cn: 在VTE中运行程序，而不是打开终端仿真窗口。请注意，在VTE中执行的程序无法停止

source: Don't use run script
ja: 実行スクリプトを使用しない
ru: Не использовать сценарий запуска
zh_cn: 不要使用运行脚本

source: Don't use the simple run script which is usually used to display the exit status of the executed program
ja: 実行されたプログラムの終了ステータスを表示するために通常使用される単純実行スクリプトは使用しないでください
ru: Не используйте простой сценарий запуска, который обычно используется для отображения статуса выхода исполняемой программы
zh_cn: 不要使用通常用于显示执行程序退出状态的简单运行脚本

source: <b>Terminal</b>
ja: <b>端末</ b>
ru: <Б> Терминал </ B>
zh_cn: <B>终端</ b>的

source: Terminal
ja: 「ターミナル」
ru: Терминал
zh_cn: 终奌站

source: <i>Warning: read the manual before changing these preferences.</i>
ja: <i>警告：これらの設定を変更する前にマニュアルをお読みください。</ i>
ru: <i> Предупреждение: прочитайте руководство перед изменением этих настроек. </ i>
zh_cn: 警告：在更改这些偏好之前请阅读说明书。</ i>

source: <b>Various preferences</b>
ja: <b>さまざまな設定</ b>
ru: <b> Различные настройки </ b>
zh_cn: <b>各种偏好</ b>

source: Various
ja: 様々な
ru: Различный
zh_cn: 各个

source: _File
ja: _ファイル
ru: _Файл
zh_cn: _文件

source: _New Project...
ja: _新しいプロジェクト...
ru: _Новый проект...
zh_cn: _新项目...

source: _New File
ja: _Newファイル
ru: _Новый файл
zh_cn: _新文件

source: New File (from _Template)
ja: 新しいファイル（_Templateから）
ru: Новый файл (из _Template)
zh_cn: 新文件（来自_Template）

source: _Open Project...
ja: _プロジェクトを開く...
ru: _Открыть проект ...
zh_cn: _打开项目...

source: _Open File...
ja: _Openファイル...
ru: _Открыть файл...
zh_cn: _打开文件...

source: Recent _Projects
ja: 最近のプロジェクト
ru: Недавние Проекты
zh_cn: 最近的项目

source: Recent _Files
ja: 最近使用したファイル
ru: Недавние файлы
zh_cn: 最近的文件

source: Import an old AGK project and convert it to the new format
ja: 古いAGKプロジェクトをインポートして新しいフォーマットに変換する
ru: Импортируйте старый проект AGK и преобразуйте его в новый формат.
zh_cn: 导入旧的AGK项目并将其转换为新格式

source: _Import AGK Project...
ja: _ AGKプロジェクトをインポートする...
zh_cn: _导入AGK项目...

source: E_xport Project
ja: E_xportプロジェクト
ru: Проект E_xport
zh_cn: E_xport项目

source: As Android AP_K
ja: Android AP_Kとして
ru: Как Android AP_K
zh_cn: 作为Android AP_K

source: As iOS IPA
ja: iOS IPAとして
ru: Как iOS IPA
zh_cn: 作为iOS IPA

source: As HTML5
ja: HTML5として
ru: Как HTML5
zh_cn: 作为HTML5

source: Save _As...
ja: _Asを保存...
ru: Сохранить как...
zh_cn: 另存为...

source: Save A_ll
ja: すべてを救う
ru: Сохранить все
zh_cn: 保存全部

source: invisible
ja: 目に見えない
ru: невидимый
zh_cn: 无形

source: Page Set_up
ja: ページ設定
ru: Настройка страницы
zh_cn: 页面设置

source: _Print...
ru: _Распечатать...
zh_cn: _打印...

source: _Close Project
ja: _Closeプロジェクト
ru: _Закрыть проект
zh_cn: _关闭项目

source: Close All Projects
ja: すべてのプロジェクトを閉じる
ru: Закрыть все проекты
zh_cn: 关闭所有项目

source: _Close Document
ja: _ドキュメントを閉じる
ru: _Закрыть документ
zh_cn: _关闭文档

source: Close Ot_her Documents
ja: 閉じるOt_her書類
ru: Закрыть Отправление документов
zh_cn: 关闭Ot_her文件

source: C_lose All Documents
ja: すべてのドキュメントをC_lose
ru: C_lose Все документы
zh_cn: C_lose所有文件

source: _Cut Current Line(s)
ja: _現在の行を削除する
ru: Текущая линия (ы)
zh_cn: _Cut当前行（s）

source: _Copy Current Line(s)
ja: _現在の行のコピー
zh_cn: _复制当前行（s）

source: _Delete Current Line(s)
ja: _現在の行を削除する
ru: _Удалить текущую линию (линии)
zh_cn: _删除当前行

source: _Duplicate Line or Selection
ja: _重複ラインまたは選択
ru: _ Дубликат строки или выделения
zh_cn: _重复行或选择

source: _Select Current Line(s)
ja: _現在の行を選択
ru: _Выберите текущую линию (линий)
zh_cn: _选择当前行

source: _Select Current Paragraph
ja: _現在の段落を選択
ru: _Выберите текущий абзац
zh_cn: 选择当前段落

source: _Move Line(s) Up
ru: _Move Line (s) Вверх
zh_cn: _上线

source: _Move Line(s) Down
zh_cn: _移动下线

source: _Send Selection to Terminal
ja: _選択を端末に送る
ru: _Отправить выбор в терминал
zh_cn: _发送选择到终端

source: _Reflow Lines/Block
ja: _リフローライン/ブロック
zh_cn: _回流线/块

source: T_oggle Case of Selection
ja: T_oggle選択のケース
ru: T_oggle Случай выбора
zh_cn: T_oggle案例的选择

source: _Comment Line(s)
ja: _コメントライン
ru: _Комментарная линия (ы)
zh_cn: _评论专栏

source: U_ncomment Line(s)
ja: U_ncomment行
zh_cn: U_ncomment行（s）

source: _Toggle Line Commentation
ja: _トグルラインのコメント
ru: Комментарий _Toggle Line
zh_cn: _切换线的组合

source: _Increase Indent
ja: _インデントを増やします
ru: _Увеличить отступ
zh_cn: _增加缩进

source: _Decrease Indent
ja: _インデントを減らす
zh_cn: _减少缩进

source: _Smart Line Indent
ja: _スマートラインインデント
zh_cn: _Smart线缩进

source: _Send Selection to
ja: _選択を送信する
ru: _Отправить выбор в
zh_cn: _发送选择

source: Insert Dat_e
ru: Вставить Dat_e
zh_cn: 插入Dat_e

source: _Insert Alternative White Space
ja: _代わりの空白を挿入
ru: _Изменить альтернативное белое пространство
zh_cn: _插入备用空白空间

source: Preference_s
ja: 環境設定
zh_cn: 优先

source: P_lugin Preferences
ja: P_luginの設定
ru: Настройки P_lugin
zh_cn: P_lugin首选项

source: _Find...
ja: _見つけた...
ru: _Найти...
zh_cn: _找...

source: Find _Next
ja: 次を見つける
ru: Найти следующее
zh_cn: 找下一个

source: Find _Previous
ru: Найти _Предыдущий
zh_cn: 查找_以前

source: Find in F_iles...
ja: F_ilesで検索...
ru: Найти в F_iles ...
zh_cn: 在F_iles中查找...

source: _Replace...
zh_cn: _更换...

source: Next _Message
ja: 次のメッセージ
ru: Следующий _Message
zh_cn: 下一个_Message

source: Pr_evious Message
ja: Pr_eviousメッセージ
ru: Сообщение Pr_evious
zh_cn: Pr_evious消息

source: _Go to Next Marker
ja: _次のマーカーに移動
ru: _Перейти к следующему маркеру
zh_cn: _转到下一个标记

source: _Go to Previous Marker
ja: _前のマーカーに移動
ru: _Go к предыдущему маркеру
zh_cn: _转到上一个标记

source: _Go to Line...
ja: _行に移動...
zh_cn: _去线...

source: _More
ja: _もっと
ru: _Больше
zh_cn: _更多

source: Find Next _Selection
ja: 次を検索_Selection
ru: Найти Next _Selection
zh_cn: 查找下一步_选择

source: Find Pre_vious Selection
ja: Pre_vious Selectionを検索
ru: Найти предварительный выбор
zh_cn: 查找预先选择

source: Find _Document Usage
ja: _Documentの使用法を見つける
ru: Найти использование _Document
zh_cn: 查找_Document使用情况

source: _Mark All
ru: _Пометить все
zh_cn: _全部标记

source: Go to T_ag Declaration
ja: T_ag宣言に進む
ru: Перейти к заявке T_ag
zh_cn: 转到T_ag声明

source: _View
ru: _Посмотреть
zh_cn: _视图

source: Change _Font...
ja: _Fontを変更...
ru: Изменить _Font ...
zh_cn: 更改_Font ...

source: Change _Color Scheme...
ja: _Colorスキームを変更...
ru: Изменить _Color Scheme ...
zh_cn: 更改_Color计划...

source: Show _Markers Margin
ru: Показать марку _Markers
zh_cn: 显示_Markers保证金

source: Show _Line Numbers
ru: Показать номера _Line
zh_cn: 显示_Line号码

source: Show _White Space
ru: Показать _White Space
zh_cn: 显示_白色空间

source: Show Line _Endings
ja: ショーライン_エンディング
ru: Показать строку _Endings
zh_cn: 显示行_结尾

source: Show _Indentation Guides
ru: Показать _Интентификационные руководства
zh_cn: 显示_Indentation指南

source: Full_screen
ja: 全画面表示
ru: Полноэкранный
zh_cn: 全屏

source: To_ggle All Additional Widgets
ja: すべての追加のウィジェットを取り消す
ru: To_ggle Все дополнительные виджеты
zh_cn: 争取所有其他小部件

source: Show Message _Window
ja: メッセージを表示_Window
ru: Показать сообщение _Window
zh_cn: 显示消息_Window

source: Show _Toolbar
ja: _ツールバーを表示
ru: Показать _Toolbar
zh_cn: 显示_Toolbar

source: Show Side_bar
ja: Side_barを表示
ru: Показать Side_bar
zh_cn: 显示Side_bar

source: _Document
ja: _資料
ru: _Документ
zh_cn: _文件

source: _Line Wrapping
ja: _折り返し
zh_cn: _Line包装

source: Line _Breaking
ja: ライン_ブレーク
ru: Линия _Breaking
zh_cn: 行_Breaking

source: _Auto-indentation
ja: _オートインデント
ru: _Auto-отступы
zh_cn: _auto压痕

source: Read _Only
ja: _Onlyを読む
ru: Прочитать _Одно
zh_cn: 只读

source: _Write Unicode BOM
ja: _Unicode BOMを書き込む
zh_cn: _写Unicode码

source: Set File_type
ja: File_typeを設定する
ru: Установить File_type
zh_cn: 设置File_type

source: Set _Encoding
ja: _Encodingを設定する
ru: Установить _Encoding
zh_cn: 设置_Encoding

source: Set Line E_ndings
ja: セットラインE_ndings
ru: Установить строку E_ndings
zh_cn: 设置行E_ndings

source: Convert and Set to _CR/LF (Win)
ja: 変換して_CR / LF（Win）に設定する
ru: Преобразовать и установить на _CR / LF (Win)
zh_cn: 转换并设置为_CR / LF（Win）

source: Convert and Set to _LF (Unix)
ja: 変換して_LFに設定する（Unix）
ru: Преобразовать и установить в _LF (Unix)
zh_cn: 转换并设置为_LF（Unix）

source: Convert and Set to CR (_Mac)
ja: CRに変換して設定する（_Mac）
ru: Преобразовать и установить в CR (_Mac)
zh_cn: 转换并设置为CR（_Mac）

source: _Clone
ja: _クローン
zh_cn: _克隆

source: _Strip Trailing Spaces
ja: _ストリップスペース
zh_cn: _Strip拖尾空间

source: _Replace Tabs with Spaces
ja: _スペースでタブを置き換える
ru: _Выполнить вкладки пространством
zh_cn: _用空格替换标签

source: Re_place Spaces with Tabs...
ja: タブで空間を再配置する...
ru: Re_place Spaces с вкладками ...
zh_cn: 用标签重新放置空格...

source: _Fold All
zh_cn: _折叠全部

source: _Unfold All
ja: すべてを
zh_cn: _展开全部

source: Remove Brea_kpoints
ja: Brea_kpointsを削除
ru: Удалить Brea_kpoints
zh_cn: 删除Brea_kpoints

source: Remove Error _Indicators
ja: エラー_インジケータを削除
ru: Удалить ошибку _Индикаторы
zh_cn: 删除错误_Indicators

source: _Build
zh_cn: _建立

source: _Run
ru: _Бег
zh_cn: _跑

source: Run your project on the local machine
ja: ローカルマシンでプロジェクトを実行する
ru: Запустите проект на локальной машине
zh_cn: 在本地机器上运行您的项目

source: _Broadcast
ja: _放送
zh_cn: _广播

source: Broadcast your project to any listening devices
ja: 任意のリスニングデバイスにプロジェクトをブロードキャストする
ru: Трансляция вашего проекта на любые прослушивающие устройства
zh_cn: 将您的项目广播到任何听音设备

source: Debug your project on a particular device, set the IP address of the device in the build options
ja: 特定のデバイスでプロジェクトをデバッグし、ビルドオプションでデバイスのIPアドレスを設定します
ru: Отлаживайте проект на определенном устройстве, задайте IP-адрес устройства в настройках сборки
zh_cn: 在特定设备上调试您的项目，在构建选项中设置设备的IP地址

source: Pause/Continue the current program
ja: 現在のプログラムを一時停止/継続する
ru: Пауза / Продолжить текущую программу
zh_cn: 暂停/继续当前程序

source: Step
ja: ステップ
ru: шаг
zh_cn: 步

source: Execute the current line and pause on the next one, if the line contains a function call it will pause on the first line of that function
ja: 現在の行を実行し、次の行で一時停止します。行に関数呼び出しが含まれている場合は、その関数の最初の行で一時停止します
ru: Выполните текущую строку и выполните паузу на следующей, если строка содержит вызов функции, она будет приостановлена ​​в первой строке этой функции
zh_cn: 执行当前行并在下一行暂停，如果该行包含函数调用，则会在该函数的第一行暂停

source: Step Over Function
ja: ステップオーバー機能
ru: Шаг за функцией
zh_cn: 跨越功能

source: Execute the current line and pause on the next one, if the line contains any function calls it will execute them silently
ja: 現在の行を実行し、次の行で一時停止します。行に関数呼び出しが含まれていれば、それを静かに実行します
ru: Выполните текущую строку и выполните паузу на следующей, если строка содержит любые вызовы функций, она будет выполнять их молча
zh_cn: 执行当前行并在下一行中暂停，如果该行包含任何函数调用，它将静默执行它们

source: Step Out Of Function
ja: ステップアウト機能
ru: Выход из функции
zh_cn: 退出功能

source: Executes all the lines left in this function and then pauses on the line that called this function
ja: この関数に残っているすべての行を実行し、この関数を呼び出した行で一時停止します。
ru: Выполняет все строки, оставшиеся в этой функции, а затем останавливается на строке, вызывающей эту функцию
zh_cn: 执行此函数中剩下的所有行，然后在调用此函数的行上暂停

source: Toggle Breakpoint
ja: ブレークポイントの切り替え
ru: Переключить точку останова
zh_cn: 切换断点

source: Delete All Breakpoints
ja: すべてのブレークポイントを削除
ru: Удалить все точки останова
zh_cn: 删除所有断点

source: _Reload Configuration
ja: _Reload設定
ru: Конфигурация загрузки
zh_cn: _Reload配置

source: C_onfiguration Files
ja: C_onfigurationファイル
ru: Файлы C_onfiguration
zh_cn: C_配置文件

source: _Word Count
zh_cn: _字数

source: Load Ta_gs...
ja: Ta_gsをロード...
ru: Загрузить Ta_gs ...
zh_cn: 载入Ta_gs ...

source: Android
ja: アンドロイド
zh_cn: Android的

source: Generate Keystore File
ja: キーストアファイルを生成する
ru: Генерировать файл Keystore
zh_cn: 生成密钥库文件

source: Browse to AGK Player
ja: AGKプレーヤーを参照してください
ru: Поиск в AGK Player
zh_cn: 浏览AGK播放器

source: iOS
zh_cn: iOS版

source: Export AGK Player
ja: 輸出AGKプレーヤー
ru: Экспорт AGK Player
zh_cn: 导出AGK播放器

source: Install Additional Files...
ja: 追加ファイルをインストールする...
ru: Установка дополнительных файлов ...
zh_cn: 安装其他文件...

source: _Help
ja: _助けて
ru: _Помогите
zh_cn: _帮帮我

source: _Command Help
ja: _コマンドヘルプ
zh_cn: _命令帮助

source: _Help Home
ja: _ヘルプホーム
ru: Главная |
zh_cn: _帮助首页

source: _Video Tutorials
ja: _ビデオチュートリアル
ru: _Видео-учебники
zh_cn: _视频教程
