Repository: Dark-Basic-Software-Limited/AGKClassic
Catalog: AGK/IDE/Geany-1.24.1/po/*.po
Languages: ja, ru, zh_cn

source: _Keyboard Shortcuts
ja: _キーボードショートカット
ru: _Горячие клавиши
zh_cn: _键盘快捷键

source: _TGC Website
ja: _TGCウェブサイト
ru: Сайт _TGC
zh_cn: _TGC网站

source: Community _Forum
ja: コミュニティ_フォーラム
ru: Форум сообщества
zh_cn: 社区_论坛

source: _Upgrade To Full Version
ja: _フルバージョンにアップグレードする
ru: _Обновить до полной версии
zh_cn: _升级到完整版本

source: Debug _Messages
ja: デバッグ_メッセージ
zh_cn: 调试_消息

source: Current Project:
ja: 現行の企画：
ru: Текущий проект:
zh_cn: 当前的项目：

source: The currently active project used for building
ja: ビルドに使用されている現在アクティブなプロジェクト
ru: Текущий активный проект, используемый для строительства
zh_cn: 当前活动的项目用于构建

source: Project
ja: プロジェクト
ru: проект
zh_cn: 项目

source: Symbols
ja: シンボル
ru: Символы
zh_cn: 符号

source: Call Stack
ja: コールスタック
ru: Стек вызовов
zh_cn: 调用堆栈

source: Variables
ja: 変数
ru: переменные
zh_cn: 变量

source: Debug
ja: デバッグ
ru: Отлаживать
zh_cn: 调试

source: Status
ja: 状態
ru: Положение дел
zh_cn: 状态

source: Compiler
ja: コンパイラ
ru: составитель
zh_cn: 编译器

source: Search Results
ja: の検索結果
ru: результаты поиска
zh_cn: 搜索结果

source: Scribble
ja: 落書き
ru: мазня
zh_cn: 涂

source: Debug Log
ja: デバッグログ
ru: Журнал отладки
zh_cn: 调试日志

source: Project Properties
ja: プロジェクトのプロパティ
ru: Свойства проекта
zh_cn: 项目属性

source: Filename:
ja: ファイル名：
ru: Имя файла:
zh_cn: 文件名：

source: Name:
ja: 名：
ru: Имя:
zh_cn: 名称：

source: Description:
ja: 説明：
ru: Описание:
zh_cn: 描述：

source: Base path:
ja: ベースパス：
ru: Базовый путь:
zh_cn: 基本路径：

source: File patterns:
ja: ファイルパターン：
ru: Шаблоны файлов:
zh_cn: 文件模式：

source: Space separated list of file patterns used for the find in files dialog (e.g. *.c *.h)
ja: ファイル内の検索ダイアログボックスで使用されるファイルパターンのスペース区切りリスト（例：* .c * .h）
ru: Пространственный список файлов, используемых для диалога поиска в файлах (например, * .c * .h)
zh_cn: 用于在文件查找对话框中使用的文件模式的空格分隔列表（例如* .c * .h）

source: Detect type from file
ja: ファイルから型を検出する
ru: Тип обнаружения из файла
zh_cn: 从文件中检测类型

source: Whether to detect the indentation type from file contents when a file is opened
ja: ファイルを開いたときにファイル内容からインデントタイプを検出するかどうか
ru: Независимо от того, следует ли определять тип отступов из содержимого файла при открытии файла
zh_cn: 打开文件时是否检测文件内容的缩进类型

source: Use spaces if the total indent is less than the tab width, otherwise use both
ja: インデントの合計がタブの幅より小さい場合はスペースを使用し、そうでない場合は両方を使用します
ru: Используйте пробелы, если общий отступ меньше ширины табуляции, в противном случае используйте оба
zh_cn: 如果总缩进小于制表符宽度，请使用空格，否则使用两者

source: Use spaces when inserting indentation
ja: インデントを挿入するときにスペースを使用する
ru: Использовать пробелы при вставке отступов
zh_cn: 插入缩进时使用空格

source: Use one tab per indent
ja: インデントごとに1つのタブを使用する
ru: Использовать одну вкладку для каждого отступа
zh_cn: 每个缩进使用一个选项卡

source: Detect width from file
ja: ファイルからの幅を検出する
ru: Определить ширину из файла
zh_cn: 从文件中检测宽度

source: Whether to detect the indentation width from file contents when a file is opened
ja: ファイルを開いたときのファイルの内容からインデント幅を検出するかどうか
ru: Независимо от того, следует ли определять ширину отступа из содержимого файла при открытии файла
zh_cn: 打开文件时是否检测文件内容的缩进宽度

source: Display:
ja: 表示：
ru: Дисплей:
zh_cn: 显示：

source: Custom
ja: カスタム
ru: изготовленный на заказ
zh_cn: 习惯

source: Use global settings
ja: グローバル設定を使用する
ru: Использовать глобальные настройки
zh_cn: 使用全局设置

source: Replace tabs with space
ja: タブをスペースに置き換える
ru: Заменить вкладки пробелом
zh_cn: 用空格替换标签

source: Size:
ja: サイズ：
ru: Размер:
zh_cn: 尺寸：

source: Location:
ja: ロケーション：
ru: Место нахождения:
zh_cn: 位置：

source: Read-only:
ja: 読み取り専用：
ru: Только для чтения:
zh_cn: 只读：

source: Encoding:
ja: エンコーディング：
ru: Кодирование:
zh_cn: 编码方式：

source: Modified:
ja: 変更された：
ru: Изменен:
zh_cn: 改性：

source: Changed:
ja: かわった：
ru: Изменен:
zh_cn: 更改：

source: Accessed:
ja: アクセス：
zh_cn: 访问：

source: (only inside Geany)
ja: （Geany内のみ）
ru: (только внутри Geany)
zh_cn: （只在Geany里面）

source: Permissions:
ja: 権限：
ru: Разрешения:
zh_cn: 权限：

source: Read:
ja: 読む：
ru: Читать:
zh_cn: 读：

source: Write:
ja: 書きます：
ru: Написать:
zh_cn: 写：

source: Execute:
ja: 実行：
ru: Выполнение:
zh_cn: 执行：

source: Owner:
ja: オーナー：
ru: Владелец:
zh_cn: 所有者：

source: Group:
ja: グループ：
ru: Группа:
zh_cn: 组：

source: Other:
ja: その他：
ru: Другие:
zh_cn: 其他：

source: AGK Trial Version
ja: AGK試用版
ru: Испытательная версия AGK
zh_cn: AGK试用版

source: _Upgrade Now
ja: _今すぐアップグレード
ru: _Обнови сейчас
zh_cn: _现在升级

source: _Continue With Trial
ja: _トライアルを続ける
zh_cn: _继续试用

source: <span>Built on Geany 1.24.1</span>
ja: <span> Geany 1.24.1上に構築された</ span>
ru: <span> Построено на Geany 1.24.1 </ span>
zh_cn: <span>建立在Geany 1.24.1 </ span>上

source: App Game Kit (c) 2014 The Game Creators Ltd. All Rights Reserved. Geany Copyright (c) 2005-2014 Colomban Wendling Nick Treleaven Matthew Brush Enrico Tröger Frank Lanitz All rights reserved.
ja: アプリゲームキット（c）2014 ゲームクリエイター株式会社All Rights Reserved。 Geany Copyright（c）2005-2014 コロンバンウェリング Nick Treleaven マシューブラシ エンリコ・トーゲル フランク・ラニッツ 全著作権所有。
ru: Комплект игровых приложений (c) 2014 The Game Creators Ltd. Все права защищены. Geany Copyright (c) 2005-2014 Коломан Вендлинг Ник Треливен Мэтью Киш Энрико Трёгер Фрэнк Ланиц Все права защищены.
zh_cn: 应用游戏套件（c）2014 游戏创作者有限公司保留所有权利。 Geany版权所有（c）2005-2014 Colomban Wendling 尼克Treleaven 马修刷 恩里科Tröger 弗兰克兰尼茨 版权所有。

source: About AppGameKit
ja: AppGameKitについて
ru: О приложении AppGameKit
zh_cn: 关于AppGameKit

source: A fast and lightweight IDE
ja: 高速で軽量なIDE
ru: Быстрая и легкая среда IDE
zh_cn: 一个快速轻量级的IDE

source: (built on %s)
ja: （％s上に構築されています）
ru: (построено на% s)
zh_cn: （建立在％s上）

source: Info
ja: 情報
ru: Информация
zh_cn: 信息

source: AppGameKit Credits
ja: AppGameKitクレジット
ru: Кредиты AppGameKit
zh_cn: AppGameKit积分

source: Producer
ja: プロデューサー
ru: Режиссер
zh_cn: 制片人

source: Developer
ja: 開発者
ru: разработчик
zh_cn: 开发人员

source: Examples, Demos, and Help
ja: 例、デモ、およびヘルプ
ru: Примеры, демонстрации и помощь
zh_cn: 示例，演示和帮助

source: Graphics
ja: グラフィックス
ru: Графика
zh_cn: 图像

source: maintainer
ja: メンテナー
ru: сопровождающий
zh_cn: 维护者

source: developer
ja: 開発者
ru: разработчик
zh_cn: 开发人员

source: translation maintainer
ja: 翻訳メンテナー
ru: переводчик
zh_cn: 翻译维护人员

source: Geany Contributors
ja: Geanyの貢献者
ru: Участники форума
zh_cn: Geany贡献者

source: Credits
ja: クレジット
ru: кредиты
zh_cn: 积分

source: The following license applies to the IDE only The source code can be found at https://github.com/TheGameCreators/AGKIDE
ja: 次のライセンスは、IDEのみに適用されます ソースコードはhttps://github.com/TheGameCreators/AGKIDEにあります。
ru: Следующая лицензия распространяется только на IDE Исходный код можно найти на странице https://github.com/TheGameCreators/AGKIDE
zh_cn: 以下许可证仅适用于IDE 源代码可以在https://github.com/TheGameCreators/AGKIDE找到

source: License text could not be found, please visit http://www.gnu.org/licenses/gpl-2.0.txt to view it online.
ja: ライセンステキストが見つかりませんでした。http://www.gnu.org/licenses/gpl-2.0.txtにアクセスしてオンラインでご覧ください。
ru: Текст лицензии не найден, посетите http://www.gnu.org/licenses/gpl-2.0.txt, чтобы просмотреть его онлайн.
zh_cn: 无法找到许可证文本，请访问http://www.gnu.org/licenses/gpl-2.0.txt在线查看。

source: License
ja: ライセンス
ru: Лицензия
zh_cn: 执照

source: EULA text could not be found, please visit http://www.appgamekit.com for more information.
ja: EULAのテキストが見つかりませんでした。詳細については、http：//www.appgamekit.comをご覧ください。
ru: Текст EULA не найден, пожалуйста, посетите страницу http://www.appgamekit.com для получения дополнительной информации.
zh_cn: EULA文本找不到，请访问http://www.appgamekit.com获取更多信息。

source: failed to substitute %%p, no project active
ja: %% pと置換できませんでした。プロジェクトはアクティブではありません
ru: не удалось заменить %% p, нет активного проекта
zh_cn: 未能替换%% p，没有项目处于活动状态

source: Process failed, no working directory
ja: プロセスは失敗し、作業ディレクトリはありません
ru: Не удалось выполнить процесс, нет рабочего каталога
zh_cn: 进程失败，没有工作目录

source: %s (in directory: %s)
ja: ％s（ディレクトリ：％s）
ru: % s (в каталоге:% s)
zh_cn: ％s（在目录中：％s）

source: build command spawning failed: %s
ja: ビルドコマンドの生成に失敗しました：％s
ru: Не удалось создать командную команду:% s
zh_cn: 构建命令产卵失败：％s

source: Process failed (%s)
ja: プロセスが失敗しました（％s）
ru: Не удалось выполнить процесс (% s)
zh_cn: 进程失败（％s）

source: Failed to compile project, it must contain a 'main.agc' file in the project directory
ja: プロジェクトをコンパイルできませんでした。プロジェクトディレクトリに 'main.agc'ファイルが含まれている必要があります
ru: Не удалось скомпилировать проект, он должен содержать файл «main.agc» в каталоге проекта
zh_cn: 无法编译项目，它必须在项目目录中包含一个'main.agc'文件

source: Could not find compiler, please check the compiler path in the build options
ja: コンパイラが見つかりませんでした。ビルドオプションでコンパイラのパスを確認してください
ru: Не удалось найти компилятор, проверьте путь компилятора в параметрах сборки.
zh_cn: 找不到编译器，请检查编译选项中的编译器路径

source: Running %s (in directory: %s)
ja: ％sを実行中（ディレクトリ：％s）
ru: Запуск% s (в каталоге:% s)
zh_cn: 运行％s（在目录中：％s）

source: Failed to run project locally, project is already running
ja: プロジェクトをローカルで実行できませんでした。プロジェクトは既に実行されています
ru: Не удалось запустить проект локально, проект уже запущен
zh_cn: 无法在本地运行项目，项目已在运行

source: Failed to run project locally, program not found
ja: プロジェクトをローカルで実行できず、プログラムが見つかりませんでした
ru: Не удалось запустить проект локально, программа не найдена
zh_cn: 未能在本地运行项目，找不到程序

source: g_spawn_async() failed: %s
ja: g_spawn_async（）が失敗しました：％s
ru: Ошибка g_spawn_async ():% s
zh_cn: g_spawn_async（）失败：％s

source: Failed to broadcast project, broadcaster is already running
ja: プロジェクトをブロードキャストできませんでした。ブロードキャスタはすでに実行中です
ru: Не удалось передать проект, вещатель уже запущен
zh_cn: 无法播出项目，广播公司已在运行

source: Failed to broadcast project, debugger is currently running
ja: プロジェクトをブロードキャストできませんでした。デバッガは現在実行中です。
ru: Не удалось выполнить трансляцию проекта, в настоящее время работает отладчик
zh_cn: 无法播放项目，调试器当前正在运行

source: Failed to broadcast project, broadcaster program not found
ja: プロジェクトをブロードキャストできませんでした。ブロードキャスタプログラムが見つかりませんでした。
ru: Не удалось передать проект, программа вещателя не найдена
zh_cn: 未能播出项目，找不到广播公司节目

source: Failed to debug project, broadcaster is already running
ja: プロジェクトのデバッグに失敗しました。ブロードキャスタはすでに実行されています
ru: Не удалось отладить проект, вещатель уже запущен
zh_cn: 无法调试项目，广播公司已在运行

source: Failed to debug project, debugger is already running
ja: プロジェクトのデバッグに失敗しました。デバッガはすでに実行中です。
ru: Не удалось отладить проект, отладчик уже запущен
zh_cn: 无法调试项目，调试器已在运行

source: Failed to debug project, debug broadcaster not found
ja: プロジェクトのデバッグに失敗し、デバッグブロードキャスタが見つかりませんでした
ru: Не удалось отладить проект, отладка вещателя не найдена
zh_cn: 无法调试项目，找不到调试广播公司

source: Failed to broadcast project, debug broadcaster not found
ja: プロジェクトをブロードキャストできませんでした。デバッグブロードキャスタが見つかりませんでした
ru: Не удалось передать проект, отладка вещателя не найдена
zh_cn: 无法播放项目，未找到调试广播公司

source: Debugging on remote devices is disabled in the trial version. Remove the debug IP address in the build settings to stop this message
ja: 試用版では、リモートデバイスでのデバッグは無効になっています。このメッセージを停止するには、ビルド設定でデバッグIPアドレスを削除してください
ru: Отладка на удаленных устройствах отключена в пробной версии. Удалите IP-адрес отладки в настройках сборки, чтобы остановить это сообщение.
zh_cn: 试用版中禁用远程设备上的调试。删除生成设置中的调试IP地址以停止此消息

source: Debugging on local machine, to debug on a device set its IP address in the build options
ja: ローカルマシンでのデバッグ、デバイス上でのデバッグ、ビルドオプションでのIPアドレスの設定
ru: Отладка на локальном компьютере, отладка на устройстве, установка его IP-адреса в настройках сборки
zh_cn: 在本地机器上进行调试，在设备上进行调试，在构建选项中设置其IP地址

source: Failed to debug project locally, interpreter program not found
ja: プロジェクトをローカルでデバッグできなかった、インタプリタ・プログラムが見つかりませんでした
ru: Не удалось отладить проект локально, программа-интерпретатор не найдена
zh_cn: 无法在本地调试项目，找不到解释程序

source: Failed to debug project locally, interpreter failed to run
ja: プロジェクトをローカルでデバッグできなかったため、インタープリタを実行できませんでした
ru: Не удалось отладить проект локально, интерпретатор не смог выполнить
zh_cn: 无法在本地调试项目，解释器无法运行

source: Failed to change the working directory to "%s"
ja: 作業ディレクトリを "％s"に変更できませんでした
ru: Не удалось изменить рабочий каталог на "% s"
zh_cn: 无法将工作目录更改为“％s”

source: Failed to execute "%s" (start-script could not be created: %s)
ja: "％s"の実行に失敗しました（開始スクリプトを作成できませんでした：％s）
ru: Не удалось выполнить «% s» (start-script не удалось создать:% s)
zh_cn: 无法执行“％s”（启动脚本无法创建：％s）

source: Could not execute the file in the VTE because it probably contains a command.
ja: おそらくコマンドが含まれているため、VTEでファイルを実行できませんでした。
ru: Не удалось выполнить файл в VTE, потому что он, вероятно, содержит команду.
zh_cn: 无法在VTE中执行该文件，因为它可能包含命令。

source: Could not parse terminal command "%s" (check Terminal tool setting in Preferences)
ja: ターミナルコマンド "％s"を解析できませんでした（[環境設定]の[ターミナルツール]設定を確認してください）
ru: Не удалось разобрать команду терминала «% s» (проверьте настройку инструмента терминала в настройках)
zh_cn: 无法解析终端命令“％s”（在首选项中检查终端工具设置）

source: Could not find terminal "%s" (check path for Terminal tool setting in Preferences)
ja: 端末 "％s"を見つけられませんでした（環境設定でターミナルツール設定のパスを確認してください）
ru: Не удалось найти терминал «% s» (проверить путь для параметра «Установка терминала» в «Настройки»)
zh_cn: 找不到终端“％s”（在首选项中查看终端工具设置的路径）

source: Entering directory
ja: ディレクトリの入力
ru: Вход в каталог
zh_cn: 进入目录

source: Leaving directory
ja: ディレクトリから出る
ru: Выход из каталога
zh_cn: 离开目录

source: Compilation failed.
ja: コンパイルに失敗しました。
ru: Ошибка компиляции.
zh_cn: 编译失败。

source: Compilation finished successfully.
ja: コンパイルが正常に終了しました。
ru: Компиляция завершена успешно.
zh_cn: 编译成功完成。

source: Custom Text
ja: カスタムテキスト
ru: Пользовательский текст
zh_cn: 自定义文本

source: Enter custom text here, all entered text is appended to the command.
ja: ここにカスタムテキストを入力すると、入力されたすべてのテキストがコマンドに追加されます。
ru: Введите здесь специальный текст, добавленный текст добавляется к команде.
zh_cn: 在此输入自定义文本，所有输入的文本都会附加到命令中。

source: _Next Error
ja: _次のエラー
ru: Ошибка _Next
zh_cn: _下一个错误

source: _Previous Error
ja: _前のエラー
ru: _Подробная ошибка
zh_cn: _以前的错误

source: _Set Build Commands
ja: _Setビルドコマンド
ru: Команды создания сборки
zh_cn: _设置生成命令

source: You must open a project before you can compile
ja: コンパイルする前にプロジェクトを開く必要があります
ru: Вы должны открыть проект, прежде чем сможете скомпилировать
zh_cn: 在编译之前，您必须先打开一个项目

source: You must open a project before you can run
ja: 実行する前にプロジェクトを開く必要があります
ru: Вы должны открыть проект, прежде чем сможете запустить
zh_cn: 您可以运行之前，您必须先打开一个项目

source: You must open a project before you can broadcast
ja: 放送する前にプロジェクトを開く必要があります
ru: Вы должны открыть проект, прежде чем вы сможете транслировать
zh_cn: 您必须先开启一个项目，然后才能播出

source: You must open a project before you can debug
ja: デバッグする前にプロジェクトを開く必要があります
ru: Вы должны открыть проект, прежде чем сможете отлаживать
zh_cn: 在调试之前，您必须先打开一个项目

source: Compile the project '%s'
ja: プロジェクト '％s'をコンパイルする
ru: Скомпилировать проект «% s»
zh_cn: 编译项目'％s'

source: Run the project '%s' on the local machine
ja: ローカルマシン上でプロジェクト '％s'を実行する
ru: Запустите проект «% s» на локальной машине
zh_cn: 在本地机器上运行项目'％s'

source: Broadcast the project '%s' to any listening devices
ja: プロジェクト '％s'を任意のリスニングデバイスにブロードキャストします。
ru: Передавать проект «% s» на любые прослушивающие устройства
zh_cn: 将项目'％s'广播到任何收听设备

source: Debug the project '%s' on a particular device
ja: 特定のデバイスでプロジェクト '％s'をデバッグする
ru: Отладить проект «% s» на конкретном устройстве
zh_cn: 在特定设备上调试项目'％s'

source: Build the current file with Make and the default target
ja: Makeとデフォルトのターゲットで現在のファイルをビルドする
ru: Создайте текущий файл с помощью Make и целевой по умолчанию
zh_cn: 使用Make和默认目标构建当前文件

source: Build the current file with Make and the specified target
ja: Makeと指定されたターゲットで現在のファイルをビルドする
ru: Создайте текущий файл с помощью Make и указанной цели.
zh_cn: 使用Make和指定的目标构建当前文件

source: Compile the current file with Make
ja: 現在のファイルをMakeでコンパイルする
ru: Скомпилируйте текущий файл с помощью Make
zh_cn: 使用Make编译当前文件

source: Process could not be stopped (%s).
ja: プロセスを停止できませんでした（％s）。
ru: Процесс не может быть остановлен (% s).
zh_cn: 进程无法停止（％s）。

source: No more build errors.
ja: これ以上のビルドエラーはありません。
ru: Больше ошибок сборки.
zh_cn: 没有更多的构建错误。

source: Set menu item label
ja: メニュー項目のラベルを設定する
ru: Установить ярлык элемента меню
zh_cn: 设置菜单项标签

source: Label
ja: ラベル
ru: метка
zh_cn: 标签

source: Command
ja: コマンド
ru: команда
zh_cn: 命令

source: Working directory
ja: 作業ディレクトリ
ru: Рабочий каталог
zh_cn: 工作目录

source: Reset
ja: リセット
ru: Сброс
zh_cn: 重启

source: Click to set menu item label
ja: クリックしてメニュー項目のラベルを設定する
ru: Нажмите, чтобы установить ярлык элемента меню
zh_cn: 点击设置菜单项标签

source: %s commands
ja: ％sコマンド
ru: Команды% s
zh_cn: ％s命令

source: No filetype
ja: ファイルタイプがありません
ru: Нет типа файла
zh_cn: 没有文件类型

source: Error regular expression:
ja: エラー正規表現：
ru: Ошибка регулярного выражения:
zh_cn: 正则表达式出错：

source: Independent commands
ja: 独立したコマンド
ru: Независимые команды
zh_cn: 独立的命令

source: Note: Item 2 opens a dialog and appends the response to the command.
ja: 注：項目2はダイアログを開き、コマンドに応答を追加します。
ru: Примечание. Пункт 2 открывает диалог и добавляет ответ на команду.
zh_cn: 注意：第2项打开一个对话框并将响应追加到命令中。

source: Execute commands
ja: コマンドを実行する
ru: Выполнять команды
zh_cn: 执行命令

source: %d, %e, %f, %p are substituted in command and directory fields, see manual for details.
ja: ％d、％e、％f、％pはコマンドとディレクトリのフィールドで置き換えられます。詳しくは、マニュアルを参照してください。
ru: % d,% e,% f,% p заменены в командных и справочных полях, см. руководство для деталей.
zh_cn: ％d，％e，％f，％p被替换为命令和目录字段，详细信息请参见手册。

source: Set Build Commands
ja: ビルドコマンドの設定
ru: Установить команды сборки
zh_cn: 设置生成命令

source: _Execute
zh_cn: _执行

source: Make Custom _Target...
ja: カスタム_ターゲットを作る...
ru: Сделать Custom _Target ...
zh_cn: 制作自定义_目标...

source: Make _Object
ru: Сделать _Object
zh_cn: 制作_Object

source: _Make
ru: _Делать
zh_cn: _使

source: %d file saved.
ja: ％d個のファイルが保存されました。
ru: Файл% d сохранен.
zh_cn: 已保存％d个文件。

source: Cannot quit whilst an update is in progress, please wait
ja: 更新中は終了できません、しばらくお待ちください
ru: Не удается завершить работу, пока обновление не выполняется, подождите
zh_cn: 更新正在进行时无法退出，请稍候

source: Do you really want to quit?
ja: あなたは本当にやめたいですか？
ru: Вы действительно хотите бросить курить?
zh_cn: 你真的想戒烟吗？

source: Any unsaved changes will be lost.
ja: 保存されていない変更は失われます。
ru: Любые несохраненные изменения будут потеряны.
zh_cn: 任何未保存的更改都将丢失。

source: Are you sure you want to reload '%s'?
ja: '％s'をリロードしてもよろしいですか？
ru: Вы действительно хотите перезагрузить '% s'?
zh_cn: 你确定要重新加载'％s'吗？

source: Go to Line
ja: ラインに行く
ru: Перейти к строке
zh_cn: 去线

source: Enter the line you want to go to:
ja: あなたが行きたい行を入力してください：
ru: Введите строку, в которую хотите перейти:
zh_cn: 输入你想要去的行：

source: Please set the filetype for the current file before using this function.
ja: この機能を使用する前に、現在のファイルのファイルタイプを設定してください。
ru: Перед использованием этой функции установите тип файла для текущего файла.
zh_cn: 在使用此功能之前，请设置当前文件的文件类型。

source: _Use Custom Date Format
ja: _カスタム日付書式を使用する
ru: _Используйте пользовательский формат даты
zh_cn: _使用自定义日期格式

source: Custom Date Format
ja: カスタム日付形式
ru: Пользовательский формат даты
zh_cn: 自定义日期格式

source: Enter here a custom date and time format. You can use any conversion specifiers which can be used with the ANSI C strftime function.
ja: カスタムの日付と時刻の形式をここに入力します。 ANSI Cのstrftime関数で使用できる任意の変換指定子を使用できます。
ru: Введите здесь специальный формат даты и времени. Вы можете использовать любые спецификаторы преобразования, которые могут использоваться с функцией ANSI C strftime.
zh_cn: 在此输入自定义日期和时间格式。您可以使用任何可以与ANSI C strftime函数一起使用的转换说明符。

source: Date format string could not be converted (possibly too long).
ja: 日付書式文字列を変換できませんでした（おそらく長すぎます）。
ru: Строка формата даты не может быть преобразована (возможно, слишком длинная).
zh_cn: 日期格式字符串无法转换（可能太长）。

source: No more message items.
ja: メッセージ項目はこれ以上ありません。
ru: Больше элементов сообщения.
zh_cn: 没有更多的消息项目。

source: Unfortunately exporting is not supported on Raspberry Pi
ja: 残念ながら、エクスポートはRaspberry Piではサポートされていません
ru: К сожалению, экспорт не поддерживается на малине Pi
zh_cn: 不幸的是，在Raspberry Pi上不支持导出

source: Generating a keystore is not available in the trial version
ja: 試用版でキーストアを生成することはできません
ru: Генерация хранилища ключей недоступна в пробной версии
zh_cn: 生成密钥库在试用版中不可用

source: Unfortunately generating a keystore is not supported on Raspberry Pi
ja: 残念ながら、キーストアを生成することはRaspberry Piではサポートされていません
ru: К сожалению, создание хранилища ключей не поддерживается на малине Pi
zh_cn: 遗憾的是，在Raspberry Pi上不支持生成密钥库

source: Exporting to IPA is only possible on Mac
ja: IPAへのエクスポートはMacでのみ可能です
ru: Экспорт в IPA возможен только на Mac
zh_cn: 导出到IPA只能在Mac上使用

source: You must have a project open to export it
ja: エクスポートするプロジェクトを開いておく必要があります
ru: У вас должен быть открытый проект для экспорта
zh_cn: 您必须打开一个项目才能导出它

source: iOS player is not available in the trial version
ja: 試用版ではiOSプレーヤーは利用できません
ru: iOS-плеер недоступен в пробной версии
zh_cn: iOS播放器在试用版中不可用

source: Android player is not available in the trial version
ja: Androidプレーヤーは試用版では使用できません
ru: Android-плеер недоступен в пробной версии
zh_cn: Android播放器在试用版中不可用

source: Stop _Running
ja: 停止_Running
ru: Прекратить бег
zh_cn: 停止_运行

source: Stop _Broadcasting
ja: 停止_放送
ru: Остановка _Broadcasting
zh_cn: 停止_广播

source: Stop _Debugging
ja: 停止_Debugging
ru: Остановить _Debugging
zh_cn: 停止_Debugging

source: Could not open file %s (File not found)
ja: ファイル％sを開けませんでした（ファイルが見つかりません）
ru: Не удалось открыть файл% s (Файл не найден)
zh_cn: 无法打开文件％s（找不到文件）

source: Detect from file
ja: ファイルから検出する
ru: Обнаружение из файла
zh_cn: 从文件中检测

source: West European
ja: 西ヨーロッパ
ru: Западно-Европейский
zh_cn: 西欧

source: East European
ja: 東ヨーロッパ
ru: Восточно-Европейский
zh_cn: 东欧

source: East Asian
ja: 東アジア
ru: Восточная Азия
zh_cn: 东亚

source: SE & SW Asian
ja: SE＆SWアジア系
zh_cn: SE＆SW亚洲

source: Middle Eastern
ja: 中東
ru: Ближневосточный
zh_cn: 中东

source: Unicode
zh_cn: 统一

source: _More Options
ja: _より多くのオプション
ru: _Больше вариантов
zh_cn: _更多的选择

source: Show _hidden files
ja: _hiddenファイルを表示する
ru: Показать скрытые файлы
zh_cn: 显示_hidden文件

source: Set encoding:
ja: エンコーディングの設定：
ru: Установить кодировку:
zh_cn: 设置编码：

source: Explicitly defines an encoding for the file, if it would not be detected. This is useful when you know that the encoding of a file cannot be detected correctly by Geany. Note if you choose multiple files, they will all be opened with the chosen encoding.
ja: 検出されない場合、ファイルのエンコーディングを明示的に定義します。これは、Geanyがファイルのエンコーディングを正しく検出できないことがわかっている場合に便利です。 複数のファイルを選択すると、選択したエンコーディングでファイルがすべて開かれます。
ru: Явно определяет кодировку для файла, если он не будет обнаружен. Это полезно, если вы знаете, что кодировка файла не может быть обнаружена Geany. Обратите внимание, что если вы выберете несколько файлов, все они будут открыты с выбранной кодировкой.
zh_cn: 明确定义文件的编码，如果它不被检测到。当您知道Geany无法正确检测到文件的编码时，这非常有用。 请注意，如果您选择多个文件，它们将全部以选定的编码打开。

source: Set filetype:
ja: ファイルタイプを設定する：
ru: Установить тип файла:
zh_cn: 设置文件类型：

source: Explicitly defines a filetype for the file, if it would not be detected by filename extension. Note if you choose multiple files, they will all be opened with the chosen filetype.
ja: ファイル名の拡張子によって検出されない場合、ファイルのファイルタイプを明示的に定義します。 複数のファイルを選択すると、選択したファイルタイプですべて開くことになります。
ru: Явно определяет тип файла для файла, если он не будет обнаружен расширением имени файла. Обратите внимание, что если вы выберете несколько файлов, все они будут открыты с выбранным типом файла.
zh_cn: 明确定义文件的文件类型，如果文件扩展名不能检测到。 请注意，如果您选择多个文件，它们将全部以选定的文件类型打开。

source: Open File
ja: ファイルを開く
ru: Открыть файл
zh_cn: 打开文件

source: Opens the file in read-only mode. If you choose more than one file to open, all files will be opened read-only.
ja: 読み取り専用モードでファイルを開きます。開くファイルを複数選択すると、すべてのファイルが読み取り専用で開かれます。
ru: Открывает файл в режиме только для чтения. Если вы выберете более одного файла для открытия, все файлы будут открыты только для чтения.
zh_cn: 以只读模式打开文件。如果您选择多个文件打开，则所有文件将以只读方式打开。

source: Detect by file extension
ja: ファイル拡張子で検出
ru: Обнаружение по расширению файла
zh_cn: 通过文件扩展名进行检测

source: Overwrite?
ja: 上書き？
ru: Переписать?
zh_cn: 覆盖？

source: Filename already exists!
ja: ファイル名は既に存在します！
ru: Имя файла уже существует!
zh_cn: 文件名已存在！

source: Save File
ja: ファイルを保存
ru: Сохранить файл
zh_cn: 保存存档
